[
    {
        "company": "Intermountain Healthcare (IMH)",
        "company_url": "https://imh.wd5.myworkdayjobs.com/IntermountainCareers?q=nurse",
        "job_title": "Physical Therapist PRN",
        "job_href": "https://imh.wd5.myworkdayjobs.com/en-US/IntermountainCareers/job/McKay-Dee-Surgical-Center/Physical-Therapist-PRN_R123528?q=nurse",
        "job_posting_text": "locations\nMcKay-Dee Surgical Center\ntime type\nPart time\nposted on\nPosted Today\ntime left to apply\nEnd Date: May 23, 2025 (12 days left to apply)\njob requisition id\nR123528\nJob Description:\nThis position is responsible for screening, testing, evaluating, diagnosing and treatment of injuries, diseases, and disabilities using physical therapy procedures and modalities in accordance with standard physical therapy practices. The Physical Therapist consults, educates, and trains patients and their caregivers.\nScope\nDemonstrates the knowledge and skills necessary to provide appropriate physical therapy care to the following: Neonate, child, adolescent, adult, and geriatric populations.\n Job Essentials\nMaintains current knowledge of standard physical therapy practices for various patient populations.\nProvides competent services including treatment. Performs subjective and objective evaluation according to diagnosis, past history, and physician referral while developing a plan of care with appropriate goals and objectives based on patient evaluation. Effectively maintains established department/service line productivity standards.\nMaintains appropriate documentation for each patient in a complete, thorough, and timely manner in accordance with regulatory, facility, and department requirements. May assist in preparing patient billing in an accurate and timely manner.\nAppropriately communicates with patients, families, physicians, nurses, and other healthcare staff regarding patient's needs, abilities, and goals. Ensures smooth facility and department operations. Effectively utilizes rehabilitation services with optimum patient care and response.\nResponsible for all aspects of patient care and education for assigned patients including supervision of all services provided by physical therapy assistants, aides, office staff, and students; ensures consistent high-quality patient care.\nParticipates in continuing education opportunities in accordance with established guidelines. Seeks opportunities for new and continual learning. Promotes and provides for continuing education for staff.\nActively participates in the quality improvement process which may include maintaining and operating physical therapy equipment safely and in accordance with established indications, facility and manufacturer procedure for operations. Responsible for outcome input. Responsible to continually improve clinical outcomes and patient satisfaction. May assist in utilization review audits.\nMay assist manager with department operational oversight (e.g., schedules, mentoring, supplies, equipment, department budgets).\nActively participates in program development and marketing strategies to enhance the physical therapy programs referral base and development of department goals.\n\nMinimum Qualifications\nCurrent state Physical Therapist license.\nBasic Life Support (BLS) for healthcare providers.\n\nPreferred Qualifications\nClinical background experience in a healthcare setting.\nPossess skill sets and experience with target population of job setting.\nBasic Computer skills.\nExceptional interpersonal and communication skills.\nPhysical Requirements:\nPhysical Requirements\nCarrying, Hearing/Listening, Lifting, Manual Dexterity, Pulling/Pushing, Seeing, Speaking, Squatting/Kneeling, Standing, and Walking\nLocation:\nMcKay-Dee Surgical Center\nWork City:\nOgden\nWork State:\nUtah\nScheduled Weekly Hours:\n0\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience. \n$41.22 - $63.59\nWe care about your well-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged. \nLearn more about our comprehensive benefits package here.\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\nAt Intermountain Health, we use the artificial intelligence (\"AI\") platform, HiredScore to improve your job application experience. HiredScore helps match your skills and experiences to the best jobs for you. While HiredScore assists in reviewing applications, all final decisions are made by Intermountain personnel to ensure fairness. We protect your privacy and follow strict data protection rules. Your information is safe and used only for recruitment. Thank you for considering a career with us and experiencing our AI-enhanced recruitment process.\nAll positions subject to close without notice.",
        "job_location": "McKay-Dee Surgical Center"
    },
    {
        "company": "Intermountain Healthcare (IMH)",
        "company_url": "https://imh.wd5.myworkdayjobs.com/IntermountainCareers?q=nurse",
        "job_title": "Acute Care Physical Therapist PRN",
        "job_href": "https://imh.wd5.myworkdayjobs.com/en-US/IntermountainCareers/job/Intermountain-Health-Intermountain-Medical-Center/Physical-Therapist-PRN_R130036?q=nurse",
        "job_posting_text": "locations\nIntermountain Health Intermountain Medical Center\ntime type\nPart time\nposted on\nPosted Today\ntime left to apply\nEnd Date: May 16, 2025 (5 days left to apply)\njob requisition id\nR130036\nJob Description:\nThis position is responsible for screening, testing, evaluating, diagnosing and treatment of injuries, diseases, and disabilities using physical therapy procedures and modalities in accordance with standard physical therapy practices. The Physical Therapist consults, educates, and trains patients and their caregivers.\nScope\n\nDemonstrates the knowledge and skills necessary to provide appropriate physical therapy care to the following: Neonate, child, adolescent, adult, and geriatric populations.\n Job Essentials\nMaintains current knowledge of standard physical therapy practices for various patient populations.\nProvides competent services including treatment. Performs subjective and objective evaluation according to diagnosis, past history, and physician referral while developing a plan of care with appropriate goals and objectives based on patient evaluation. Effectively maintains established department/service line productivity standards.\nMaintains appropriate documentation for each patient in a complete, thorough, and timely manner in accordance with regulatory, facility, and department requirements. May assist in preparing patient billing in an accurate and timely manner.\nAppropriately communicates with patients, families, physicians, nurses, and other healthcare staff regarding patient's needs, abilities, and goals. Ensures smooth facility and department operations. Effectively utilizes rehabilitation services with optimum patient care and response.\nResponsible for all aspects of patient care and education for assigned patients including supervision of all services provided by physical therapy assistants, aides, office staff, and students; ensures consistent high-quality patient care.\nParticipates in continuing education opportunities in accordance with established guidelines. Seeks opportunities for new and continual learning. Promotes and provides for continuing education for staff.\nActively participates in the quality improvement process which may include maintaining and operating physical therapy equipment safely and in accordance with established indications, facility and manufacturer procedure for operations. Responsible for outcome input. Responsible to continually improve clinical outcomes and patient satisfaction. May assist in utilization review audits.\nMay assist manager with department operational oversight (e.g., schedules, mentoring, supplies, equipment, department budgets).\nActively participates in program development and marketing strategies to enhance the physical therapy programs referral base and development of department goals.\n\nMinimum Qualifications\nCurrent state Physical Therapist license.\nBasic Life Support (BLS) for healthcare providers.\n\nPreferred Qualifications\nClinical background experience in a healthcare setting.\nPossess skill sets and experience with target population of job setting.\nBasic Computer skills.\nExceptional interpersonal and communication skills.\nPhysical Requirements:\nCarrying, Hearing/Listening, Lifting, Manual Dexterity, Pulling/Pushing, Seeing, Speaking, Squatting/Kneeling, Standing, and Walking\nLocation:\nIntermountain Health Intermountain Medical Center\nWork City:\nMurray\nWork State:\nUtah\nScheduled Weekly Hours:\n0\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience. \n$41.22 - $63.59\nWe care about your well-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged. \nLearn more about our comprehensive benefits package here.\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\nAt Intermountain Health, we use the artificial intelligence (\"AI\") platform, HiredScore to improve your job application experience. HiredScore helps match your skills and experiences to the best jobs for you. While HiredScore assists in reviewing applications, all final decisions are made by Intermountain personnel to ensure fairness. We protect your privacy and follow strict data protection rules. Your information is safe and used only for recruitment. Thank you for considering a career with us and experiencing our AI-enhanced recruitment process.\nAll positions subject to close without notice.",
        "job_location": "Intermountain Health Intermountain Medical Center"
    },
    {
        "company": "Advocate Aurora Health (AAH)",
        "company_url": "https://aah.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Registered Nurse - Med-Surg/Detox 0.6 7a",
        "job_href": "https://aah.wd5.myworkdayjobs.com/en-US/External/job/Advocate-Christ-Hospital--Medical-Center---4440-W-95th-St/Registered-Nurse---Med-Surg-Detox--06-7a_R151838?q=nurse",
        "job_posting_text": "locations\nAdvocate Christ Hospital & Medical Center - 4440 W 95th St\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR151838\nDepartment:\n35875 Advocate Christ Medical Center - Telemetry: 5 South\nStatus: \nPart time\nBenefits Eligible:\nYes\nHours Per Week:\n24\nSchedule Details/Additional Information:\nEvery other weekend and set holiday\nPosition Requirements:Education Required:Completion of an accredited or approved program in Nursing.`This position is eligible for a $3000.00sign on bonus payable after hire.`Experience Required:Typically requires 1 year of experience in clinical nursing.Knowledge Skills and Abilities Required:Demonstrates progression to provide holistic patient care and the ability to view clinical situations from a patient and family focus.Demonstrates progression to recognize situational changes that require unplanned or unanticipated interventions and responds to situations with confidence timeliness and flexibility.Proficient computer skills use of electronic mail and electronic medical records systems.Excellent communication (written and verbal) listening and interpersonal skills.Demonstrates human relation skills with the ability to develop rapport and maintain positive professional relationships with a variety of patients team members and physicians. Ability to take initiative and work collaboratively with others.Demonstrated ability to effectively make critical independent decisions.Excellent organization prioritization and problem~solving skills.Demonstrates time management skills with an ability to multi~task and prioritize in an environment with frequent interruptions.Demonstrates coordination collaboration delegation and team building skills.Certification AddendumTeam members will maintain annual educational requirements for hospital based certifications (e.g. DNV CARF or others).Licensure Registration and/or Certification Required:Registered Nurse license issued by the state in which the team member practices andBasic Life Support (BLS) for Healthcare Providers certification issued by the American Heart Association (AHA).Physical Requirements and Working Conditions:Must be able to sit stand walk lift squat bend reach above shoulders and twist frequently throughout the workday.Must be able to:lift up to 50 lbs. from floor to waist.lift up to 20 lbs. over the head.carry\nPay Range\n$37.50 - $56.25\nOur Commitment to You:\nAdvocate Health offers a comprehensive suite of Total Rewards: benefits and well-being programs, competitive compensation, generous retirement offerings, programs that invest in your career development and so much more – so you can live fully at and away from work, including:\nCompensation\nBase compensation listed within the listed pay range based on factors such as qualifications, skills, relevant experience, and/or training\nPremium pay such as shift, on call, and more based on a teammate's job\nIncentive pay for select positions\nOpportunity for annual increases based on performance\nBenefits and more\nPaid Time Off programs\nHealth and welfare benefits such as medical, dental, vision, life, and Short- and Long-Term Disability\nFlexible Spending Accounts for eligible health care and dependent care expenses\nFamily benefits such as adoption assistance and paid parental leave\nDefined contribution retirement plans with employer match and other financial wellness programs\nEducational Assistance Program\nAbout Advocate Health \nAdvocate Health is the third-largest nonprofit, integrated health system in the United States, created from the combination of Advocate Aurora Health and Atrium Health. Providing care under the names Advocate Health Care in Illinois; Atrium Health in the Carolinas, Georgia and Alabama; and Aurora Health Care in Wisconsin, Advocate Health is a national leader in clinical innovation, health outcomes, consumer experience and value-based care. Headquartered in Charlotte, North Carolina, Advocate Health services nearly 6 million patients and is engaged in hundreds of clinical trials and research studies, with Wake Forest University School of Medicine serving as the academic core of the enterprise. It is nationally recognized for its expertise in cardiology, neurosciences, oncology, pediatrics and rehabilitation, as well as organ transplants, burn treatments and specialized musculoskeletal programs. Advocate Health employs 155,000 teammates across 69 hospitals and over 1,000 care locations, and offers one of the nation’s largest graduate medical education programs with over 2,000 residents and fellows across more than 200 programs. Committed to providing equitable care for all, Advocate Health provides more than $6 billion in annual community benefits.",
        "job_location": "Advocate Christ Hospital & Medical Center - 4440 W 95th St"
    },
    {
        "company": "Advocate Aurora Health (AAH)",
        "company_url": "https://aah.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Registered Nurse (RN) Tele/Detox .9 7p",
        "job_href": "https://aah.wd5.myworkdayjobs.com/en-US/External/job/Advocate-Christ-Hospital--Medical-Center---4440-W-95th-St/Registered-Nurse--RN--Tele-Detox-9-7p_R151837?q=nurse",
        "job_posting_text": "locations\nAdvocate Christ Hospital & Medical Center - 4440 W 95th St\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR151837\nDepartment:\n35875 Advocate Christ Medical Center - Telemetry: 5 South\nStatus: \nFull time\nBenefits Eligible:\nYes\nHours Per Week:\n36\nSchedule Details/Additional Information:\nRegistered nurse\nEvery other weekend and set holidays\nTHIS POSITION IS ELIGIBLE FOR A $10,000.00 Sign On Bonus\nMajor Responsibilities:\nUses the nursing process to assess the needs of the patient, plan and implement individualized interventions and evaluate the effectiveness of the plan of care. Includes the patient and family in planning and implementing care and develops and maintains a therapeutic relationship throughout the healthcare continuum.\nAnticipates and recognizes significant changes in the patient’s condition, status, and need for care. Provides ongoing assessment of the patient and takes appropriate actions when changes occur. Anticipates and alters the plan of care as needed, mobilizes appropriate resources, and collaborates with other health care team members to coordinate patient centered care.\nImplements strategies to reduce patient risk and increase patient safety. Assesses patient and family readiness to learn and individualizes the approach as necessary. Works collaboratively to develop strategies to meet the learning needs of the patient and family.\nActively coordinates the discharge plan utilizing an interdisciplinary approach. Applies evidence-based practice to deliver patient care. Consistently incorporates nursing and regulatory standards of care into practice.\nProvides ongoing evaluation of patient, team, and unit outcomes and is empowered to take appropriate action when changes are needed. Supports shared governance activities and initiatives to improve processes and patient outcomes.\nDemonstrates effective communication, feedback, and conflict resolution skills. Promotes collaboration among healthcare team members. Assumes a leadership role in the care team and delegates appropriately to unlicensed personnel.\nPromotes a culture of safety through identifying threats to patient safety and intervening to prevent patient harm. Reports patient safety events and near misses in a timely manner. Seeks to identify potential safety issues and assists in the implementation of corrective actions.\nApplies ethical decision making, demonstrates respect and understanding for peers, and other clinical disciplines. Participates as an effective member of the patient care team to formulate an integrated, unbiased, individualized approach to care.\nParticipates in quality/process improvement initiatives to improve the functions of the department and the patient care experience.\nParticipates in professional activities which contribute to personal professional development and the development of others. Seeks opportunities to be taught, coached, and mentored. Attends required meetings/educational programs and completes annual competencies in a timely manner.\nMust be able to demonstrate knowledge and skills necessary to provide care appropriate to the age of the patients served. Must demonstrate knowledge of the principles of growth and development over the life span and possess the ability to assess data reflective of the patient's status and interpret the appropriate information needed to identify each patient's requirements relative to his/her age-specific needs, and to provide the care needed as described in the department's policies and procedures. Age-specific information is developed further in the departmental job standards.\n\nLicensure, Registration, and/or Certification Required:\nRegistered Nurse license issued by the state in which the team member practices, and\nBasic Life Support (BLS) for Healthcare Providers certification issued by the American Heart Association (AHA).\n\nEducation Required:\nCompletion of an accredited or approved program in Nursing.\n\nExperience Required:\nTypically requires 1 year of experience in clinical nursing.\n\nKnowledge, Skills & Abilities Required:\nDemonstrates progression to provide holistic patient care and the ability to view clinical situations from a patient and family focus.\nDemonstrates progression to recognize situational changes that require unplanned or unanticipated interventions, and responds to situations with confidence, timeliness and flexibility.\nProficient computer skills, use of electronic mail and electronic medical records systems.\nExcellent communication (written and verbal), listening and interpersonal skills.\nDemonstrates human relation skills with the ability to develop rapport and maintain positive, professional relationships with a variety of patients, team members and physicians. Ability to take initiative and work collaboratively with others.\nDemonstrated ability to effectively make critical, independent decisions.\nExcellent organization, prioritization and problem-solving skills.\nDemonstrates time management skills with an ability to multi-task and prioritize in an environment with frequent interruptions.\nDemonstrates coordination, collaboration, delegation and team building skills.\nCertification Addendum:\nTeam members will maintain annual educational requirements for hospital based certifications (e.g. DNV, CARF or others)\n\nPhysical Requirements and Working Conditions:\nMust be able to sit, stand, walk, lift, squat, bend, reach above shoulders, and twist frequently throughout the workday.\nMust be able to:\nlift up to 50 lbs. from floor to waist.\nlift up to 20 lbs. over the head.\ncarry up to 40 lbs. a reasonable distance.\nMust be able to:\npush/pull with 30 lbs. of force.\nperform a sliding transfer of 150 lbs. with a second person present.\nPosition requires use of foot pedals on carts or machines.\nMay be exposed to chemical and hazardous waste as well as blood and body fluids and communicable disease. Therefore, protective clothing and equipment must be worn as necessary.\nMust have functional speech, vision, hearing, and touch with ability to use fine hand manipulation skills for IV insertion and other procedures/functions.\nOperates all equipment necessary to perform the job.\n\nThis job description indicates the general nature and level of work expected of the incumbent. It is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the incumbent. Incumbent may be required to perform other related duties.\nPay Range\n$37.50 - $56.25\nOur Commitment to You:\nAdvocate Health offers a comprehensive suite of Total Rewards: benefits and well-being programs, competitive compensation, generous retirement offerings, programs that invest in your career development and so much more – so you can live fully at and away from work, including:\nCompensation\nBase compensation listed within the listed pay range based on factors such as qualifications, skills, relevant experience, and/or training\nPremium pay such as shift, on call, and more based on a teammate's job\nIncentive pay for select positions\nOpportunity for annual increases based on performance\nBenefits and more\nPaid Time Off programs\nHealth and welfare benefits such as medical, dental, vision, life, and Short- and Long-Term Disability\nFlexible Spending Accounts for eligible health care and dependent care expenses\nFamily benefits such as adoption assistance and paid parental leave\nDefined contribution retirement plans with employer match and other financial wellness programs\nEducational Assistance Program\nAbout Advocate Health \nAdvocate Health is the third-largest nonprofit, integrated health system in the United States, created from the combination of Advocate Aurora Health and Atrium Health. Providing care under the names Advocate Health Care in Illinois; Atrium Health in the Carolinas, Georgia and Alabama; and Aurora Health Care in Wisconsin, Advocate Health is a national leader in clinical innovation, health outcomes, consumer experience and value-based care. Headquartered in Charlotte, North Carolina, Advocate Health services nearly 6 million patients and is engaged in hundreds of clinical trials and research studies, with Wake Forest University School of Medicine serving as the academic core of the enterprise. It is nationally recognized for its expertise in cardiology, neurosciences, oncology, pediatrics and rehabilitation, as well as organ transplants, burn treatments and specialized musculoskeletal programs. Advocate Health employs 155,000 teammates across 69 hospitals and over 1,000 care locations, and offers one of the nation’s largest graduate medical education programs with over 2,000 residents and fellows across more than 200 programs. Committed to providing equitable care for all, Advocate Health provides more than $6 billion in annual community benefits.",
        "job_location": "Advocate Christ Hospital & Medical Center - 4440 W 95th St"
    }
]