[
    {
        "company": "Nvidia",
        "company_url": "https://nvidia.wd5.myworkdayjobs.com/NVIDIAExternalCareerSite?workerSubType=ab40a98049581037a3ada55b087049b7&locationHierarchy1=2fcb99c455831013ea52fb338f2932d8",
        "job_title": "Verification Engineer - New College Grad 2025",
        "job_href": "https://nvidia.wd5.myworkdayjobs.com/en-US/NVIDIAExternalCareerSite/job/US-CA-Santa-Clara/Verification-Engineer---New-College-Grad-2025_JR1995559?workerSubType=ab40a98049581037a3ada55b087049b7&locationHierarchy1=2fcb99c455831013ea52fb338f2932d8",
        "job_posting_text": "locations\nUS, CA, Santa Clara\ntime type\nFull time\nposted on\nPosted Today\ntime left to apply\nEnd Date: June 11, 2025 (30+ days left to apply)\njob requisition id\nJR1995559\nWe are now looking for a Verification Engineer - New College Grad. As a Verification Engineer at NVIDIA, you will verify the design and implementation of our state of the art memory subsystem for our mobile SoCs and GPUs. This position offers the opportunity to have real impact in a dynamic, technology-focused company impacting product lines ranging from consumer graphics to self-driving cars and the growing field of artificial intelligence. We have crafted a team of extraordinary people stretching around the globe, whose mission is to push the frontiers of what is possible today and define the platform for the future of computing.\nWhat you'll be doing:\nIn this position, you will be responsible for verification of memory subsystem or coherent high speed interconnect design, architecture, golden models and micro-architecture using advanced verification methodologies.\nAs a member of our verification team, you'll understand the design & implementation, define the verification scope, develop the verification infrastructure (Testbenches, BFMs, Checkers, Monitors), execute test/coverage plans, and verify the correctness of the design.\nCollaborate with architects, designers, emulation and silicon verification teams to accomplish your tasks.\nWhat we need to see:\nCompleting or recently completed a Bachelors or Masters Degree (or equivalent experience)\nMinimum 6 months experience in architecting test bench environments for unit level verification.\nExposure to verification using random stimulus along with functional coverage and assertion-based verification methodologies.\nPrior Design or Verification experience of dynamic memory controllers or coherent high speed interconnects.\nC++ programming language experience, scripting ability and an expertise in System Verilog.\nExposure to design and verification tools (VCS or equivalent simulation tools, debug tools like Debussy, GDB).\nStrong debugging and analytical skills.\nStrong communication and interpersonal skills are required.\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. Are you creative and autonomous? Do you love the challenge of crafting the highest performance & lowest power silicon possible? If so, we want to hear from you! Come, join our Memory Controller team and help build the real-time, cost-effective computing platform driving our success across several exciting and quickly growing fields.\nThe base salary range is 96,000 USD - 212,750 USD. Your base salary will be determined based on your location, experience, and the pay of employees in similar positions.\nYou will also be eligible for equity and benefits. NVIDIA accepts applications on an ongoing basis. \nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.",
        "job_location": "US, CA, Santa Clara"
    },
    {
        "company": "Intel",
        "company_url": "https://intel.wd1.myworkdayjobs.com/en-US/External?timeType=dc193d6170de10860883d9bf7c0e01a9&locations=1e4a4eb3adf10174f0548376bf811bcf&locations=1e4a4eb3adf1016541777876bf8111cf&locations=1e4a4eb3adf1011246675c76bf81f8ce&locations=1e4a4eb3adf101d4e5a61779bf8159d1&locations=1e4a4eb3adf10118b1dfe877bf8162d0&locations=1e4a4eb3adf10129d05fe377bf815dd0&locations=1e4a4eb3adf1013ddb7bd877bf8153d0&locations=1e4a4eb3adf1018c4bf78f77bf8112d0&locations=1e4a4eb3adf101b8aec18a77bf810dd0&locations=1e4a4eb3adf101630310dd75bf81a9ce&locations=1e4a4eb3adf1019f4237e975bf81b3ce&workerSubType=dc8bf79476611087dfde9c6b065bae76",
        "job_title": "Senior Microarchitect - Memory Coherency Fabric Systems",
        "job_href": "https://intel.wd1.myworkdayjobs.com/en-US/External/job/US-California-Santa-Clara/Senior-Microarchitect---Memory-Coherency-Fabric-Systems_JR0269437-1?timeType=dc193d6170de10860883d9bf7c0e01a9&locations=1e4a4eb3adf10174f0548376bf811bcf&locations=1e4a4eb3adf1016541777876bf8111cf&locations=1e4a4eb3adf1011246675c76bf81f8ce&locations=1e4a4eb3adf101d4e5a61779bf8159d1&locations=1e4a4eb3adf10118b1dfe877bf8162d0&locations=1e4a4eb3adf10129d05fe377bf815dd0&locations=1e4a4eb3adf1013ddb7bd877bf8153d0&locations=1e4a4eb3adf1018c4bf78f77bf8112d0&locations=1e4a4eb3adf101b8aec18a77bf810dd0&locations=1e4a4eb3adf101630310dd75bf81a9ce&locations=1e4a4eb3adf1019f4237e975bf81b3ce&workerSubType=dc8bf79476611087dfde9c6b065bae76",
        "job_posting_text": "locations\nUS, California, Santa Clara\nUS, Massachusetts, Beaver Brook\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nJR0269437\nJob Details:\nJob Description: \nDo Something Wonderful!\nIntel put the Silicon in Silicon Valley. No one else is this obsessed with engineering a brighter future. Every day, we create world changing technology that enriches the lives of every person on earth. So, if you have a big idea, let's do something wonderful together. Join us, because at Intel, we are building a better tomorrow.\nWho We Are \nThe DCAI and Silicon Eng Team (DASE) deliver leadership Xeon products to cloud and datacenter customers through development of industry leading x86 core and differentiated IPs that enhances product performance and competitiveness in both Xeon and AI platforms. IP design group within DCAI designs Coherent Fabric IP, Memory controller, NOC, PCIE and many fundamental building blocks for the Xeon server SOCs.\n Who You Are\nWe are seeking an experienced Senior Micro Architect to design, develop, and implement advanced memory coherency fabric systems for next-generation data center and AI chips. This role requires a unique blend of architectural expertise and hands-on RTL coding skills to bring cutting-edge designs to life. The ideal candidate will have a deep understanding of memory subsystem architecture, interconnect protocols, and coherency mechanisms, coupled with a proven ability to implement these designs at the RTL level.\n\nYour responsibilities include but not limited to:\nArchitect scalable memory coherency protocols and interconnect topologies to achieve high performance and low latency for data center and AI SoCs.\nDesign and implement critical components of the memory fabric microarchitecture, including coherency controllers and interconnect blocks.\nDevelop RTL code for core components of the memory fabric, ensuring optimal performance, area, and power trade-offs.\nWork closely with verification teams to create test plans and debug issues arising during pre-silicon validation.\nCollaborate with cross-functional teams (physical design, software, and firmware) to ensure seamless integration of memory fabric systems.\nAnalyze system performance, conduct workload modeling, and optimize the architecture for target use cases.\nMentor junior engineers and contribute to technical reviews and design documentation.\nStay updated with emerging technologies and trends in memory subsystems, coherency protocols, and AI/ML hardware.\nStrong problem-solving and debugging skills.\nExcellent communication and collaboration abilities.\nAbility to manage and prioritize multiple tasks effectively.\nQualifications:\nMinimum Qualifications\nGraduate of Bachelor’s Degree in Electrical Engineering, Computer Engineering, or a related field with at least 4+ years’ experience in SoC design, including significant experience in memory systems, coherency protocols, and RTL coding OR;\nGraduate of Master’s Degree in Electrical Engineering, Computer Engineering, or a related field with at least 3+ years’ experience in SoC design, including significant experience in memory systems, coherency protocols, and RTL coding OR;\nPhD in Electrical Engineering, Computer Engineering, or a related field.\nExpertise in memory coherency protocols (e.g., MESI, MOESI, CXL, CCIX, CHI).\nStrong knowledge of interconnect technologies (e.g., AMBA, PCIe, NoC architectures).\nProven RTL coding experience in Verilog or SystemVerilog.\nProficiency in simulation tools for performance modeling and analysis.\nFamiliarity with physical design implications of memory fabric architectures (timing, power, area).\nExperience with EDA tools for synthesis, linting, and static timing analysis.\n\nPreferred Experience\nExperience with high-bandwidth memory (HBM), DDR, or other advanced memory technologies.\nKnowledge in AI/ML accelerator or data center SoC design.\nKnowledge of scripting languages like Python or TCL for workflow automation.\nExperience with software-hardware co-design for end-to-end system optimization.\n          Job Type:\nExperienced Hire\nShift:\nShift 1 (United States of America)\nPrimary Location: \nUS, California, Santa Clara\nAdditional Locations:\nUS, Massachusetts, Beaver Brook\nBusiness group:\nThe Data Center & Artificial Intelligence Group (DCAI) is at the heart of Intel’s transformation from a PC company to a company that runs the cloud and billions of smart, connected computing devices. The data center is the underpinning for every data-driven service, from artificial intelligence to 5G to high-performance computing, and DCG delivers the products and technologies—spanning software, processors, storage, I/O, and networking solutions—that fuel cloud, communications, enterprise, and government data centers around the world.\nPosting Statement:\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.\nPosition of Trust\nN/A\nBenefits:\nWe offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, as well as, benefit programs which include health, retirement, and vacation.  Find more information about all of our Amazing Benefits here:\nhttps://intel.wd1.myworkdayjobs.com/External/page/1025c144664a100150b4b1665c750003\nAnnual Salary Range for jobs which could be performed in the US:\n$161,230.00-$227,620.00\nSalary range dependent on a number of factors including location and experience.\nWork Model for this Role\nThis role will be eligible for our hybrid work model which allows employees to split their time between working on-site at their assigned Intel site and off-site. * Job posting details (such as work model, location or time type) are subject to change.",
        "job_location": "2 Locations"
    },
    {
        "company": "Microchip",
        "company_url": "https://wd5.myworkdaysite.com/recruiting/microchiphr/External?zz_LRV_Job_Category_Requisition_Extended=57f4a35d19da0140025b77636501bd99&zz_LRV_Job_Category_Requisition_Extended=57f4a35d19da0166f84174636501b499&zz_LRV_Job_Category_Requisition_Extended=57f4a35d19da01e9981873636501b199&locationCountry=a30a87ed25634629aa6c3958aa2b91ea&locationCountry=bc33aa3152ec42d4995f4791a106ed09&timeType=51c161e7620310f46a28a73d306c1426",
        "job_title": "Sr. Technical Staff Engineer - AI Systems",
        "job_href": "https://wd5.myworkdaysite.com/en-US/recruiting/microchiphr/External/job/CA---Roseville/Sr-Technical-Staff-Engineer---AI-Systems_R426-25?zz_LRV_Job_Category_Requisition_Extended=57f4a35d19da0140025b77636501bd99&zz_LRV_Job_Category_Requisition_Extended=57f4a35d19da0166f84174636501b499&zz_LRV_Job_Category_Requisition_Extended=57f4a35d19da01e9981873636501b199&locationCountry=a30a87ed25634629aa6c3958aa2b91ea&locationCountry=bc33aa3152ec42d4995f4791a106ed09&timeType=51c161e7620310f46a28a73d306c1426",
        "job_posting_text": "locations\nCA - Roseville\nCA - San Jose - 3870 N. First St\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR426-25\nAre you looking for a unique opportunity to be a part of something great? Want to join a 20,000-member team that works on the technology that powers the world around us? Looking for an atmosphere of trust, empowerment, respect, diversity, and communication? How about an opportunity to own a piece of a multi-billion dollar (with a B!) global organization? We offer all that and more at Microchip Technology, Inc.\nPeople come to work at Microchip because we help design the technology that runs the world. They stay because our culture supports their growth and stability. They are challenged and driven by an incredible array of products and solutions with unlimited career potential. Microchip’s nationally-recognized Leadership Passage Programs support career growth where we proudly enroll over a thousand people annually. We take pride in our commitment to employee development, values-based decision making, and strong sense of community, driven by our Vision, Mission, and 11 Guiding Values; we affectionately refer to it as the Aggregate System and it’s won us countless awards for diversity and workplace excellence.\nOur company is built by dedicated team players who love to challenge the status quo; we did not achieve record revenue and over 30 years of quarterly profitability without a great team dedicated to empowering innovation. People like you.\nVisit our careers page to see what exciting opportunities and company perks await!\nJob Description:\nOverview:\nWe are seeking a highly skilled and experienced AI Systems Engineer to join our dynamic team. This candidate will play a pivotal role in driving efficiency across all aspects of operations within our support team and tools. As a Senior Technical Staff AI System Engineer, you will architect, develop, and optimize advanced AI systems across a variety of domains. You will lead initiatives to design, implement, and deploy scalable AI solutions, collaborating with cross-functional teams to drive innovation and operational excellence. The ideal candidate will possess a deep understanding of AI systems, exceptional problem-solving abilities, and a proven track record of implementing AI-driven solutions to enhance operational performance.\nKey Responsibilities:\nDevelop and implement AI strategies to optimize operational efficiency across engineering teams\nLead end-to-end machine learning system design, including model development, evaluation, and deployment.\nLead the integration of AI solutions into existing customer support tools, enterprise software and infrastructure, ensuring seamless deployment and scalability\nCollaborate with cross-functional teams to identify opportunities for AI integration and automation.\nDesign, build, and deploy AI models and algorithms to solve complex business problems.\nMonitor and evaluate the performance of AI systems, making necessary adjustments to improve accuracy and effectiveness.\nProvide technical leadership and mentorship to team members on AI-related projects.\nStay up to date with the latest advancements in AI technology and industry trends.\nProvide technical training on AI ML related technologies\nEnsure compliance with data privacy and security regulations in all AI initiatives.\nRequirements/Qualifications:\nRequired Skills and Experience:\nAdvanced degree (Master’s or Ph.D.) in Computer Science, Computer Engineering, Artificial Intelligence, Machine Learning, or a related field.\nMinimum of 10 years of hands-on experience in AI systems development and implementation.\nProficiency in programming languages such as Python, Java, C, and C++.\nDeep understanding of machine learning algorithms, neural networks, and statistical modeling\nStrong knowledge of machine learning frameworks (e.g., TensorFlow, PyTorch, Keras).\nExperience with classical machine learning techniques (e.g., XGBoost, scikit-learn) and time series analysis (e.g., Prophet, LSTMs).\nExperience with large language models (LLMs), agentic frameworks, and prompt engineering\nFamiliarity with containerization and version control tools like Docker and GitHub.\nStrong understanding of product lifecycle management and production code release processes.\nStrong analytical, problem-solving, and communication skills\nDesired Skills and Experience:\nFamiliarity with RTL, Verilog and ASIC development life cycle\nExperience working in a fast-paced, high-tech environment\nOptimize open-source AI frameworks and libraries for high-performance computing on specialized hardware\nDesign, implement, and validate new AI algorithms and models for enterprise-scale applications\nUnderstanding of DevOps practices and tools for AI model deployment and monitoring.\nExperience in benchmarking AI ML designs\nExpertise in identifying and collecting appropriate metrics to measure the effectiveness of the AI ML tools\nExpertise in computer vision techniques using OpenCV, TensorFlow, PyTorch, and PyTorch Lightning.\nProficiency in cloud infrastructure, specifically Azure AI Foundry, Cosmos DB, VNet, Entra ID auth, Blob storage, App Service, AI Search, Azure Monitor & Alerts.\nTravel Time:\n0% - 25%\nPhysical Attributes:\nFeeling, Handling, Hearing, Seeing, Talking, Works Alone, Works Around Others\nPhysical Requirements:\nRegular business hours (8:00 AM to 5:00 PM); 70% sitting, 15% standing, 15% walking\nPay Range:\nWe offer a total compensation package that ranks among the best in the industry. It consists of competitive base pay, restricted stock units, and quarterly bonus payments. In addition to these components, our package includes health benefits that begin day one, retirement savings plans, and an industry leading ESPP program with a 2 year look back feature. Find more information about all our benefits at the link below:\nBenefits of working at Microchip\nThe annual base salary range for this position, which could be performed in California, is $88,000 - $232,000.*\n*Range is dependent on numerous factors including job location, skills and experience.\nMicrochip Technology Inc is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.\n\nFor more information on applicable equal employment regulations, please refer to the EEO is the Law Poster and the EEO is the Law Poster Supplement. Please also refer to the Pay Transparency Policy Statement.\nTo all recruitment agencies: Microchip Technology Inc. does not accept unsolicited agency resumes. Please do not forward resumes to our recruiting team or other Microchip employees. Microchip is not responsible for any fees related to unsolicited resumes.",
        "job_location": "2 Locations"
    },
    {
        "company": "Analog",
        "company_url": "https://analogdevices.wd1.myworkdayjobs.com/External?locationCountry=bc33aa3152ec42d4995f4791a106ed09&locationCountry=a30a87ed25634629aa6c3958aa2b91ea&timeType=1a15e0fbb61110090028388769cb0000&jobFamilyGroup=633b03df4f5d1000ec24734fbbbb0000&jobFamilyGroup=633b03df4f5d1000ec247e24e03b0000&jobFamilyGroup=633b03df4f5d1000ec243f6e4cb40001&workerSubType=633b03df4f5d1000ec10abdfb8db0000",
        "job_title": "MEMS Systems Design Engineer",
        "job_href": "https://analogdevices.wd1.myworkdayjobs.com/en-US/External/job/US-MA-Wilmington/MEMS-Systems-Design-Engineer_R251692-1?locationCountry=bc33aa3152ec42d4995f4791a106ed09&locationCountry=a30a87ed25634629aa6c3958aa2b91ea&timeType=1a15e0fbb61110090028388769cb0000&jobFamilyGroup=633b03df4f5d1000ec24734fbbbb0000&jobFamilyGroup=633b03df4f5d1000ec247e24e03b0000&jobFamilyGroup=633b03df4f5d1000ec243f6e4cb40001&workerSubType=633b03df4f5d1000ec10abdfb8db0000",
        "job_posting_text": "locations\nUS, MA, Wilmington\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR251692\nAbout Analog Devices\nAnalog Devices, Inc. (NASDAQ: ADI ) is a global semiconductor leader that bridges the physical and digital worlds to enable breakthroughs at the Intelligent Edge. ADI combines analog, digital, and software technologies into solutions that help drive advancements in digitized factories, mobility, and digital healthcare, combat climate change, and reliably connect humans and the world. With revenue of more than $9 billion in FY24 and approximately 24,000 people globally, ADI ensures today's innovators stay Ahead of What's Possible™. Learn more at www.analog.com and on LinkedIn and Twitter (X).\n          Job Description:\n Analog Devices, Inc. currently has a position open for a MEMS System Design Engineer within the Inertial MEMS Technology Group. The primary responsibility of this position is to lead the development of systems and subsystem products in the MEMS technology group. This position will lead new product development teams to develop, qualify and release MEMS system level products including inertial measurement units (IMUs) and inertial sensing modules such as vibration sensing modules or navigation modules. The engineer will need to draw upon a broad knowledge across different technologies and lead the cross-functional teams to deliver the system products to navigation, condition based monitoring and broad inertial sensing markets.  \nEssential Duties & Responsibilities:\n·        Technical leadership responsible for development and characterization of cutting-edge system level products from concept to high volume production.\n·        Write, debug and maintain embedded software/firmware code for inertial MEMS products.\n·        Ensure conformance of embedded code with stakeholder requirement through rigorous verification\n·        Design and execute laboratory experiments to debug and characterize new products for both hardware and software verification\n·        Creating and maintaining project plans and schedules to bring new products to market in a timely fashion and within budget.\n·        Manage product requirements, including stakeholder requirements, system, hardware and software requirements, as well as requirement traceability and validation/verification.\n·        Use of common task management tools (JIRA) and common requirements management tools (JAMA) for project management. Translate system level requirements into verification strategies.\n·        Communicate and collaborate with design, application, marketing, test development and manufacturing teams to develop the products.\n·        Work with process, packaging, yield and quality groups to improve or resolve process/ product interactions, yield and quality issues.\n·        Interact with marketing, application and customers to identify and define new products as well as resolve product/application issues.\n·        Reviewing product details; guiding performance specifications in datasheets.\n·        Innovative thinking and strong initiative to push the state of the art is necessary. \nMinimum Qualifications: \n·        MS or PhD degree  in Electrical, Mechanical or Controls Engineering\n·        Experience in developing C/C++ on embedded platforms      \n·        Strong understanding of Analog and Digital Circuits\n·        Good understanding of communication protocols such as SPI, UART, Ethernet, I2C and RS-422\n·        Experience in design and bring-up of product prototypes in both Hardware and Software\n·        Excellent troubleshooting skills including leading team for problem-solving and hands-on experience conducting experiments with lab equipment. \nPreferred Qualifications: \n·        Experience with ARM/DSP/FPGA platforms is a plus\n·        Experience with software development using LabVIEW, MATLAB or Python is a plus\n·        Experience with PCB design tools such as Cadence Allegro is a plus\n·        Experience with MEMS process, package and manufacturing technology is a plus\n·        Experience with developing application devices/boards is a plus\n·        Excellent communication skills and experience working in multidisciplinary team environments\n·       High energy and motivation required to lead product development and support a fast-growing business\n#LI-PG1\nFor positions requiring access to technical data, Analog Devices, Inc. may have to obtain export  licensing approval from the U.S. Department of Commerce - Bureau of Industry and Security and/or the U.S. Department of State - Directorate of Defense Trade Controls.  As such, applicants for this position – except US Citizens, US Permanent Residents, and protected individuals as defined by 8 U.S.C. 1324b(a)(3) – may have to go through an export licensing review process.\nAnalog Devices is an equal opportunity employer. We foster a culture where everyone has an opportunity to succeed regardless of their race, color, religion, age, ancestry, national origin, social or ethnic origin, sex, sexual orientation, gender, gender identity, gender expression, marital status, pregnancy, parental status, disability, medical condition, genetic information, military or veteran status, union membership, and political affiliation, or any other legally protected group.\nEEO is the Law: Notice of Applicant Rights Under the Law.\nJob Req Type: Experienced\n          Required Travel: Yes, 10% of the time\n          Shift Type: 1st Shift/Days\n          ",
        "job_location": "US, MA, Wilmington"
    },
    {
        "company": "Analog",
        "company_url": "https://analogdevices.wd1.myworkdayjobs.com/External?locationCountry=bc33aa3152ec42d4995f4791a106ed09&locationCountry=a30a87ed25634629aa6c3958aa2b91ea&timeType=1a15e0fbb61110090028388769cb0000&jobFamilyGroup=633b03df4f5d1000ec24734fbbbb0000&jobFamilyGroup=633b03df4f5d1000ec247e24e03b0000&jobFamilyGroup=633b03df4f5d1000ec243f6e4cb40001&workerSubType=633b03df4f5d1000ec10abdfb8db0000",
        "job_title": "BMS Algorithm Development Engineer",
        "job_href": "https://analogdevices.wd1.myworkdayjobs.com/en-US/External/job/US-MA-Wilmington/BMS-Algorithm-Development-Engineer_R251646-1?locationCountry=bc33aa3152ec42d4995f4791a106ed09&locationCountry=a30a87ed25634629aa6c3958aa2b91ea&timeType=1a15e0fbb61110090028388769cb0000&jobFamilyGroup=633b03df4f5d1000ec24734fbbbb0000&jobFamilyGroup=633b03df4f5d1000ec247e24e03b0000&jobFamilyGroup=633b03df4f5d1000ec243f6e4cb40001&workerSubType=633b03df4f5d1000ec10abdfb8db0000",
        "job_posting_text": "locations\nUS, MA, Wilmington\nUS, MA, Boston\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR251646\nAbout Analog Devices\nAnalog Devices, Inc. (NASDAQ: ADI ) is a global semiconductor leader that bridges the physical and digital worlds to enable breakthroughs at the Intelligent Edge. ADI combines analog, digital, and software technologies into solutions that help drive advancements in digitized factories, mobility, and digital healthcare, combat climate change, and reliably connect humans and the world. With revenue of more than $9 billion in FY24 and approximately 24,000 people globally, ADI ensures today's innovators stay Ahead of What's Possible™. Learn more at www.analog.com and on LinkedIn and Twitter (X).\n          BMS Algorithm Development Engineer\nAnalog Devices (NASDAQ: ADI) designs and manufactures semiconductor products and system-level solutions that combine HW and SW. We enable our customers to interpret the world around us by intelligently bridging the physical and digital worlds with unmatched technologies that sense, measure, and connect.\nThe Automotive Business Unit's Advanced Technology Team (AAT) is developing technologies to enable rapid scaling to electric vehicles and faster electrification of the energy sector. The Algorithms & Data Science Group within AAT creates and productizes advanced algorithms in the fields of intelligent control, data science, machine learning, artificial intelligence, signal processing, and other areas of electrical engineering and computer science that are of strategic interest to the Automotive Business Unit’s goals and roadmaps. \nWe are looking for Algorithm Development Engineers to join our growing Algorithms & Data Science Group. You will work on a new class of BMS algorithms and architectures to improve the utility of batteries and solve challenging problems that arise in Automotive BU’s diverse portfolio of Battery Management System (BMS) applications in automotive, energy, and other areas.\nResponsibilities\nCreate advanced BMS algorithms by combining novel sensor technology, electro-chemistry, mathematics, data, and AI, specialized for applications relevant to the Automotive Business Unit's strategy in BMS.\nDevelop software simulations and analyze performance of algorithms.\nWork with other researchers and engineers, inside and outside the AAT, to connect our work with the goals of the Automotive business units.\nLead or contribute to prototyping efforts.\nWork with domain experts to define, understand, and clarify problem statements.\nDerive core mathematical expression for problems of interest.\nBuild proof of concepts, and test environments to validate algorithms.\nWork with multidisciplinary product development engineering teams at ADI to implement algorithms.\nWork with our customers, their customers, and Research institutions to understand issues and where we can create value.\nBe a lead contributor to the technical execution of projects.\nClearly and effectively communicate the results of analysis and action plans both verbally and in writing.\nStay abreast of state-of-the-art algorithms, and research advances beyond the state of the art in areas relevant to ADI’s Automotive business.\nRequired Skillset:\nMaster’s degree or equivalent job-related experience, and 8+ years of Industrial Experience in developing algorithms and software.\nExperience in Battery Management System Algorithm/Firmware/Software development or validation.\nShould have a strong background in at least two of the following areas: Algorithm Development, Machine Learning/AI, Data Analysis, Signal Processing and Filtering Methods, Control Algorithms Design, Mathematical Modeling and Simulation.\nProficient in using MATLAB/Simulink, Python (Pandas, NumPy, SciPy, Scikit-learn, PyTorch, TensorFlow, etc.), and software version control tools (Git, Bitbucker, etc.).\nCritical thinking skills.\nAbility to collaborate effectively with teammates and cross-functional teams.\nAbility to independently learn new technologies, prototype and design software.\nDesirable Experience\nExcellent communication, organizational and leadership skills\nWorking on multidisciplinary teams.\nExperience with AUTOSAR and ASPICE.\nPhD degree in a relevant area.\nWorking with big data.\nExperience modeling electro-chemical systems.\nLocation:\nWilmington/Boston, USA\n#LI-PG1\nFor positions requiring access to technical data, Analog Devices, Inc. may have to obtain export  licensing approval from the U.S. Department of Commerce - Bureau of Industry and Security and/or the U.S. Department of State - Directorate of Defense Trade Controls.  As such, applicants for this position – except US Citizens, US Permanent Residents, and protected individuals as defined by 8 U.S.C. 1324b(a)(3) – may have to go through an export licensing review process.\nAnalog Devices is an equal opportunity employer. We foster a culture where everyone has an opportunity to succeed regardless of their race, color, religion, age, ancestry, national origin, social or ethnic origin, sex, sexual orientation, gender, gender identity, gender expression, marital status, pregnancy, parental status, disability, medical condition, genetic information, military or veteran status, union membership, and political affiliation, or any other legally protected group.\nEEO is the Law: Notice of Applicant Rights Under the Law.\nJob Req Type: Experienced\n          Required Travel: No\n          Shift Type: 1st Shift/Days\n          ",
        "job_location": "2 Locations"
    }
]