[
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "RN - Med/Surg Ortho Trauma - FT Nights - Jefferson Einstein Philadelphia",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Philadelphia-PA/RN---Med-Surg-Ortho-Trauma---FT-Nights---Jefferson-Einstein-Philadelphia_REQ-0010478-1?q=nurse",
        "job_posting_text": "locations\nPhiladelphia, PA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0010478\nJob Details\nRN - Med/Surg Ortho Trauma - FT Nights - Jefferson Einstein Philadelphia\nJob Description\nRN - Med/Surg Ortho Trauma - FT Nights - Jefferson Einstein Philadelphia\nJoin the mission of Improving Lives as a Staff Nurse at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done. \nStaff Nurses are responsible for the following: \nPerforms patient procedures within the nursing scope of practice. \nPractices safe medication administration and assesses patient responses to medication. \nParticipates in reviewing and/or implementing clinical pathways and care coordination. \nThe Staff Nurse will provide professional nursing care to a group of patients within a specified time period and complete all required documentation. \nQualifications for this position include: \nBSN Degree preferred \nState Issued RN license \nBasic Life Support (BLS) certification from the American Heart Association  \n\n Work Shift\nWorkday Night (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n5501 Old York Road, Philadelphia, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. ",
        "job_location": "Philadelphia, PA"
    }
]