[
    {
        "company": "Stanford Health Care",
        "company_url": "https://stanfordhealthcare.wd5.myworkdayjobs.com/SHC_Tri-Valley_External_Careers?q=nurse",
        "job_title": "Registered Nurse (RN) Nurse Residency Program Full Time",
        "job_href": "https://stanfordhealthcare.wd5.myworkdayjobs.com/en-US/SHC_Tri-Valley_External_Careers/job/5555-W-Las-Positas-Blvd---PLEASANTON/Registered-Nurse--RN--Nurse-Residency-Program-Full-Time_R2548628?q=nurse",
        "job_posting_text": "locations\n5555 W. Las Positas Blvd. - PLEASANTON\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR2548628\nIf you're ready to be part of our legacy of hope and innovation, we encourage you to take the first step and explore our current job openings. Your best is waiting to be discovered. \n Rotating - 12 Hour (United States of America)\nThis is a Stanford Health Care Tri-Valley position.\nYour nursing career deserves to start with the best foundation! To foster your growing talents, we invite you to consider the Stanford Health Care New Graduate Nurse Residency Program. Thoughtfully designed for highly motivated and committed new graduate nurses, this is a comprehensive one-year training program—providing over 300+ bedside care hours with an experienced nurse preceptor, supported with an additional 100 hours of clinical education, immersive training and unique “New Grad Seminar” workshops. Our rigorous curriculum, emphasizes the professional nurse role, leadership and patient outcomes and is guided by Watson Caring Science Theory.\nProgram requirements:\nMust be a graduate from an accredited ADN, BSN or MSN program.\nThe official graduation transcript date no greater than 6 months from cohort hire/start date.\nMust have an active CA RN license that can be verified online via the California Board of Registered Nursing by program start date.\nMust have a current AHA ACLS and BLS card by program start date\nNo greater than 6 months experience as a registered nurse\nAccredited online programs included.\nParticipating Units:\nSurgical Telemetry, Medical Telemetry, Med Surg Tele Stroke, Surgery-OR\n*Potential Units: Emergency Department, Med Surg-2 North\nRN Residency Applicant Timeline:\nJune 1st- 4th at 5pm: Applications accepted (requirements below)\nMandatory Supplemental Questionnaire due June 4th.\nJune 23, 2025: Candidates will be emailed re: interviews if selected\nJuly 8th – 10th, 2025: Interviews\nAugust 20th, 2025: Residency Begins\nMust submit the following documents with your Workday application:\nCover Letter Resume:\nClinical Rotations/Preceptorship (required):\nIf clinical rotation/preceptorship is in progress at time of application submission, please note “in progress.”\nJust include the number of clinical hours for each rotation/preceptorship\nMust include the location/site for clinical rotations/preceptorship\nWork Experience (if applicable):\nProvide job title, responsibilities, and timeframe for employment\nVolunteer Experience (if applicable):\nMust include name and contact information of individual/agency who supervised your volunteer activities.\nMust provide volunteer title, responsibilities and hours volunteered\n2 letters of recommendation \nTranscripts: Most recent transcripts (either Official or Unofficial Online Transcripts)\nSupplemental Questionnaire due with application.\nLink: Nurse Residency Supplemental Questionnaire\n*PLEASE UPLOAD TO YOUR DOCUMENTS UNDER ADDITIONAL DOCUMENTS - DO NOT SEND ANY TO THE HOSPITAL OR HAVE THEM E-MAILED TO US. They MUST be uploaded to your application. If you withdraw your application, you will need to create a new account and reapply. *\nThank you and good luck to you all!\nStanford Health Care Tri-Valley RN Recruitment & New Grad RN Residency Teams\nContact: TVNewGradRN@stanfordhealthcare.org\nJob Summary\nThe Registered Nurse (RN) provides direct patient care, practicing in an evidence-based manner, within the Scope of Practice of the California Nursing Practice Act, regulatory requirements, standards of care, and hospital policies.  The RN performs all the steps of the nursing process including assessing patients, interpreting data, planning, implementing and evaluating care.  In addition, the RN coordinates care with other providers and acts as a teacher to the patient and family to provide the knowledge and skills needed to manage their care and prevent complications.  \nEssential Functions\nThe essential functions listed below are general examples and not a description of comprehensive duties.  Specific duties and responsibilities may vary depending on department or program needs without changing nature or scope of this position or level of responsibility.  May be asked to perform other duties as assigned.  \nAssesses patients by collecting and documenting data about patients through interviewing, history taking, personal needs and physical assessment findings. \nObtains accurate and relevant assessment screening data and interprets the data as normal v. abnormal.\nDetermines nursing diagnosis.  Monitors and evaluates data as frequently as needed based on stability. \nSafely performs and documents care plan using the nursing procedures required for the patient assignment consistent with the standards of care.\nEvaluates effectiveness of interventions and monitors patient for adverse responses and side effects. \nAssesses patient/family level of understanding and documents information on clinical records.\nCreates and maintains a climate conducive to healing through being present to patient & family, identifying and managing discomforts and providing emotional support and education. \nTeaches needed information for self-care and illness prevention to patient and family members. \nRecognizes and communicates to proper authority ethical and legal issues relative to patient care; completes incident report. \nSafety performs all provision of care for any age-related needs of the patients served on the unit, including growth and development principles\nAttends meetings and serves on departmental and/or hospital committees as assigned.\nWorks to support the achievement of department strategic and organizational goals. \nEmployee must perform all duties and responsibilities in accordance with the C-I-CARE Standards of the Hospital. C-I-CARE is the foundation of Stanford Healthcare – ValleyCare’s patient-experience and represents a framework for patient-centered interactions\nJob Qualifications\nEducation   \nGraduate of an accredited School of Nursing\nExperience \nNo prior Registered Nurse experience required\nLicenses and Certifications\nCurrent CA R.N. License\nCurrent American Heart Association BLS Certification\nRelevant departmental certification as required (i.e.: PALS, NRP, ACLS)\nKnowledge, Skills, and Abilities\nStrong communication skills - Ability to read, write and understand the English language.\nStrong attention to detail\nAbility to problem solve and adapt to a changing environment\nAbility to use information and keep abreast of developments in technology to communicate, manage knowledge, mitigate error, and support decision-making in patient care\nAbility to work as a valued team member, but also autonomously\nAbility positively influence others to meet patient needs and achieve shared goals\nAbility to effectively prioritize to provide quality and valued patient care\nKnowledge of principles, practices and current trends in health care and hospital system organization and administration sufficient to provide clinical management, leadership, coordination, and operational direction for assigned areas of responsibility\nPhysical Demand and Working Conditions\nThe Physical Requirements and Working Conditions in which the job is typically performed are available from the Occupational Health Department. Reasonable accommodations will be made to enable individuals with disabilities to perform the essential functions of the job.\n Equal Opportunity Employer\nEqual Opportunity Employer Stanford Health Care Tri-Valley (SHCTV) strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements.\nEqual Opportunity Employer Stanford Health Care (SHC) strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements.\nBase Pay Scale: Generally starting at $73.23 - $90.39 per hour\nThe salary of the finalist selected for this role will be set based on a variety of factors, including but not limited to, internal equity, experience, education, specialty and training. This pay scale is not a promise of a particular wage.",
        "job_location": "5555 W. Las Positas Blvd. - PLEASANTON"
    },
    {
        "company": "University of Kansas Medical Center (KUMC)",
        "company_url": "https://kumc.wd5.myworkdayjobs.com/kumc-jobs?q=nurse",
        "job_title": "Advanced Practice Provider Fellow",
        "job_href": "https://kumc.wd5.myworkdayjobs.com/en-US/kumc-jobs/job/Kansas-City-Metro-Area/Advanced-Practice-Provider-Fellow_JR008526?q=nurse",
        "job_posting_text": "locations\nKansas City Metro Area\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nJR008526\nDepartment:\nSOM KC The Alzheimer's Disease Center (ADC)\n-----\nResearch Support\nPosition Title:\nAdvanced Practice Provider Fellow\nJob Family Group: \nProfessional Staff\nJob Description Summary:\nThe University of Kansas Alzheimer’s Disease Research Center (KU ADRC) is a National Institute of Aging P30-designated national leader in AD research with the vision to impact the lives of every patient and family dealing with Alzheimer’s in the region and across the state of Kansas through our research, education, and clinical care.  We are a comprehensive center at the forefront of clinical trials, lifestyle intervention trials, drug and translational research, and basic science research.  Our research enables us to also provide leading edge clinical care and support for dementia caregivers. In addition, we provide a wide variety of both public education and training opportunities for the workforce of tomorrow. \n\nThe KU ADRC is urgently growing our training programs to develop the next generation of clinicians to care for the growing burden of ADRD in an aging population. Advanced Practice Providers (APPs) play a critical role on the front lines in diagnosing and treating these neurodegenerative diseases. The goal of the APP Fellowship Program is to train APRNs in the diagnosis and treatment of dementia to meet the growing needs of this vulnerable population both at the University of Kansas Medical Center (KUMC) and the greater Midwest region. \n\nThe program will provide APRNs with 6 months of intensive training in the clinical skills needed to optimally diagnose and treat individuals with Alzheimer’s disease and related disorders (ADRD). Fellows will provide care in the Memory Care Clinic along with physicians and APP mentors. In addition, fellows will participate in a variety of observational and learning opportunities including current ADRD treatments, neuropsychology, neuroimaging, biomarkers, social work support, end of life care planning, and research.\n\nMust maintain medical staff privileges at the University of Kansas Medical Center, Medical Staff Office\nJob Description:\nGather a comprehensive patient history \nComplete a comprehensive physical and neurological examination \nOrder and analyze appropriate diagnostic studies \nFormulate and implement treatment plans \nEvaluate patients’ response to treatment \nCoordinate patient care \nActively participate within the interdisciplinary healthcare team \nParticipate in the implementation of patient education and clinical support programs to ensure optimal care throughout the healthcare continuum\nPrepare concise verbal case presentations to discuss with mentors \nCome prepared and actively participate in didactic sessions\nActively engage in specialty clinic rotations\nThis job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. It is only a summary of the typical functions of the job, not an exhaustive list of all possible job responsibilities, tasks, duties, and assignments. Furthermore, job duties, responsibilities and activities may change at any time with or without notice.\nRequired Qualifications\nEducation \nDegree from an accredited nurse practitioner (NP) program.\nLicensure/Certification:\nCurrent licensure in the state of Kansas and Missouri as an Advanced Practice Registered Nurse.\nCertification through an approved credentialing center (i.e., American Nursing Credentialing Center or American Nurses Credentialing Center).\nCurrent certification of basic life support (BLS) \nCurrent Drug Enforcement Administration (DEA) number.\nWork Experience:\nPrevious experience working with people of varying backgrounds.\nPreferred Qualifications\nWork experience:\nExperience having difficult health related conversations.\nSkills:\nExcellent communication as evidence by application materials.\nLanguages:\nSpanish - Bilingual proficiency\nRequired Documents\nResume/CV\nCover Letter\nPersonal Statement: The personal statement provides an opportunity to discuss the talents, experiences and goals that qualify you as a unique APP Brain Health Fellowship candidate. We are seeking evidence of your interest in caring for patients with ADRD and your plans after completion of the fellowship. Your personal statement should be 1 page and uploaded as a PDF.\nReferences: Professional references are optional but highly encouraged from a program director, clinical preceptor, employer reference, etc. Reference letters should be uploaded as a PDF.\nComprehensive Benefits Package:\nCoverage begins on day one for health, dental, and vision insurance and includes health expense accounts with generous employer contributions if the employee participates in a qualifying health plan. Employer-paid life insurance, long-term disability insurance, and various additional voluntary insurance plans are available. Paid time off, including vacation and sick, begins accruing upon hire, plus ten paid holidays. One paid discretionary day is available after six months of employment, and paid time off for bereavement, jury duty, military service, and parental leave is available after 12 months of employment. A retirement program with a generous employer contribution and additional voluntary retirement programs (457 or 403b) are available. https://www.kumc.edu/human-resources/benefits.html\nEmployee Type: \nFixed Term (Fixed Term)\nTime Type: \nFull time\nRate Type: \nSalary\nCompensation Statement:\nThe pay range listed for this position is determined by our compensation program using market data and salary benchmarking. A combination of factors is considered in making compensation decisions including, but not limited to, education, experience and training, qualifications relative to the requirements of the position, and funding. At the University of Kansas Medical Center, a reasonable estimate for the starting pay range will be the minimum to midpoint of the posted range, taking into account the combination of factors listed above. \nPay Range:\nMinimum\nMidpoint\nMaximum",
        "job_location": "Kansas City Metro Area"
    },
    {
        "company": "Roper St. Francis Healthcare (EasyService)",
        "company_url": "https://easyservice.wd5.myworkdayjobs.com/RoperStFrancisHealthcare?q=nurse",
        "job_title": "Assistant Nurse Manager - Labor And Delivery - Berkeley Hospital",
        "job_href": "https://easyservice.wd5.myworkdayjobs.com/en-US/RoperStFrancisHealthcare/job/Summerville-SC/Assistant-Nurse-Manager---Labor-And-Delivery---Berkeley-Hospital_R241910?q=nurse",
        "job_posting_text": "locations\nSummerville, SC\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR241910\nThank you for considering a career at Roper St. Francis Healthcare!\nScheduled Weekly Hours:\n40\nWork Shift:\nEvenings (United States of America)\nManager seeking prior Labor And Delivery RN experience. Preference for prior managerial experience.\nShift Hours: 3:00pm - 11:00pm including one weekend per month.\nPosition Start Date: November 3, 2025\nRoper St. Francis Berkeley Hospital: Expanding to Serve More\nOur community is growing and so are we! Roper St. Francis Berkeley Hospital is doubling its bed capacity as part of a major expansion, set for completion in early 2026.\nThis growth will bring expanded services to emergency, cardiology, orthopedics, obstetrics, neurology, inpatient dialysis and additional specialties in our Medical Office Building.\nWe are proud to be a trusted place of hope, healing and support for our neighbors, families and friends. Ready to make a difference? Let’s build something together.\nPrimary Function/General Purpose of Position  \nManages, coordinates, and evaluates all elements of financial, material and human resources in the provision of nursing care to assigned group of patients in accordance with the service and missions of the institution. Provides nursing care for patients following established standards and practices in accordance with the South Carolina Nurse Practice Act (RN) and following hospital standards and professional practice. \n Essential Job Functions  \nManages personnel to ensure the availability of an appropriately credentialed, clinically competent, well-developed cohesive work force to meet patient care needs. Advises the Manager on the hiring, retention, interviewing and recruitment of staff. Promotes cooperative problem solving, individual and group goal orientation, appropriate delegation of departmental activities and fostering team building through individual coaching and counseling, regular attendance at staff meetings, performance appraisals, and active participation in the activities of the department. \nParticipates in performance improvement initiatives. Using available data makes appropriate clinical decisions regarding situations affecting patient care, medical-legal issues, bed coordination, unit staffing, etc. Assists staff in nursing and other departments to resolve problems that impact the delivery of patient care.  \nEngages in fiscal activities to ensure the availability of supplies, equipment, and human resources to meet patient care needs in a timely cost effective manner. Monitors all assigned expense budgets and provides information and/or justification of variances as appropriate. Participates in budget preparation for cost centers. Assures economical utilization of time, materials and resources through review of workflow and staffing patterns to achieve optimal productivity and to provide cost effective staffing and ensure quality patient care.  \nEffectively communicates with Medical staff, patients, staff and other departments as necessary to identify problems and provide problem resolution in support of the hospital’s mission of quality patient care delivery. Assures continual assessment of patient/family experience issues and takes appropriate action to resolve any issues.  \nRounds on staff and shares findings with leadership. Ensures the establishment and implementation of a unit culture that is responsive to patients and families. Effectively supports and provides leadership to the department to support the goals and philosophy of the organization.  \nAssesses each unit’s activity level during rounds. Confers with the leadership regarding unusual patient care situations or other concerns identified. Responds to emergent situations, assesses the need for additional help, coordinates plan for patient transfers, if necessary, and ensures family support. Displays expertise when assisting with clinical nursing issues and consults with other professionals as needed.  \nAssures the adherence of all standards and policies as set forth by RSFH and the accrediting bodies for the purposes of licensure, regulation and accreditation. Assures the completion of quality control procedures, and appropriate documentation. Participates in the development, review, and communication of policies and procedures ensuring information is available for staff in a timely manner and incorporates into unit practice routines. Assists Manager in coordinating all departmental function in preparation for inspection by accrediting agencies, and for licensure, ensuring compliance. Assists Manager in timely follow-up of incident reports. \n This document is not an exhaustive list of all responsibilities, skills, duties, requirements, or working conditions associated with the job. Employees may be required to perform other job-related duties as required by their supervisor, subject to reasonable accommodation. \n Licensing/Certification \nCurrently licensed as a Registered Nurse in the state of South Carolina or holds a current compact/multi-state license as a Registered Nurse in a recognized NCSBN Compact State and is not a permanent resident of SC.  \nMust have a current American Heart Association BLS for Healthcare Provider Card. \n Education \nBachelor of Science Degree in Nursing required. (required) \n Work Experience \nAt least 2 years’ work experience as a Registered Nurse (required)  \n3 years experience (preferred)  \n Training \n Language \n Patient Population  \nThe following must be included in all position descriptions that involve direct or indirect patient care.  This is a Joint Commission requirement.  Also, select the age of the patient population served:  \nX      Demonstrates the knowledge and skills necessary to provide care appropriate to the age of the patients served on his or her assigned unit. \nDemonstrates knowledge of the principles of growth and development of the life span and possesses the ability to assess data reflective of the patient's status and interprets the appropriate information needed to identify each patient's requirements relative to his or her age, specific needs and to provide the care needed as described in departmental policies and procedures. \nNeonates (0-4 weeks) \nInfant (1-12 months) \nPediatrics (1-12 years) \nAdolescents (13-17 years) \nAdults (18-64 years) \nGeriatrics (65 years and older) \nNot applicable to this position \n Working Conditions/Physical Requirements  \nFrequent standing, walking, bending, crouching, stooping. Frequent lifting/moving patients. Intermittent lifting, moving or carrying over 50 lbs. Frequent pushing or pulling over 50 lbs. Frequent use of finger/hand dexterity. Constant reaching with hands/arms. Frequent talking or hearing. Corrected hearing and vision to normal range. Exposure to blood, body fluids or tissue. Possible exposure to infectious materials, communicable diseases and/or other conditions common to a healthcare environment. Intermittent exposure to risk of exposure to blood-borne pathogens. Moderate noise level in work area. Requires work under stressful conditions, deadlines, or irregular hours. May be required to take call and/or work weekends/holidays based on the needs of the department.                                                                     \n Skills \nHard/Tech/Clinical Skills: \nKnowledge of organizational policies and procedures to provide patient care.  \nKnowledge of common safety hazards and precautions to establish a safe work environment.  \nKnowledge of common safety hazards and precautions to establish a safe work environment. \n Soft/Interpersonal Skills: \nSkill in preparing and maintaining effective working relationships.  \nAbility to communicate clearly.  \nAbility to organize and prioritize multiple tasks quickly in a fast-paced environment \nRoper St. Francis Healthcare is an equal opportunity employer.\nMany of our opportunities reward* your hard work with:\nComprehensive, affordable medical, dental and vision plans\nPrescription drug coverage\nFlexible spending accounts\nLife insurance w/AD&D\nEmployer contributions to retirement savings plan when eligible\nPaid time off\nEducational Assistance\nAnd much more \n*Benefits offerings vary according to employment status.\nDepartment:\nNursing Obstetrics - Berkeley Hospital\nIt is our policy to abide by all Federal and State laws, as well as, the requirements of 41 CFR 60-1.4(a), 60-300.5(a) and 60-741.5(a). Accordingly, all applicants will receive consideration for employment without regard to race, color, national origin, religion, sex, sexual orientation, gender identity, age, genetic information, or protected veteran status, and will not be discriminated against on the basis of disability. If you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please contact The Talent Acquisition Team at recruitment@RSFH.com.",
        "job_location": "Summerville, SC"
    },
    {
        "company": "Oregon State Government",
        "company_url": "https://oregon.wd5.myworkdayjobs.com/SOR_External_Career_Site?q=nurse",
        "job_title": "Licensed Practical Nurse - Oregon State Hospital Salem Campus",
        "job_href": "https://oregon.wd5.myworkdayjobs.com/en-US/SOR_External_Career_Site/job/Salem--OHA--Oregon-State-Hospital/Licensed-Practical-Nurse---Oregon-State-Hospital-Salem-Campus_REQ-181239?q=nurse",
        "job_posting_text": "locations\nSalem | OHA | Oregon State Hospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-181239\nInitial Posting Date: \n06/01/2025\nApplication Deadline:\n06/30/2025\nAgency:\nOregon Health Authority\nSalary Range:\nPosition Type:\nEmployee\nPosition Title:\nLicensed Practical Nurse - Oregon State Hospital Salem Campus\nJob Description:\nOpportunity Awaits, Apply Today!  - Licensed Practical Nurse\n The Oregon State Hospital, a division of the Oregon Health Authority, has a fantastic opportunity for Licensed Practical Nurses to join an excellent team working to help people recover from their illness and return to their lives in the community. \n\nWhat you will do!\nYou'll assist in determining and providing the medical/psychiatric nursing care and treatment for patients at Oregon State Hospital, under the supervision of the RN. You will administer medications as ordered by the provider, complete focused assessments, and respond to emergent psychiatric situations that could potentially be dangerous.  Additionally, you will assist in providing a safe, secure environment and contribute to the maintenance of the therapeutic milieu. \n For a full review of the position description, please click here\n If this opportunity aligns with your strengths, background, and commitment to fostering inclusivity, we encourage you to apply! At the Oregon Health Authority (OHA), we value diversity and encourage applicants from all backgrounds and experiences to help us build a stronger, more equitable future for all.\nWhat We Are Looking For\nMinimum Qualifications:\nPossess a valid Oregon Practical Nurse License at the time of appointment. The license must be obtained within a reasonable amount of time from the application date.\nDesired Attributes: \nExperience working in mental health\nExperience in conflict and crisis management\nStrong leadership skills\nExperience in milieu management\nAbility to manage multiple job responsibilities at one time\nAdditional Requirements of the LPN position:\nIf you are offered employment, the offer will be contingent upon the outcome of an abuse check, criminal records check and driving records check, and the information shall be shared with the Oregon Health Authority (OHA), Office of Human Resources (OHR). Any criminal or founded abuse history will be reviewed and could result in the withdrawal of the offer or termination of employment.\nCandidates who are offered employment at the Oregon State Hospital must satisfactorily pass a pre-employment drug test.\nApplication Guidance\nHow to Apply: Submission Requirements - At the time of application, ensure the work history in your applicant profile is up to date and answer all supplemental questions. \nExternal Candidates: Visit the State of Oregon job opportunities webpage to submit your application. Be sure to follow all application submission requirements.\nInternal Candidates: Current State of Oregon employees must apply through their employee Workday login. Be sure to follow all application submission requirements.\nAfter You Apply:\nBefore the job announcement closes, log in to your Workday account to check for pending tasks under “My Applications” and complete them.\nRemember to check your email (including your junk folder) and Workday inbox for updates on your application.\nWe value our veterans! To ensure the security of your information, kindly follow the instructions for how to submit your Veteran documents for preference found here. Please do not attach your Veterans’ preference documentation in the Resume/CV field of your application.\nReminders:\nYour candidate profile and application materials are great opportunities to showcase your interest in the position and highlight your skills and experience. Submissions will be screened for consistency and communication skills, including attention to detail, spelling, and grammar. For more tips and guidance, check out What you need to know to get the job!\nThis announcement is for permanent, full-time, Licensed Practical  Nurse positions located in Salem, Oregon (2600 Center St. NE). These positions are represented by Service Employees International Union (SEIU). \nThis position is 100% onsite. Please check SECTION 4. WORKING CONDITIONS, of the position description linked above to review more details regarding the details surrounding the working conditions.\nPlease download and save a copy of this job announcement and linked position description, as it is not available after the application deadline. For questions about the announcement, or if you require an alternate format to apply, please contact Jenny Templin at 971-372-8147 or Jenny.Templin@oha.oregon.gov.\nBenefits of Joining Our Team\nWe offer a workplace that balances productivity with enjoyment; promote an atmosphere of mutual respect, dedication, and enthusiasm. You will collaborate with a team of bright individuals to work with and learn from. If you're driven by the passion to do something meaningful that changes lives, the Oregon Health Authority is the place for you. We also offer a competitive benefits package including:\nExcellent medical, vision, and dental benefits package for the employee and qualified family members with a very low monthly out-of-pocket cost.\nOptional life insurance, short-term disability, long-term disability, deferred compensation savings program, and flexible spending accounts for health care   Employee benefits include 11 paid holidays, 3 personal business days, 8 hours of monthly sick leave, and vacation accrual starting at 8 hours per month.\nPossible eligibility for the Public Service Loan Forgiveness Program.\nMembership in the Public Employees Retirement System (PERS)/Oregon Public Service Retirement Plan (OPSRP).\nTraining opportunities that will help grow your career with the State of Oregon.\nAdditional Details\nThe information in your application will be used to complete an Equal Pay Analysis to determine salary placement upon hire. Visit the Department of Administrative Services Equal Pay Analysis Webpage for more information.\nThe salary listed is the non-PERS qualifying salary range. If the successful candidate is PERS qualifying, the salary range will reflect the additional 6.95%. Review the Classification and Compensation page for more details on the classification.\nAgency does not offer visa sponsorship. Within three days of hire, applicants will be required to complete I-9 documentation and confirm authorization to work in the United States. If your employment authorization and documentation is contingent on sponsorship now or in the future, you will not meet Agency employment eligibility standards.\nHelpful Links & Resources\nHow to Set Job Alerts | Workday Applicant FAQ | Oregon Health Authority | Facebook | Instagram | LinkedIn | Veterans Resources\nThe Oregon Health Authority is an equal opportunity, affirmative action employer, committed to diversity and pay equity.",
        "job_location": "Salem | OHA | Oregon State Hospital"
    },
    {
        "company": "Albany Medical Center",
        "company_url": "https://albanymed.wd5.myworkdayjobs.com/Albany_Med?q=nurse",
        "job_title": "Manager Of Nursing Hospital - Digestive Disease Center",
        "job_href": "https://albanymed.wd5.myworkdayjobs.com/en-US/Albany_Med/job/43-New-Scotland-Avenue-Albany-NY-12208/Manager-Of-Nursing-Hospital---Digestive-Disease-Center_65265?q=nurse",
        "job_posting_text": "locations\n43 New Scotland Avenue Albany, NY 12208\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\n65265\nDepartment/Unit:\nDigestive Disease Center\nWork Shift:\nDay (United States of America)\nSalary Range:\nThe Nurse Manager has 24-hour responsibility, accountability, and authority for the management of resources within the defined patient care area(s), The Nurse Manager utilizes the patient care framework that includes Total Quality Management, Shared Governance, and Primary nursing to assure patient care. The Nurse Manager utilizes organizational resources and demonstrates leadership behaviors that empower staff to deliver excellent patient care. In the absence of the Patient Care Service Director, will assume the responsibilities outlined in the Patient Care Service Director Job Description.\n\nEssential Duties and Responsibilities\nProvides proactive administrative and staff support in a patient centered environment.\nPromotes center strategies that provides excellence in patient care.\nCoordinates the flow of communication to maintain optimal unit/department operations.\nAdvocates for patients, families, and staff.\nSupports lifelong learning , by using the organization’s established empowerment process.\nPromotes fiscally responsible financial planning which is linked to Center goals.\nActs as a mentor and consultant to staff by incorporating the organization’s mission, vision,\nand values to enhance patient satisfaction by anticipating and exceeding patients’ needs.\n\nQualifications\nBachelor's Degree in Nursing - required\nMaster's Degree in Nursing - preferred\nPrevious experience managing teams with diverse skills and roles. - required\nDemonstrated ability to communicate effectively to the team, manage resources and empower staff to provide excellent patient care.\nRN - Registered Nurse - State Licensure and/or Compact State Licensure Upon Hire - required\n\nPhysical Demands\nStanding - Constantly\nWalking - Constantly\nSitting - Rarely\nLifting - Frequently\nCarrying - Frequently\nPushing - Occasionally\nPulling - Occasionally\nClimbing - Occasionally\nBalancing - Occasionally\nStooping - Frequently\nKneeling - Frequently\nCrouching - Frequently\nCrawling - Occasionally\nReaching - Frequently\nHandling - Frequently\nGrasping - Frequently\nFeeling - Constantly\nTalking - Constantly\nHearing - Constantly\nRepetitive Motions - Constantly\nEye/Hand/Foot Coordination - Constantly\n\nThank you for your interest in Albany Medical Center!\n\nAlbany Medical Center is an equal opportunity employer.\n\nThis role may require access to information considered sensitive to Albany Medical Center, its patients, affiliates, and partners, including but not limited to HIPAA Protected Health Information and other information regulated by Federal and New York State statutes. Workforce members are expected to ensure that:\nAccess to information is based on a “need to know” and is the minimum necessary to properly perform assigned duties. Use or disclosure shall not exceed the minimum amount of information needed to accomplish an intended purpose. Reasonable efforts, consistent with Albany Medical Center policies and standards, shall be made to ensure that information is adequately protected from unauthorized access and modification.\nThank you for your interest in Albany Medical Center!\nAlbany Medical is an equal opportunity employer.\nThis role may require access to information considered sensitive to Albany Medical Center, its patients, affiliates, and partners, including but not limited to HIPAA Protected Health Information and other information regulated by Federal and New York State statutes. Workforce members are expected to ensure that:\nAccess to information is based on a “need to know” and is the minimum necessary to properly perform assigned duties. Use or disclosure shall not exceed the minimum amount of information needed to accomplish an intended purpose. Reasonable efforts, consistent with Albany Med Center policies and standards, shall be made to ensure that information is adequately protected from unauthorized access and modification.",
        "job_location": "43 New Scotland Avenue Albany, NY 12208"
    }
]