[
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "Clinical Nurse",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Philadelphia-PA/Clinical-Nurse_REQ-0012105-1?q=nurse",
        "job_posting_text": "locations\nPhiladelphia, PA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0012105\nJob Details\nJob Description\nWork Shift\nWorkday Day (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n111 S 11th Street, Philadelphia, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Philadelphia, PA"
    },
    {
        "company": "Methodist Le Bonheur Healthcare",
        "company_url": "https://methodisthealth.wd5.myworkdayjobs.com/MLH?q=nurse",
        "job_title": "Clinic RN",
        "job_href": "https://methodisthealth.wd5.myworkdayjobs.com/en-US/MLH/job/Methodist-Comprehensive-Breast-Center---Germantown/Clinic-RN_R-10888?q=nurse",
        "job_posting_text": "remote type\nOn Campus\nlocations\nMethodist Comprehensive Breast Center - Germantown\nMethodist Comprehensive Breast Center - Midtown\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-10888\nIf you are looking to make an impact on a meaningful scale, come join us as we embrace the Power of One!\n We strive to be an employer of choice and establish a reputation for being a talent rich organization where Associates can grow their career caring for others. For over a century, we’ve served the health care needs of the people of Memphis and the Mid-South.\n The RN serves as a consistent care coordinator through out the continuum of care for patients entering or within our health system.  Assesses the physical, psychological, and social needs of the patient, and improves the care experience for the patient and their family. Responsible for the nursing care of patients in a clinical/office setting.  Coordinates communication with providers on behalf of the patient.  Meets the needs of the patient in relation to education, screening, prevention and follow-up care. Models appropriate behavior as exemplified in MLH Mission, Vision and Values.\n\n Working at MLH means carrying the mission forward of caring for our community and impacting the lives of patients in every way through compassion, a deliberate focus on service expectations and a consistent thriving for excellence.\n\nA Brief Overview\nThe RN serves as a consistent care coordinator through out the continuum of care for patients entering or within our health system. Assesses the physical, psychological, and social needs of the patient, and improves the care experience for the patient and their family. Responsible for the nursing care of patients in a clinical/office setting. Coordinates communication with providers on behalf of the patient. Meets the needs of the patient in relation to education, screening, prevention and follow-up care. Models appropriate behavior as exemplified in MLH Mission, Vision and Values.\n\n\nWhat you will do\nAssesses the physical, psychological, and social needs of the patient, and improves the care experience for the patient and their family.\nCreates a seamless flow through the health system to facilitate the patient’s care.\nDevelops and coordinates education, resources, and activities that provide understanding and support for patients and families.\nMaintains reliable systems to document, track and monitor patient data.\nPerforms clinical procedures within the scope of nursing practice and clinical training.\nMay perform telephone duties within the scope of RN role.\nPerforms other job functions as assigned or requested.\n\nEducation/Formal Training Requirements\nAssociate's Degree Nursing- RN\nBachelor's Degree Nursing- RN\n\nWork Experience Requirements\n1-3 years Registered Nurse Minimum of one (1) year of registered nurse experience in a medical, surgical, and/or clinical setting.\nLicenses and Certifications Requirements\nBASIC LIFE SUPPORT - American Heart Association\nRegistered Nurse Tennessee - Tennessee Board of Nursing\nRegistered Nurse Arkansas - Arkansas State Board of Nursing\nRegistered Nurse Mississippi - Mississippi Board of Nursing\n\nKnowledge, Skills and Abilities\nKnowledgeable of system’s health resources in order to navigate the patient to appropriate care.\nMust have excellent verbal and written communication skills, a desire to problem solve, and strong conflict resolution abilities.\nStrong computer skills.\nMust be a role model in customer service and patient care.\nDisplays sensitivity and compassion.\n\nSupervision Provided by this Position\nThere are no supervisory roles assigned to this position.\n\nPhysical Demands\nThe physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion.\nMust have good balance and coordination.\nThe physical requirements of this position are: medium work - exerting up to 50 lbs. of force occasionally and/or up to 25 lbs. of force frequently.\nThe Associate is required to have close visual acuity including color, depth perception, and field of vision to perform an activity, such as assessing patients, preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading.\nFrequent invasive and non-invasive patient contact.\nExposure to patient body fluids as well as exposure to hazardous or poisonous materials.\nAbility to react quickly to emergency situations.\nAbility to handle and administer medications, vaccinations and immunizations as needed.\n\nOur Associates are passionate about what they do, the service they provide and the patients they serve. We value family, team and a Power of One culture that requires commitment to the highest standards of care and unity.\n\nBoasting one of the South's largest medical centers, Memphis blends a friendly community, a thriving and growing downtown, and a low cost of living. We see each day as a new opportunity to make a difference in the lives of the people in our community.",
        "job_location": "2 Locations"
    },
    {
        "company": "Advocate Aurora Health (AAH)",
        "company_url": "https://aah.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Ambulatory Nurse Assistant I, Full-time 12 hr. Nights",
        "job_href": "https://aah.wd5.myworkdayjobs.com/en-US/External/job/Kernersville-NC---111-Gateway-Center-Dr/Ambulatory-Nurse-Assistant-I--Full-time-12-hr-Nights_R167310?q=nurse",
        "job_posting_text": "locations\nKernersville, NC - 111 Gateway Center Dr\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR167310\nDepartment:\n02190 WFBMG University Group Practice: Kernersville - Immediate Care\nStatus: \nFull time\nBenefits Eligible:\nYes\nHours Per Week:\n36\nSchedule Details/Additional Information:\nFull Time Night shift 7p-7a, 3 days a week, every other weekend\nEDUCATION/EXPERIENCE: High school diploma or GED equivalent. Completion of a applicable state State approved Nurse Aide I course. Minimum of two years' CNA I experience preferred. LICENSURE, CERTIFICATION, and/or REGISTRATION: Certification by State of applicable state as CNA I. Registered as a Nurse Aide I with the applicable state Department of Health and Human Service Regulation. Basic Cardiac Life Support (BCSL) required. Pediatric Emergency Assessment, Recognition and Stabilization (PEARS) may be required within one year in select areas. ESSENTIAL FUNCTIONS: 1. Assists medical staff with preparation, examination, and procedures including interviewing/screening patients to obtain personal data and chief complaint, documentation for records, and vital signs. 2. Participates in the implementation of the nursing process by giving direct care to patients under the direction of the RN or LPN. 3. Sets up, cleans, restocks, and prepares examination rooms. Prepares equipment, autoclave, sterilizer, and maintain treatment areas. 4. Ensures complete, accurate and timely communication of patient information. 5. Collects and processes specimens for diagnostic testing according to policy. 6. Documents all patient care delivered in the medical record according to medical center policy. 7. Performs and maintains competency for point of care testing as assigned, ensuring compliance with WFBH Point of Care policies and with applicable state and federal regulations. 8. Communicates to the team, colleagues, patients and family members in an effective, positive and professional manner. 9. Takes personal responsibility and initiative for performance and for professional growth and development. 10. Provides age/developmental appropriate patient care in accordance with age/developmental specific care guidelines for the clinical population served. 11. Complies with Medical Center Infection Prevention policies to manage infectious materials using aseptic techniques, sanitization, chemical disinfection, surgical asepsis, and correct handling of biohazardous materials. 12. Complies with the Medical Center mission, vision, and values as well as the philosophy of the Department of Nursing and Service line standards in caring for patients. 13. Performs other related duties incidental to work described herein. SKILLS/QUALIFICATIONS: Strong oral and written communication skills Excellent interpersonal skills Basic computer skills Performs effectively with frequent workload changes and competing demands WORK ENVIRONMENT: Typical clinical setting Contact with patients, family members, visitors, co-workers, and medical staff under wide variety of circumstances Regular exposure to blood-borne diseases, infectious and contagious diseases Subject to multiple interruptions Occasional exposure to radiation hazards Possible exposure to cleaning agents/chemicals Occasionally subject to irregular hours Uses personal protective equipment PHYSICAL REQUIREMENTS: 0% 35% 65% to to to 35% 65% 100% N/A Activity X Standing X Walking X Sitting X Bending X Reaching with arms X Finger and hand dexterity X Talking X Hearing X Seeing Lifting, carrying, pushing and or pulling: X 20 lbs. maximum X 50 lbs. maximum X 100 lbs. maximum\nPay Range\n$19.45 - $29.20\nOur Commitment to You:\nAdvocate Health offers a comprehensive suite of Total Rewards: benefits and well-being programs, competitive compensation, generous retirement offerings, programs that invest in your career development and so much more – so you can live fully at and away from work, including:\nCompensation\nBase compensation listed within the listed pay range based on factors such as qualifications, skills, relevant experience, and/or training\nPremium pay such as shift, on call, and more based on a teammate's job\nIncentive pay for select positions\nOpportunity for annual increases based on performance\nBenefits and more\nPaid Time Off programs\nHealth and welfare benefits such as medical, dental, vision, life, and Short- and Long-Term Disability\nFlexible Spending Accounts for eligible health care and dependent care expenses\nFamily benefits such as adoption assistance and paid parental leave\nDefined contribution retirement plans with employer match and other financial wellness programs\nEducational Assistance Program\nAbout Advocate Health \nAdvocate Health is the third-largest nonprofit, integrated health system in the United States, created from the combination of Advocate Aurora Health and Atrium Health. Providing care under the names Advocate Health Care in Illinois; Atrium Health in the Carolinas, Georgia and Alabama; and Aurora Health Care in Wisconsin, Advocate Health is a national leader in clinical innovation, health outcomes, consumer experience and value-based care. Headquartered in Charlotte, North Carolina, Advocate Health services nearly 6 million patients and is engaged in hundreds of clinical trials and research studies, with Wake Forest University School of Medicine serving as the academic core of the enterprise. It is nationally recognized for its expertise in cardiology, neurosciences, oncology, pediatrics and rehabilitation, as well as organ transplants, burn treatments and specialized musculoskeletal programs. Advocate Health employs 155,000 teammates across 69 hospitals and over 1,000 care locations, and offers one of the nation’s largest graduate medical education programs with over 2,000 residents and fellows across more than 200 programs. Committed to providing equitable care for all, Advocate Health provides more than $6 billion in annual community benefits.",
        "job_location": "Kernersville, NC - 111 Gateway Center Dr"
    },
    {
        "company": "Memorial Hermann Health System",
        "company_url": "https://memorialhermann.wd5.myworkdayjobs.com/external?q=nurse",
        "job_title": "RN Clinical Manager - Med Surg Tele (Pearland)",
        "job_href": "https://memorialhermann.wd5.myworkdayjobs.com/en-US/external/job/Pearland-Hospital/RN-Clinical-Manager---Med-Surg-Tele--Pearland-_100171481?q=nurse",
        "job_posting_text": "locations\nPearland Hospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\n100171481\nAt Memorial Hermann, we pursue a common goal of delivering high quality, efficient care while creating exceptional experiences for every member of our community. When we say every member of our community, that includes our employees. We know that when our employees feel cared for, heard and valued, they are inspired to create moments that exceed expectations, while prioritizing safety, compassion, personalization and efficiency. If you want to advance your career and contribute to our vision of creating healthier communities, now and for generations to come, we want you to be a part of our team.\nJob Summary\nThis position is responsible for providing leadership to the department. Oversees daily operations, manages and develops departmental staff, collaborates with the interdisciplinary team in the delivery of patient care. Utilizes the nursing process to ensure the delivery of quality care to patients.\n\nMemorial Hermann Pearland Hospital (ANCC Magnet designated), one of the fastest-growing communities in the country, brings the expertise of the Memorial Hermann Health System close to home. We are expanding and currently seeking a Nurse Manager to lead our 34 bed Med/Surg Tele unit overseeing approximately 50 FTEs. Come grow with us!\n\n• Caring, Fun, and supportive environment with a strong focus on compassionate and quality patient care. \n• Non specialized units with a wide variety of patients to care for: Cardiac (CHF, MI, Heart Cath patients), Neuro (stroke, seizures), Diabetes, Surgical (orthopedic, general) and more. \n• 24 hour hospitalist coverage\nJob Description\nMinimum Qualifications\nEducation: \nBachelor of Science in Nursing degree from an accredited school of professional nursing required or documented degree plan and timeframe to complete Bachelor of Science in Nursing (BSN)\nFor clinical manager positions in Magnet-designated hospitals or hospitals in pursuit of Magnet designation, a minimum of a BSN is required at the time of hire or promotion\nLicenses/Certifications:\nCurrent State of Texas license or temporary/compact license to practice professional nursing\nCertified in Basic Life Support\nProfessional certification in clinical area or management preferred\nAdditional certifications may be required based on discipline and/or nursing unit requirements\nExperience / Knowledge / Skills:\nThree (3) or more years experience in clinical area of practice; and\nMinimum of one (1) year experience in a supervisory or management role\nClinical Manager II:  additional two (2) years experience (3 years total) in supervisory or management job",
        "job_location": "Pearland Hospital"
    }
]