[
    {
        "company": "Western Governors University (WGU)",
        "company_url": "https://wgu.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Standardized Patient, NP Practicum (4–48 hrs/month @ Clinical Lab in Salt Lake City) PRN | Leavitt School of Health",
        "job_href": "https://wgu.wd5.myworkdayjobs.com/en-US/External/job/Salt-Lake-City-Lab/Standardized-Patient--NP-Practicum--4-48-hrs-month---Clinical-Lab-in-Salt-Lake-City--PRN---Leavitt-School-of-Health_JR-021934?q=nurse",
        "job_posting_text": "locations\nSalt Lake City Lab\ntime type\nPart time\nposted on\nPosted Today\ntime left to apply\nEnd Date: June 23, 2025 (8 hours left to apply)\njob requisition id\nJR-021934\nIf you’re passionate about building a better future for individuals, communities, and our country—and you’re committed to working hard to play your part in building that future—consider WGU as the next step in your career.\nDriven by a mission to expand access to higher education through online, competency-based degree programs, WGU is also committed to being a great place to work for a diverse workforce of student-focused professionals. The university has pioneered a new way to learn in the 21st century, one that has received praise from academic, industry, government, and media leaders. Whatever your role, working for WGU gives you a part to play in helping students graduate, creating a better tomorrow for themselves and their families.\nThe salary range for this position takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs.\nAt WGU, it is not typical for an individual to be hired at or near the top of the range for their position, and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range is: \n Grade: Services 209\nPay Range: $26.58 - $38.50\nJob Description\nThis position presently pays $35/per hour.\nJob Qualifications:\nBachelor's degree from an accredited institution\nTwo years RN -or- certified teaching experience\nDistance education history as a student/teacher preferred\nExperience conducting virtual presentations helpful\nHistory/education in performance, role-playing etc. beneficial\nAble to work four-hour shifts and set practicums a month in advance\nEssential Responsibilities: \nThe standardized patient is responsible for playing the role of the patient during the Objective Structured Clinical Examinations (OSCEs) for nurse practitioner students.  \nDuring each OSCE the standardized patient plays the role of a fictional patient using a scripted case, including chief complaint, past medical history, physical examination findings, and appropriate responses during the simulated case.  \nThe standardized patient is responsible for being prepared to play the specific role for each OSCE using the scripted case.  \nThe standardized patient is responsible for creating a backup recording of each completed OSCE. \nThe standardized patient is responsible for helping students troubleshoot common technological issues during OSCEs.  \nAble to remain punctual for student OSCE experiences. \nExcellent time management skills. \nActs as a steward for carrying out WGU’s mission and strategic vision by demonstrating effective and consistent commitment to learner-centered, competency-based educational support.  \nFosters student learning through innovative, effective learning practices.  \nResponds with urgency to meet student needs and communicates professionally and respectfully with students and all other members of the WGU community.  \nResponds promptly to student and faculty communication. \nUses technology-based OSCE recording and communication platforms to aid students in the development and demonstration of competencies.  \nParticipates in all required training activities.  \nConsistently exhibits WGU Leadership Principles.  \nOther duties and responsibilities may be assigned as the position evolves.  \nKnowledge, Skills and Abilities:\nAbility to accurately and consistently perform specific OSCE scenarios including demonstrating symptoms, problems, and or behaviors associated with the OSCE scripts. \nAbility to effectively communicate with students acting as providers and WGU faculty.   \nAbility to remain in character when dealing with students playing the role of a healthcare provider. \nAbility to keep all OSCE case information confidential.  \nAbility to be discrete in answering student questions in order to not give away additional case information. (Don’t lead the student) \nAbility to manage time in order to prevent OSCEs from running over the assigned time per case.  \nMust demonstrate technological competency: OSCE recording and communication platforms.  \nExtraordinary customer service orientation.  \nStrong verbal and written communication skills, with ability to present information clearly, concisely, and accurately; friendly, persuasive speaking and writing style.   \nWell organized - conscientious and detail oriented.   \nStrong understanding, acceptance, adherence, and promotion of the tenets of competency-based education in the WGU model.  \nPosition & Application Details\nPart-Time Intermittent Positions (classified as intermittent and less than 30 standard weekly hours): This is a part-time, intermittent position (classified to work less than 30 SWH) that may be eligible for mental healthcare; retirement savings plan; wellbeing program; and prorated paid holidays and accrued sick time.\nHow to Apply: If interested, an application will need to be submitted online. Internal WGU employees will need to apply through the internal job board in Workday.\nAdditional Information\nDisclaimer: The job posting highlights the most critical responsibilities and requirements of the job. It’s not all-inclusive. \nAccommodations: Applicants with disabilities who require assistance or accommodation during the application or interview process should contact our Talent Acquisition team at recruiting@wgu.edu.\nEqual Employment Opportunity: All qualified applicants will receive consideration for employment without regard to any protected characteristic as required by law.",
        "job_location": "Salt Lake City Lab"
    }
]