[
    {
        "company": "Stanford Health Care",
        "company_url": "https://stanfordhealthcare.wd5.myworkdayjobs.com/SHC_Tri-Valley_External_Careers?q=nurse",
        "job_title": "Patient Care Technician ICU Full Time Nights",
        "job_href": "https://stanfordhealthcare.wd5.myworkdayjobs.com/en-US/SHC_Tri-Valley_External_Careers/job/5555-W-Las-Positas-Blvd---PLEASANTON/Patient-Care-Technician-ICU-Full-Time-Nights_R2549071?q=nurse",
        "job_posting_text": "locations\n5555 W. Las Positas Blvd. - PLEASANTON\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR2549071\nIf you're ready to be part of our legacy of hope and innovation, we encourage you to take the first step and explore our current job openings. Your best is waiting to be discovered. \n Night - 12 Hour (United States of America)\nJob Summary\nUnder the direction of a Registered Nurse, the Certified Nursing Assistant/ Monitor Tech/Unit Secretary is an integral supporting member of the clinical nursing team. This role assists in the coordination of patient care and cardiac monitoring. The role also assists in direct patient care to patients, practicing in an evidence-based manner, within the Scope of Practice of the California Nursing Practice Act, regulatory requirements, standards of care, and hospital practices.\nEssential Functions\nThe essential functions listed below are general examples and not a description of comprehensive duties.  Specific duties and responsibilities may vary depending on department or program needs without changing nature or scope of this position or level of responsibility.  May be asked to perform other duties as assigned.  \nDirect Patient Care Support Functions:\nAssists in preparation of units, patient rooms, and beds for receiving admissions, returning surgical patients, transfers, or discharges.\nInteracts with patients, families, and visitors in a courteous and professional manner, responds to patients with empathy and positive interpersonal skills.\nIn conjunction with nursing, performs hourly rounding. Completes accurate documentation in a timely manner.  Assist RN with patient care as directed. \nObtains vitals, monitors, and documents.  When appropriate, reports any changes observed in condition or behavior of patients, patient/family complaints, and all unusual occurrences.\nProvides general nursing care such as positioning ambulation and transferring; lifting and turning; applying and utilizing special equipment.   \nProvides morning and evening activities of daily living care for patient.\nProvides meal support for patient as needed.\nPerforms routine treatment procedures including application of appliances for heat and cold, sitz baths, special skin care, while assuring patient comfort and safety, upon direction of RN.\nAnswers Responds to patient call lights immediately and timely, anticipates patient needs, and checks on patients regularly; demonstrates a cooperative attitude when assisting patients. Makes rounds on assigned patients regularly.\nProvides post-mortem care and assists in transporting bodies to the morgue.\nAdheres to infection control policies and practices. \nEmployee must perform all duties and responsibilities in accordance with the C-I-CARE Standards of the Hospital. C-I-CARE is the foundation of Stanford Healthcare – ValleyCare’s patient-experience and represents a framework for patient-centered interactions\nIndirect Patient Care Support Functions:\nServes as the focal point of communication and flow of the nursing unit. \nPerforms various clerical activities and related non-professional services necessary in caring for the personal needs and comfort of the patient. \nProvides continuous cardiac monitoring as a trained observer at the nurse’s station.\nRuns telemetry strips per policy or when requested.\nMaintains a safe a clean environment through shift environmental rounds, reports/corrects hazardous conditions within scope of responsibility.\nAppropriately communicates/corrects issues to proper departments.\nSupports discharge planning functions and team rounding activities.\nAdheres to departmental and hospital policies and procedures.\nReceives, greets, and directs patients, visitors, and employees arriving at the unit, or calling the patient care unit.\nDemonstrates excellent telephone etiquette when receiving, placing, or transferring calls.\nAppropriately responds to all safety and emergency signals and notifications.\nAlways maintains confidentiality of patients and patient information .\nResponds to patient call lights timely and reports patient needs appropriately.\nReceives and distributes mail, flowers, and various other items for patients on the unit.\nMaintains adequate quantity of forms, materials, supplies, and equipment on assigned units.  Orders supplies as necessary according to standards and ensures fiscal responsibility.\nMaintains clean and organized work and storage areas.\nUpdates patient flow and assignment board.\nMaintains downtime forms and other necessary forms.\nMaintains unit specific records, logs, and binders. Example: temperature logs, etc.\nAnswers patient call lights and facilitates patient care needs timely. when nursing personnel is unavailable.\nMonitors the fax machine for incoming communications.\nChecks charts of all patients scheduled for surgery or special/diagnostic procedures and assures required information is complete e.g., labs, x-rays, H&P, pre-surgery forms.\nAssists patients and care team with medical record requests.\nContributes to the team spirit and cohesiveness of the unit and nursing department.\nContributes to unit and department problem solving and issue resolution.\nMaintains a professional attitude, demeanor and appearance, wears prescribed departmental uniform, wears identification name badge.\nCompletes a comprehensive shift report to oncoming staff and reports time of unit before leaving unit.\nEmployee must perform all duties and responsibilities in accordance with the C-I-CARE Standards of the Hospital. C-I-CARE is the foundation of Stanford Healthcare – ValleyCare’s patient-experience and represents a framework for patient-centered interactions\nJob Qualifications\nEducation   \nHigh School graduate or equivalent\nCompletion of Certified Nursing Assistant (CNA) Training Program\nExperience \nExperience working as a Certified Nursing Assistant, minimum of 2 years required\nExperience working in acute care, minimum of 3 years required\nExperience working as a unit clerk or administrative support role, preferred\nMedical terminology required\nLicense/Certification\nCurrent Certified Nursing Assistant Certification\nCurrent American Heart Association BLS Certification\nCurrent cardiac monitoring (telemetry) course certificate, or ability to obtain within 30 Days of hire and annually thereafter\nRelevant departmental certification as required (i.e.: PALS, NRP) desired\nKnowledge, Skills, and Abilities\nAbility to speak, read, write, and understand the English language\nStrong attention to detail\nKnowledge of quality and regulatory standards\nStrong interpersonal and communication skills\nAbility to work as an effective team player\nStrong computer skills\nAbility to maintain composure during emergency situations.\nAbility to organize and prioritize work efficiently.\nAbility to serve as a knowledgeable resource person to patients, staff, and visitors.\nPhysical Demand and Working Conditions\nThe Physical Requirements and Working Conditions in which the job is typically performed are available from the Occupational Health Department. Reasonable accommodations will be made to enable individuals with disabilities to perform the essential functions of the job.\n Equal Opportunity Employer\nEqual Opportunity Employer Stanford Health Care - ValleyCare (SHC - VC) strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements\nEqual Opportunity Employer Stanford Health Care (SHC) strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements.\nBase Pay Scale: Generally starting at $28.42 - $36.54 per hour\nThe salary of the finalist selected for this role will be set based on a variety of factors, including but not limited to, internal equity, experience, education, specialty and training. This pay scale is not a promise of a particular wage.",
        "job_location": "5555 W. Las Positas Blvd. - PLEASANTON"
    },
    {
        "company": "Humana",
        "company_url": "https://humana.wd5.myworkdayjobs.com/centerwell_external_career_site?q=nurse",
        "job_title": "Nurse Practitioner",
        "job_href": "https://humana.wd5.myworkdayjobs.com/en-US/centerwell_external_career_site/job/Lafayette-LA/Nurse-Practitioner_R-371035?q=nurse",
        "job_posting_text": "locations\nLafayette, LA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-371035\nBecome a part of our caring community and help us put health first\n Healthcare isn’t just about health anymore. It’s about caring for family, friends, finances, and personal life goals. It’s about living life fully. At Partners in Primary Care (PiPC), we want to help people everywhere, including our associates, lead their best lives.  At PiPC, we’re seeking innovative people who want to make positive changes in their lives, the lives of our patients, and the healthcare industry as a whole.    \n\n \n\nJOB SUMMARY: \n\nThe Nurse Practitioner (NP) works in our team-based care environment.  We are a value based care provider focused on quality of care for the patients we serve.  Our care team consists of doctors, advanced practice professionals, Pharm D, Care Coach Nurse, MA, Behavioral health specialist, quality based coder, referral coordinator and more.  Our approach allows us to provide an unmatched experience for seniors.  Our model is positioned to provide higher quality care and better outcomes for seniors by providing a concierge experience, multidisciplinary services, coordinated care supported by analytics and tools, and deep community relationships.  This robust support allows our Nurse Practitioner to see fewer patients and spend more time with those they do.\nMAJOR DUTIES AND RESPONSIBILITIES: \nPatient Care \nEvaluates and treats center patients in accordance with standards of care.\nFollows level of medical care and quality for patients and monitors care using available data and chart reviews. \nAssists in the coordination of patient services, including but not limited to specialty referrals, hospital and SNF coordination, durable medical equipment and home health care. \nActs as an active participant and lead with the care team through daily huddles. \nHelps Regional Medical Director (RMD), Physician and Center Administrator in setting a tone of cooperation in practice by displaying a professional and approachable demeanor.  \nCompletes all medical record documentation in a timely manner working with a quality- based coder to optimize coding specificity.  \nFollows policy and protocol defined by Clinical Leadership. \nMeets with RMD about quality of care, review of outcome data, policy, procedure and records issues. \nParticipates in potential growth opportunities for new or existing services within the Center. \nParticipates in the local primary care “on-call” program of FPG. \nAssures personal compliance with licensing, certification, and accrediting bodies. \nProvide coverage on as needed bases for other PIPC medical centers in the market.\n\nUse your skills to make an impact \n Required Qualifications\na Bachelor's degree\n8 or more years of technical experience\n2 or more years of project leadership experience\nActive, unrestricted Nurse Practitioner/PA license in the appropriate state\nThis role is considered patient facing and is part of Humana/Senior Bridge's Tuberculosis (TB) screening program. If selected for this role, you will be required to be screened for TB.\nMust be passionate about contributing to an organization focused on continuously improving consumer experiences\nPreferred Qualifications\nMasters in Science of Nursing /PA\n#LI-KD2\nScheduled Weekly Hours\n40\nPay Range\nThe compensation range below reflects a good faith estimate of starting base pay for full time (40 hours per week) employment at the time of posting. The pay range may be higher or lower based on geographic location and individual pay will vary based on demonstrated job related skills, knowledge, experience, education, certifications, etc.\n\n $115,200 - $158,400 per year\n\n This job is eligible for a bonus incentive plan. This incentive opportunity is based upon company and/or individual performance.\nDescription of Benefits\nHumana, Inc. and its affiliated subsidiaries (collectively, “Humana”) offers competitive benefits that support whole-person well-being. Associate benefits are designed to encourage personal wellness and smart healthcare decisions for you and your family while also knowing your life extends outside of work. Among our benefits, Humana provides medical, dental and vision benefits, 401(k) retirement savings plan, time off (including paid time off, company and personal holidays, volunteer time off, paid parental and caregiver leave), short-term and long-term disability, life insurance and many other opportunities.\n\nAbout Us\n About CenterWell Senior Primary Care: CenterWell Senior Primary Care provides proactive, preventive care to seniors, including wellness visits, physical exams, chronic condition management, screenings, minor injury treatment and more. Our unique care model focuses on personalized experiences, taking time to listen, learn and address the factors that impact patient well-being. Our integrated care teams, which include physicians, nurses, behavioral health specialists and more, spend up to 50 percent more time with patients, providing compassionate, personalized care that brings better health outcomes. We go beyond physical health by also addressing other factors that can impact a patient’s well-being.\nAbout CenterWell, a Humana company: CenterWell creates experiences that put patients at the center. As the nation’s largest provider of senior-focused primary care, one of the largest providers of home health services, and fourth largest pharmacy benefit manager, CenterWell is focused on whole-person health by addressing the physical, emotional and social wellness of our patients. As part of Humana Inc. (NYSE: HUM), CenterWell offers stability, industry-leading benefits, and opportunities to grow yourself and your career. We proudly employ more than 30,000 clinicians who are committed to putting health first – for our teammates, patients, communities and company. By providing flexible scheduling options, clinical certifications, leadership development programs and career coaching, we allow employees to invest in their personal and professional well-being, all from day one.\n\nEqual Opportunity Employer\nIt is the policy of Humana not to discriminate against any employee or applicant for employment because of race, color, religion, sex, sexual orientation, gender identity, national origin, age, marital status, genetic information, disability or protected veteran status. It is also the policy of Humana to take affirmative action, in compliance with Section 503 of the Rehabilitation Act and VEVRAA, to employ and to advance in employment individuals with disability or protected veteran status, and to base all employment decisions only on valid job requirements. This policy shall apply to all employment actions, including but not limited to recruitment, hiring, upgrading, promotion, transfer, demotion, layoff, recall, termination, rates of pay or other forms of compensation and selection for training, including apprenticeship, at all levels of employment.",
        "job_location": "Lafayette, LA"
    },
    {
        "company": "Mary Washington Healthcare",
        "company_url": "https://marywashingtonhealthcare.wd5.myworkdayjobs.com/Externalcareers?q=nurse",
        "job_title": "Certified Nursing Assistant (CNA) - General Surgery - PRN - Nights",
        "job_href": "https://marywashingtonhealthcare.wd5.myworkdayjobs.com/en-US/Externalcareers/job/Fredericksburg/Certified-Nursing-Assistant--CNA----General-Surgery----PRN---Nights_R-21464?q=nurse",
        "job_posting_text": "locations\nFredericksburg\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR-21464\nStart the day excited to make a difference…end the day knowing you did.  Come join our team.\nJob Summary: \n\nThe Certified Nursing Assistant (CNA) is accountable to the patient care team for providing direct patient care functions under the supervision of a registered nurse and performing clerical, communication and other related duties to facilitate the efficient functioning of Department services. All duties are to be performed in collaboration with team members. Duties and responsibilities are performed according to standards outlined in competency based/evaluation tool. The CNA participates in and accepts responsibility for functions delegated to the team. This position must demonstrate a commitment of quality service to our patients, the public and our co-workers.\nEssential Functions & Responsibilities:\nAssists patients in their routine activities of daily living, including but not limited to: \nPerforms range of motion.\nAmbulates patient.\nPositions patient and provides skin care.\nDistributes linen and changes bed as needed.\nAssists with feeding and meal delivery.\nAssists with routine hygiene care including toileting and incontinent care, as well as appropriate oral and personal hygiene.\nAssists patient care team in collection of patient data and specimens: \nObtains urine, stool, and sputum specimens and processes specimens as needed.\nObtains and records heath, weights, vital signs, including pulse oximetry and pain assessment and I&O.\nCommunicates patient status and reports changes in patient condition to licensed professional.\nAssists patient care team by performing and explaining designated patient care procedures: \nPerforms incentive spirometry.\nTransports patient. Preps for diagnostic tests.\nAssists rehab therapists (PM & R).\nPerforms pulse oximetry/oxygen set up in oxygen therapy.\nPrepares room (supplies). Provides post mortem care.\nPrepares for admission and discharge.\nAssists nurse in emergency situations.\nMaintains and cleans equipment.\nPerforms suction (oral, naso pharynx).\nPerforms blood sugar finger sticks.\nRemoves IV catheters per licensed nurse instruction.\nPerforms EKGs (department specific responsibility).\nResponsibilities include but are not limited to: \nAnswers unit phone and directs calls accordingly.\nPerforms data entry into electronic medical database systems. Documents patient care and related duties appropriately.\nPerforms selected patient registration activities.\nCoordinates equipment/supply needs. Notifies appropriate department of equipment malfunction.\nPerforms any other related duties (e.g., clerical, technical duties) as assigned.\nQualifications:\nHigh school diploma or GED equivalent required \nCNA license issued by the Commonwealth of VA required\nAHA BLS Provider CPR required at hire \nFor CNAs working at Snowden at Fredericksburg: CPI is required within 90 days of hire.\nAs an EOE/AA employer, the organization will not discriminate in its employment practices due to an applicant's race, color, religion, sex, sexual orientation, gender identity, national origin, and veteran or disability status.",
        "job_location": "Fredericksburg"
    },
    {
        "company": "Mary Washington Healthcare",
        "company_url": "https://marywashingtonhealthcare.wd5.myworkdayjobs.com/Externalcareers?q=nurse",
        "job_title": "Certified Nursing Assistant (CNA) - General Surgery - PRN - Days",
        "job_href": "https://marywashingtonhealthcare.wd5.myworkdayjobs.com/en-US/Externalcareers/job/Fredericksburg/Certified-Nursing-Assistant--CNA----General-Surgery----PRN---Days_R-21463?q=nurse",
        "job_posting_text": "locations\nFredericksburg\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR-21463\nStart the day excited to make a difference…end the day knowing you did.  Come join our team.\nJob Summary: \n\nThe Certified Nursing Assistant (CNA) is accountable to the patient care team for providing direct patient care functions under the supervision of a registered nurse and performing clerical, communication and other related duties to facilitate the efficient functioning of Department services. All duties are to be performed in collaboration with team members. Duties and responsibilities are performed according to standards outlined in competency based/evaluation tool. The CNA participates in and accepts responsibility for functions delegated to the team. This position must demonstrate a commitment of quality service to our patients, the public and our co-workers.\nEssential Functions & Responsibilities:\nAssists patients in their routine activities of daily living, including but not limited to: \nPerforms range of motion.\nAmbulates patient.\nPositions patient and provides skin care.\nDistributes linen and changes bed as needed.\nAssists with feeding and meal delivery.\nAssists with routine hygiene care including toileting and incontinent care, as well as appropriate oral and personal hygiene.\nAssists patient care team in collection of patient data and specimens: \nObtains urine, stool, and sputum specimens and processes specimens as needed.\nObtains and records heath, weights, vital signs, including pulse oximetry and pain assessment and I&O.\nCommunicates patient status and reports changes in patient condition to licensed professional.\nAssists patient care team by performing and explaining designated patient care procedures: \nPerforms incentive spirometry.\nTransports patient. Preps for diagnostic tests.\nAssists rehab therapists (PM & R).\nPerforms pulse oximetry/oxygen set up in oxygen therapy.\nPrepares room (supplies). Provides post mortem care.\nPrepares for admission and discharge.\nAssists nurse in emergency situations.\nMaintains and cleans equipment.\nPerforms suction (oral, naso pharynx).\nPerforms blood sugar finger sticks.\nRemoves IV catheters per licensed nurse instruction.\nPerforms EKGs (department specific responsibility).\nResponsibilities include but are not limited to: \nAnswers unit phone and directs calls accordingly.\nPerforms data entry into electronic medical database systems. Documents patient care and related duties appropriately.\nPerforms selected patient registration activities.\nCoordinates equipment/supply needs. Notifies appropriate department of equipment malfunction.\nPerforms any other related duties (e.g., clerical, technical duties) as assigned.\nQualifications:\nHigh school diploma or GED equivalent required \nCNA license issued by the Commonwealth of VA required\nAHA BLS Provider CPR required at hire \nFor CNAs working at Snowden at Fredericksburg: CPI is required within 90 days of hire.\nAs an EOE/AA employer, the organization will not discriminate in its employment practices due to an applicant's race, color, religion, sex, sexual orientation, gender identity, national origin, and veteran or disability status.",
        "job_location": "Fredericksburg"
    },
    {
        "company": "Mary Washington Healthcare",
        "company_url": "https://marywashingtonhealthcare.wd5.myworkdayjobs.com/Externalcareers?q=nurse",
        "job_title": "Licensed Practical Nurse (LPN) or Medical Assistant (MA), MWMG-Primary Care & Occupational Medicine- Lee’s Hill-Full Time Days",
        "job_href": "https://marywashingtonhealthcare.wd5.myworkdayjobs.com/en-US/Externalcareers/job/Fredericksburg/Licensed-Practical-Nurse--LPN--or-Medical-Assistant--MA---MWMG-Primary-Care---Occupational-Medicine--Lee-s-Hill-Full-Time-Days_R-21271?q=nurse",
        "job_posting_text": "locations\nFredericksburg\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-21271\nStart the day excited to make a difference…end the day knowing you did.  Come join our team.\nJob Summary:\n\nLPN-$5K Sign On Bonus Potential for Qualifying External Candidates\n\nThis position is responsible for LPN nursing services in a physician office practice to control patient flow for physician, obtain and document patient vitals, perform EKG strips, and other nursing duties as assigned.\n\nMedical Assistant \n\nThe Medical Assistant controls patient flow for providers, obtains and documents patient vitals, and performs other patient care and clerical duties. The incumbent in this position will support the mission, vision, values and strategic initiatives of Mary Washington Healthcare and must demonstrate a commitment to quality service to patients, physicians, the public and co-workers.\nLPN Essential Functions and Responsibilities: \nProvides general nursing care to patients to include obtaining and documenting patient vitals (height, weight, BP).\nRooms patients. Facilitates patient flow throughout the office.\nAssists Physician, Physician Assistant, or Nurse Practitioner with examinations, diagnostic procedures and treatments.\nObtains patient history, chief complaint and vitals and documents in medical record.\nEnsures adequate materials and supplies are available at all times.\nProvides patient and family education as appropriate.\nResponds to and provides guidance for return calls to patients for patient treatment related phone inquiries.\nEnsures patient appointments are assigned according to risk and severity.\nMaintains/reviews patient charts, records and other pertinent documents and reports.\nEstablishes and maintains high standard for customer satisfaction and customer service.\nSchedules patient appointments for office visits.\nAssists patients with scheduling of procedures, tests, and radiological exams. Obtains authorization for procedures and studies as required.\nSchedules patient surgeries.\nEnsures necessary films are available for surgeries and appointments\nLearns front office functions, providing backup support and coverage as required.\nFills out disability forms for MD/PA to review and sign.\nWorks with third party payors to obtain authorization/pre-certification for surgeries, diagnostic testing, and other procedures ordered by physician.\nRotates/provides coverage for clinical staffing needs in various Mary Washington Medical Group practices\nPerforms other duties as assigned.\nMA Essential Functions and Responsibilities: \nGreets and escorts patients to exam room in a timely and courteous manner.\nReviews patient chart to ensure all reports and results required by provider are available prior to exam/treatment. Obtains reports and results as required.\nObtains and documents patient chief complaint.\nObtains and documents patient vitals (i.e., height, weight, BP).\nEnsures exam/procedure room is appropriately supplied and set up to accommodate encounter based upon reason for patient visit.\nReviews patient-supplied history forms for completeness. Queries to obtain missing information within parameters established by supervising provider.\nAssists providers with examinations, diagnostic procedures, and treatments.\nDraws blood and/or assists in obtaining other specimens. Prepares and routes specimen(s) to laboratories; utilizing in-house services whenever appropriate; following verification of patients’ insurance.\nDocuments all activities/interventions, patient/family responses, medication prescribed, etc., in the medical record.\nCommunicates with patients regarding provider advice/instructions within scope of training.\n·        Adheres to infection control/safety guidelines, and confidentiality policies.\nPhones in prescriptions to pharmacies based upon provider’s written orders.\nProvides results and other information to patients as specifically directed by provider.\nAssists patient with the scheduling of future appointments, surgeries, and/or diagnostic testing, as necessary.\nThe Medical Assistant is not authorized to interpret reports or results or independently dispense medical advice to patients.\nPerforms other duties as assigned.\nLPN Qualifications:\n·        Valid LPN License from Virginia required. \n·        AHA BLS Provider CPR required at hire \n·        Experience working in a Physician Office preferred\n·        Previous experience with practice specialty preferred\n·        Must have knowledge of policies and procedures related to infection control, environmental safety and patient confidentiality.\nMA Qualifications:\n·        Must be certified Medical Assistant. In lieu of certification at hire, must have successfully completed a medical assistant training program or have two years of experience as a Medical Assistant (eq. Army Medic, Navy Corpsman) at hire.\n·        For those that have completed a medical assistant training program or have two years of experience, must obtain Medical Assistant certification within 18 months of hire.\n·        Incumbents hired before March 2021 may be considered grandfathered in terms of education. Should an incumbent obtain the Medical Assistant certification, it would be considered a requirement of their role moving forward.\n·        AHA BLS Provider CPR required at hire.\n·        Proficiency in basic clinical skills as required by specialty (i.e. phlebotomy, blood pressure, EKG, injections) required.\n·        Knowledge of policies and procedures related to infection control, environmental safety, and patient confidentiality required.\n·        Minimum of 2 years’ prior experience providing clinical support in a medical office setting preferred.\n·        Electronic Medical Records experience preferred.\nAs an EOE/AA employer, the organization will not discriminate in its employment practices due to an applicant's race, color, religion, sex, sexual orientation, gender identity, national origin, and veteran or disability status.",
        "job_location": "Fredericksburg"
    },
    {
        "company": "Mary Washington Healthcare",
        "company_url": "https://marywashingtonhealthcare.wd5.myworkdayjobs.com/Externalcareers?q=nurse",
        "job_title": "Licensed Practical Nurse (LPN), Gastroenterology-Full Time Days",
        "job_href": "https://marywashingtonhealthcare.wd5.myworkdayjobs.com/en-US/Externalcareers/job/Care-Way-Medical-Building/Licensed-Practical-Nurse--LPN---Gastroenterology-Full-Time-Days_R-21327?q=nurse",
        "job_posting_text": "locations\nCare Way Medical Building\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-21327\nStart the day excited to make a difference…end the day knowing you did.  Come join our team.\nJob Summary: \n\nThis position is responsible for LPN nursing services in a physician office practice to control patient flow for physician, obtain and document patient vitals, perform EKG strips, and other nursing duties as assigned.\nEssential Functions and Responsibilities: \nProvides general nursing care to patients to include obtaining and documenting patient vitals (height, weight, BP).\nPerforms patient triage.\nRooms patients. Facilitates patient flow throughout the office.\nAssists Physician, Physician Assistant, or Nurse Practitioner with examinations, diagnostic procedures and treatments.\nObtains patient history, chief complaint and vitals and documents in medical record.\nEnsures adequate materials and supplies are available at all times.\nProvides patient and family education as appropriate.\nResponds to and provides guidance for return calls to patients for patient treatment related phone inquiries.\nEnsures patient appointments are assigned according to risk and severity.\nMaintains/reviews patient charts, records and other pertinent documents and reports.\nEstablishes and maintains high standard for customer satisfaction and customer service.\nSchedules patient appointments for office visits.\nAssists patients with scheduling of procedures, tests, and radiological exams. Obtains authorization for procedures and studies as required.\nSchedules patient surgeries.\nEnsures necessary films are available for surgeries and appointments.\nLearns front office functions, providing backup support and coverage as required.\nFills out disability forms for MD/PA to review and sign.\nWorks with third party payors to obtain authorization/pre-certification for surgeries, diagnostic testing, and other procedures ordered by physician.\nRotates/provides coverage for clinical staffing needs in various Mary Washington Medical Group practices.\nPerforms other duties as assigned.\nQualifications:\nValid LPN License from Virginia required. \nAHA BLS Provider CPR required at hire \nExperience working in a Physician Office preferred\nPrevious experience with practice specialty preferred\nMust have knowledge of policies and procedures related to infection control, environmental safety and patient confidentiality.\nAs an EOE/AA employer, the organization will not discriminate in its employment practices due to an applicant's race, color, religion, sex, sexual orientation, gender identity, national origin, and veteran or disability status.",
        "job_location": "Care Way Medical Building"
    },
    {
        "company": "Point32Health",
        "company_url": "https://point32health.wd5.myworkdayjobs.com/THP?q=nurse",
        "job_title": "Care Manager - Nursing",
        "job_href": "https://point32health.wd5.myworkdayjobs.com/en-US/THP/job/Remote-Worker-Home-Office-MA/Care-Manager---Nursing_R8647?q=nurse",
        "job_posting_text": "locations\nRemote Worker Home Office (MA)\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR8647\nWho We Are\nPoint32Health is a leading health and wellbeing organization, delivering an ever-better personalized health care experience to everyone in our communities. At Point32Health, we are building on the quality, nonprofit heritage of our founding organizations, Tufts Health Plan and Harvard Pilgrim Health Care, where we leverage our experience and expertise to help people find their version of healthier living through a broad range of health plans and tools that make navigating health and wellbeing easier.\nWe enjoy the important work we do every day in service to our members, partners, colleagues and communities.\nJob Summary\nThe Care Manager – Nursing (RN CM) will ensure that all members receive timely care management (CM) across the continuum, including transitions of care, care coordination and navigation, complex case management, population health and wellness interventions, and disease/chronic condition management per department guidelines. The nurse care manager possesses strong clinical knowledge, critical thinking skills, and ability to facilitate a care plan which ensures quality medical care for the member. The RN CM works closely with the member, the caregiver/authorized representative, and providers to meet the targeted member-specific goals. Based on national standards for CM practice, the RN CM focuses on empowering the member to support optimal wellness and improved self-management.\nRN CM will work closely with internal and external stakeholders, having an on-site presence in Boston 1-2 days per week. Strong relationship skills and trend management experience is also required.\nJob Description \nKey Responsibilities/Duties – what you will be doing \nPerform telephonic member outreach and/or face-to-face encounter utilizing key motivational interviewing skills to facilitate program enrollment.  Perform departmental assessments and evaluate member holistically to identify needs, health goals, and barriers to wellness.  Through assessment and collaboration with member/caregiver and providers, develop a member-specific plan of care, implement member-specific care manager interventions, and revise plan of care as needed. Complete documentation in applicable platform according to departmental policy and regulatory standards. \nProvide targeted health education, proactive strategies for condition management, and communication with key providers and vendors actively involved in the member’s care.\nCollaborate with member/caregiver and the facility care team to coordinate a safe transition to the next level of care, which includes but is not limited to ensure understanding post-hospital discharge instructions, facilitate needed services and follow-up, and implement strategies to prevent re-admission.\nCollaborates and liaises with the interdisciplinary care team, to improve member outcomes (i.e., Utilization Management, Medical Director, pharmacy, community health workers, dementia care specialists, wellness, and Behavioral Health CM). Attending and presenting (as appropriate) high risk members at interdisciplinary rounds forum.\nMaintain professional growth and development through self-directed learning activities.\nQualifications – what you need to perform the job\n Certification and Licensure\nRegistered Nurse with current unrestricted license in state of residence \nMay be required to obtain other state licensure in states where Point32Health operates \nUnderstand and follow the provisions of state-specific Nurse Practice Act(s) where Point32Health operates \nNational certification in Case Management desirable\n Education \nRequired (minimum): Bachelor’s degree or relevant equivalent experience\nPreferred: Bachelor’s degree in nursing  \n Experience\nRequired (minimum): 5 years’ relevant clinical experience \nPreferred: Experience in home care or case management. \nProficiency in a second language desirable. \nExperience in specialty areas a plus.\nSkill Requirements\nSkill and proficiency in Microsoft applications, technical concepts and principles; computer software applications\nWork cooperatively as a team member across multiple levels within the organization \nSkilled in assessment, planning, and managing member care \nAdvanced communication and interpersonal skills\nIndependent and autonomous with key job functions\nAbility to address multiple complex issues\nFlexibility and adaptability to changing healthcare environment\nAbility to organize and prioritize work and member needs\nDemonstration of strong clinical and critical thinking skills\nRegard for confidential data and adherence to corporate compliance policy\nWorking Conditions and Additional Requirements (include special requirements, e.g., lifting, travel):\nMust be able to work under normal office conditions and work from remote office as required.\nWork may require simultaneous use of a telephone/headset and PC/keyboard and sitting for extended durations. \nValid Driver’s license and vehicle in good working condition as some travel may be required\nMay be required to work additional hours beyond standard work schedule.\nOther duties as assigned and needed by the department\nCOVID Policy\nPlease note:  We encourage all Point32Health colleagues to follow CDC guidance about COVID-19 vaccines, boosters, isolation, and masking. Point32Health reserves the right to adjust its requirements in response to COVID-19 trends in the communities we serve.\nDisclaimer\nThe above statements are intended to describe the general nature and level of work being performed by employees assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of employees assigned to this position. Management retains the discretion to add to or change the duties of the position at any time.\nCompensation & Total Rewards Overview\nAs part of our comprehensive total rewards program, colleagues are also eligible for variable pay. Eligibility for any bonus, commission, benefits, or any other form of compensation and benefits remains in the Company's sole discretion and may be modified at the Company’s sole discretion, consistent with the law.\nPoint32Health offers their Colleagues a competitive and comprehensive total rewards package which currently includes:\nMedical, dental and vision coverage\nRetirement plans\nPaid time off\nEmployer-paid life and disability insurance with additional buy-up coverage options\nTuition program\nWell-being benefits\nFull suite of benefits to support career development, individual & family health, and financial health\nFor more details on our total rewards programs, visit https://www.point32health.org/careers/benefits/\nCommitment to Diversity, Equity, Inclusion, Accessibility (DEIA) and Health Equity\nPoint32Health is committed to making diversity, equity, inclusion, accessibility and health equity part of everything we do—from product design to the workforce driving that innovation. Our Diversity, Equity, Inclusion, Accessibility (DEIA) and Health Equity team's strategy is deeply connected to our core values and will evolve as the changing nature of work shifts. Programming, events, and an inclusion infrastructure play a role in how we spread cultural awareness, train people leaders on engaging with their teams and provide parameters on how to recruit and retain talented and dynamic talent.  We welcome all applicants and qualified individuals, who will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\nScam Alert: Point32Health has recently become aware of job posting scams where unauthorized individuals posing as Point32Health recruiters have placed job advertisements and reached out to potential candidates. These advertisements or individuals may ask the applicant to make a payment. Point32Health would never ask an applicant to make a payment related to a job application or job offer, or to pay for workplace equipment. If you have any concerns about the legitimacy of a job posting or recruiting contact, you may contact TA_operations@point32health.org",
        "job_location": "Remote Worker Home Office (MA)"
    },
    {
        "company": "Travelers",
        "company_url": "https://travelers.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Nurse Medical Case Manager - Workers Compensation",
        "job_href": "https://travelers.wd5.myworkdayjobs.com/en-US/External/job/CA---Diamond-Bar/Nurse-Medical-Case-Manager---Workers-Compensation_R-45577?q=nurse",
        "job_posting_text": "remote type\nHybrid\nlocations\nCA - Diamond Bar\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-45577\nWho Are We?\nTaking care of our customers, our communities and each other. That’s the Travelers Promise. By honoring this commitment, we have maintained our reputation as one of the best property casualty insurers in the industry for over 160 years. Join us to discover a culture that is rooted in innovation and thrives on collaboration. Imagine loving what you do and where you do it.\nJob Category\nClaim, Nurse - Medical Case Manager\nCompensation Overview\nThe annual base salary range provided for this position is a nationwide market range and represents a broad range of salaries for this role across the country. The actual salary for this position will be determined by a number of factors, including the scope, complexity and location of the role; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. As part of our comprehensive compensation and benefits program, employees are also eligible for performance-based cash incentive awards.\nSalary Range\n$83,300.00 - $137,400.00\nTarget Openings\n1\nWhat Is the Opportunity?\nUnder moderate supervision, provide office based telephonic medical case management with emphasis on early intervention, return to work planning, coordination of quality medical care on claims involving disability and medical treatment as well as in-house medical reviews as applicable to claim handling laws and regulations.      Responsible for helping to ensure injured parties receive appropriate treatment directly related to the compensable injury or assist claim handlers in managing medical treatment to an appropriate resolution.\n\nBilingual candidates encouraged to apply.\nWhat Will You Do?\nContact customer, medical provider and injured parties on claims involving medical treatment and /or disability to coordinate appropriate medical care and return to work.\nDevelop strategies to facilitate an injured employee's return to work and achieve maximum medical improvement. Evaluate and update treatment and return to work plans within established protocols throughout the life of the claim.\nCoordinate with medical providers to ensure the injured employee is actively participating in a viable treatment plan.\nEvaluate medical treatment requests to ensure that they are reasonable and necessary based upon jurisdictional guidelines.\nEngage specialty resources as needed to achieve optimal resolution (Dial-a-doc, physician advisor, peer reviews, MCU).\nPartner with Claim Professional to provide medical information and disability status necessary to create an overall strategy to achieve an optimal outcome.\nUtilize internal Claim Platform Systems to manage all claim activities on a timely basis.\nUtilize Preferred Provider Network per jurisdictional guidelines.\nPartner with Claim Professional to provide input on medical treatment and recovery time to assist in evaluating appropriate claim reserves.\nSubmit accurate billing documentation on all activities as outlined in established guidelines.\nCustomer Engagement.\nParticipate in Telephonic and/or onsite File Reviews.\nRespond to inquiries - oral and written.\nKeep injured worker apprised of claim status.\nIn-person medical case management may be required to support Concierge locations, where a Nurse Case Manager meets with injured employees face to face following office visits at a provider's medical facility.\nIn order to perform the essential functions of this job, acquisition and maintenance of Insurance License(s) and/or certifications may be required to comply with state and Travelers requirements. Generally, License(s) are required to be obtained within three months.\nPerform other duties as assigned.\nWhat Will Our Ideal Candidate Have?\nDisability case management experience preferred.\nPrior clinical experience preferred.\nFamiliarity with URAC standards\nAnalytical Thinking: Identifies current or future problems or opportunities; analyzes, synthesizes and compares information to understand issues; identifies cause/effect relationships; and explores alternative solutions that support sound decision-making.\nCommunication: Expresses, summarizes and records thoughts clearly and concisely orally and in writing by applying proper content, format, sentence structure, grammar, language and terminology. Ability to effectively present file resolution to internal and/or external stakeholders.\nNegotiation: Intermediate ability to understand alternatives, influence stakeholders and reach a fair agreement through discussion and compromise.\nGeneral Insurance Contract Knowledge: Ability to understand policies and contracts, as they apply to policy conditions.\nPrinciples of Investigation: Intermediate investigative skills. Follows a logical sequence of inquiry with a goal of securing information about the work accident, resulting injury, anticipated treatment, job duties and any material factors that may impact recovery and return to work.\nValue Determination: Basic ability to determine liability and assigns a dollar value based on damages claimed and estimates, sets and readjusts reserves.\nLegal Knowledge: Basic knowledge, understanding and application of state, federal and regulatory laws and statutes, rules of evidence, chain of custody, trial preparation and discovery, court proceedings, and other rules and regulations applicable to the insurance industry.\nMedical knowledge: Thorough knowledge of the nature and extent of injuries, periods of disability, and treatment needed.\nWC Technical: intermediate ability to demonstrate understanding of WC Products and ability to apply available resources and technology to manage treatment plans and assist with claim resolution. Demonstrate a clear understanding and ability to work within jurisdictional parameters within their assigned state.\nCustomer Service: Advanced ability to build and maintain productive relationships with our insureds and deliver results with optimal outcomes.\nTeamwork: Advanced ability to work together in situations when actions are interdependent and a team is mutually responsible to produce a result.\nPlanning & Organizing: Advanced ability to establish a plan/course of action and contingencies for self or others to meet current or future goals.\nCertified Case Manager (CCM), Certified Disability Management Specialist (CDMS), Clinical Research Counselor (CRC), or Certified Rehab Registered Nurse (CRRN) preferred.\nWhat is a Must Have?\nRegistered Nurse; Licensed Practical Nurse or Licensed Vocational Nurse required.\nWhat Is in It for You?\nHealth Insurance: Employees and their eligible family members – including spouses, domestic partners, and children – are eligible for coverage from the first day of employment.\nRetirement: Travelers matches your 401(k) contributions dollar-for-dollar up to your first 5% of eligible pay, subject to an annual maximum. If you have student loan debt, you can enroll in the Paying it Forward Savings Program. When you make a payment toward your student loan, Travelers will make an annual contribution into your 401(k) account. You are also eligible for a Pension Plan that is 100% funded by Travelers.\nPaid Time Off: Start your career at Travelers with a minimum of 20 days Paid Time Off annually, plus nine paid company Holidays.\nWellness Program: The Travelers wellness program is comprised of tools, discounts and resources that empower you to achieve your wellness goals and caregiving needs. In addition, our mental health program provides access to free professional counseling services, health coaching and other resources to support your daily life needs.\nVolunteer Encouragement: We have a deep commitment to the communities we serve and encourage our employees to get involved. Travelers has a Matching Gift and Volunteer Rewards program that enables you to give back to the charity of your choice.\nEmployment Practices\nTravelers is an equal opportunity employer. We value the unique abilities and talents each individual brings to our organization and recognize that we benefit in numerous ways from our differences. \nIn accordance with local law, candidates seeking employment in Colorado are not required to disclose dates of attendance at or graduation from educational institutions.\nIf you are a candidate and have specific questions regarding the physical requirements of this role, please send us an email so we may assist you.\nTravelers reserves the right to fill this position at a level above or below the level included in this posting.\nTo learn more about our comprehensive benefit programs please visit http://careers.travelers.com/life-at-travelers/benefits/.",
        "job_location": "Hybrid"
    },
    {
        "company": "Travelers",
        "company_url": "https://travelers.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Clinic Nurse Medical Case Manager - Workers Compensation - San Diego",
        "job_href": "https://travelers.wd5.myworkdayjobs.com/en-US/External/job/CA---San-Diego/Clinic-Nurse-Medical-Case-Manager---Workers-Compensation---San-Diego_R-45576?q=nurse",
        "job_posting_text": "remote type\nOffice\nlocations\nCA - San Diego\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-45576\nWho Are We?\nTaking care of our customers, our communities and each other. That’s the Travelers Promise. By honoring this commitment, we have maintained our reputation as one of the best property casualty insurers in the industry for over 160 years. Join us to discover a culture that is rooted in innovation and thrives on collaboration. Imagine loving what you do and where you do it.\nJob Category\nClaim, Nurse - Medical Case Manager\nCompensation Overview\nThe annual base salary range provided for this position is a nationwide market range and represents a broad range of salaries for this role across the country. The actual salary for this position will be determined by a number of factors, including the scope, complexity and location of the role; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. As part of our comprehensive compensation and benefits program, employees are also eligible for performance-based cash incentive awards.\nSalary Range\n$83,300.00 - $137,400.00\nTarget Openings\n1\nWhat Is the Opportunity?\nUnder moderate supervision, provide office based telephonic and/or in-person medical case management supporting Concierge locations with emphasis on early intervention, return to work planning, coordination of quality medical care on claims involving disability and medical treatment as well as in-house medical reviews as applicable to claim handling laws and regulations. Responsible for helping to ensure injured parties receive appropriate treatment directly related to the compensable injury or assist claim handlers in managing medical treatment to an appropriate resolution.\n\nThis position will work fulltime out of our concierge Concentra Clinic in San Diego, CA. The clinic is located at 5575 Ruffin Road, San Diego CA 92123.  \n\nThis is a unique opportunity to have face to face time while working as a case manager.\n\nBilingual candidates encouraged to apply.\nWhat Will You Do?\nMeet with injured employees face to face following office visits at a provider's medical facility to assist with the claim process and ensure compliance with their medical treatment plan.\nContact customer, medical provider and injured parties on claims involving medical treatment and /or disability to coordinate appropriate medical care and return to work.\nDevelop strategies to facilitate an injured employee's return to work and achieve maximum medical improvement. Evaluate and update treatment and return to work plans within established protocols throughout the life of the claim.\nCoordinate with medical providers to ensure the injured employee is actively participating in a viable treatment plan.\nEvaluate medical treatment requests to ensure that they are reasonable and necessary based upon jurisdictional guidelines.\nEngage specialty resources as needed to achieve optimal resolution (Dial-a-doc, physician advisor, peer reviews, MCU).\nPartner with Claim Professional to provide medical information and disability status necessary to create an overall strategy to achieve an optimal outcome.\nUtilize internal Claim Platform Systems to manage all claim activities on a timely basis.\nUtilize Preferred Provider Network per jurisdictional guidelines.\nPartner with Claim Professional to provide input on medical treatment and recovery time to assist in evaluating appropriate claim reserves.\nSubmit accurate billing documentation on all activities as outlined in established guidelines.\nCustomer Engagement.\nParticipate in Telephonic and/or onsite File Reviews.\nRespond to inquiries - oral and written.\nKeep injured worker apprised of claim status.\nIn order to perform the essential functions of this job, acquisition and maintenance of Insurance License(s) and/or certifications may be required to comply with state and Travelers requirements. Generally, License(s) are required to be obtained within three months.\nPerform other duties as assigned.\nWhat Will Our Ideal Candidate Have?\nRN preferred.\nDisability case management experience preferred.\nPrior clinical experience preferred.\nFamiliarity with URAC standards\nAnalytical Thinking: Identifies current or future problems or opportunities; analyzes, synthesizes and compares information to understand issues; identifies cause/effect relationships; and explores alternative solutions that support sound decision-making.\nCommunication: Expresses, summarizes and records thoughts clearly and concisely orally and in writing by applying proper content, format, sentence structure, grammar, language and terminology. Ability to effectively present file resolution to internal and/or external stakeholders.\nNegotiation: Intermediate ability to understand alternatives, influence stakeholders and reach a fair agreement through discussion and compromise.\nGeneral Insurance Contract Knowledge: Ability to understand policies and contracts, as they apply to policy conditions.\nPrinciples of Investigation: Intermediate investigative skills. Follows a logical sequence of inquiry with a goal of securing information about the work accident, resulting injury, anticipated treatment, job duties and any material factors that may impact recovery and return to work.\nValue Determination: Basic ability to determine liability and assigns a dollar value based on damages claimed and estimates, sets and readjusts reserves.\nLegal Knowledge: Basic knowledge, understanding and application of state, federal and regulatory laws and statutes, rules of evidence, chain of custody, trial preparation and discovery, court proceedings, and other rules and regulations applicable to the insurance industry.\nMedical knowledge: Thorough knowledge of the nature and extent of injuries, periods of disability, and treatment needed.\nWC Technical: intermediate ability to demonstrate understanding of WC Products and ability to apply available resources and technology to manage treatment plans and assist with claim resolution. Demonstrate a clear understanding and ability to work within jurisdictional parameters within their assigned state.\nCustomer Service: Advanced ability to build and maintain productive relationships with our insureds and deliver results with optimal outcomes.\nTeamwork: Advanced ability to work together in situations when actions are interdependent and a team is mutually responsible to produce a result.\nPlanning & Organizing: Advanced ability to establish a plan/course of action and contingencies for self or others to meet current or future goals.\nCertified Case Manager (CCM), Certified Disability Management Specialist (CDMS), Clinical Research Counselor (CRC), or Certified Rehab Registered Nurse (CRRN) preferred.\nWhat is a Must Have?\nRegistered Nurse; Licensed Practical Nurse or Licensed Vocational Nurse required.\nWhat Is in It for You?\nHealth Insurance: Employees and their eligible family members – including spouses, domestic partners, and children – are eligible for coverage from the first day of employment.\nRetirement: Travelers matches your 401(k) contributions dollar-for-dollar up to your first 5% of eligible pay, subject to an annual maximum. If you have student loan debt, you can enroll in the Paying it Forward Savings Program. When you make a payment toward your student loan, Travelers will make an annual contribution into your 401(k) account. You are also eligible for a Pension Plan that is 100% funded by Travelers.\nPaid Time Off: Start your career at Travelers with a minimum of 20 days Paid Time Off annually, plus nine paid company Holidays.\nWellness Program: The Travelers wellness program is comprised of tools, discounts and resources that empower you to achieve your wellness goals and caregiving needs. In addition, our mental health program provides access to free professional counseling services, health coaching and other resources to support your daily life needs.\nVolunteer Encouragement: We have a deep commitment to the communities we serve and encourage our employees to get involved. Travelers has a Matching Gift and Volunteer Rewards program that enables you to give back to the charity of your choice.\nEmployment Practices\nTravelers is an equal opportunity employer. We value the unique abilities and talents each individual brings to our organization and recognize that we benefit in numerous ways from our differences. \nIn accordance with local law, candidates seeking employment in Colorado are not required to disclose dates of attendance at or graduation from educational institutions.\nIf you are a candidate and have specific questions regarding the physical requirements of this role, please send us an email so we may assist you.\nTravelers reserves the right to fill this position at a level above or below the level included in this posting.\nTo learn more about our comprehensive benefit programs please visit http://careers.travelers.com/life-at-travelers/benefits/.",
        "job_location": "Office"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "Jeff Temp - Care Coordinator (RN or LSW)",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Philadelphia-PA/Jeff-Temp---Care-Coordinator--RN-or-LSW-_REQ-0014326?q=nurse",
        "job_posting_text": "locations\nPhiladelphia, PA\ntime type\nVariable time\nposted on\nPosted Today\njob requisition id\nREQ-0014326\nJob Details\nJeff Temps, Jefferson's in-house temporary service, is seeking an experienced Registered Nurse or Licensed Social Worker to support Clinical Programs at Jefferson Health Plans in the Enhanced Member Supports Unit (Baby Partners, Adult Care Coordinator and Pediatric Care Coordinator).  We invite you to be a part of a select team committed to superior care.\n\nHours: Full Time, Monday - Friday, 8am - 4:30pm\nLocation:  Hybrid (Between Center City Philadelphia and Remote Work)\nJob Description\nSummary/ Objective:\nFollowing the policies and procedures of assigned Unit, this position provides comprehensive member centric care coordination also known as case management services to members identified and who are agreeable to case management services. This may include assessing member needs, determining with the member health care goals and an agreed upon schedule to achieve identified goals.\nEssential Functions:\nAble to work in a constant state of alertness and safe manner.\nAssumes primary responsibility for providing case management for identified members who are agreeable to participating in case management.  The case manager will continue case management services until the time that the member has reached agreed upon health care goals, or have opted out of case management, have lost eligibility, become lost to follow up or become decreased.\nConducts targeted outreach to members following department protocols.  This includes verifying member eligibility using appropriate systems. \nThis may include calling hospitals, provider offices, pharmacies, home care agencies to locate member’s most recent phone number. \nOutreach may include telephonic, virtual and face to face in the community with member’s approval.\nAssist primary care provider office(s) in coordinating care of members with complex medical needs; utilizing appropriate assessments in software.\nCoordinating care for members that is member focused, taking into account the members barriers to care and their personal goals.\nCoordinate with discharge planners for members who are require transition to alternative levels of care. Care Coordinators who assist members residing in pediatric congregate care facilities should have experience in discharge planning. \nDocuments in software that includes capturing the member’s barriers to care, priority goals, plans of care and schedule for follow up.\nApplies knowledge of pathophysiology, psychosocial issues, confidentiality, ethical/legal issues, and therapeutic interventions and sources to assist the membership with problem-solving/decision-making that promotes health, improves level of functioning, and decreases inappropriate use of services. \nResearching and coordinating care with available community resources.\nResearching and coordinating care with member’s behavioral health provider.\nInforming members about their plan benefits.\nEducates members on their specific health care needs and care options, including palliative care, as appropriate.\nFacilitates accommodations for members with language, communication, visual or mobility limitations.\nProvides approved educational materials that supports goals and interventions.\nPerform literature searches and follow up to date clinical guidelines in coordinating member care and services.\nActively seek guidance from assigned Medical Director or designee as appropriate.\nKeep current on existing programs within the community as well as the needs of the population.\nBalances the dual roles of advocacy for the member and stewardship of fiscal resources by assisting the member to identify and utilize all available resources.\nThis may include providing the member with steps in filing a member complaint or grievance.\nSupport the mission of the Plan.\nOther duties as assigned.\nCollaboration:\nActively participate in multidisciplinary and interdepartmental team meetings, OCYI regional offices as applicable to represent care coordination program; Meetings include, but not limited to, Medical Director Rounds and BH Collaborative Meeting.\nCollaborate with behavioral health MCOs and the member to develop, assist with implementation of, and follow up on interdisciplinary care plans (ICP) for members with serious, persistent mental illness (SPMI).\nWork collaboratively within the Health Care Management department on tasks as needed which may include QM, UM, and Pharmacy.\nCoordinate and collaborate care with external as well as internal Plan resources to meet the individual needs of the member identified by the assessment and subsequent outreach.\nReporting:\nDocument in the appropriate software following Unit’s protocol all actions following the training and policies and procedures.\nRecommend through appropriate channels methods of efficiencies that others may benefit from.\nEscalate issues/concerns following the direction of Team Lead and Manager.\nWork Shift\nWorkday Day (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n1101 Market, Philadelphia, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Philadelphia, PA"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "FT Nights RN Abington Med Surg 3B",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Montgomery-County-PA/FT-Nights-RN-Abington-Med-Surg-3B_REQ-0009951-1?q=nurse",
        "job_posting_text": "locations\nMontgomery County, PA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0009951\nJob Details\nFT Nights RN Abington Med Surg 3B\nJob Description\nFT Nights RN Abington Med Surg 3B\nWork Shift\nWorkday Night (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n1200 Old York Road, Abington, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Montgomery County, PA"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "RN - Forensic Safe Center - PRN - Jefferson Abington",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Montgomery-County-PA/RN---Forensic-Safe-Center---PRN---Jefferson-Abington_REQ-0008384-1?q=nurse",
        "job_posting_text": "locations\nMontgomery County, PA\ntime type\nVariable time\nposted on\nPosted Today\njob requisition id\nREQ-0008384\nJob Details\nJefferson Abington hospital is hiring a per diem, RN!\nJob Description\nJoin the mission of Improving Lives as a Staff Nurse at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done. \n Staff Nurses are responsible for the following: \n Performs patient procedures within the nursing scope of practice. \nPractices safe medication administration and assesses patient responses to medication. \nParticipates in reviewing and/or implementing clinical pathways and care coordination. \n The Staff Nurse will provide professional nursing care to a group of patients within a specified time period and complete all required documentation. \n Qualifications for this position include: \n BSN Degree preferred, ASN required\nState Issued RN license required\nBasic Life Support (BLS) certification from the American Heart Association required\nWork Shift\nRotating (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n1200 Old York Road, Abington, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Montgomery County, PA"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "Patient Care Tech - Emergency Room (Per Diem, Days) Torresdale-Jefferson",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Northeast-Philadelphia-PA/Patient-Care-Tech---Emergency-Room--Per-Diem--Days--Torresdale-Jefferson_REQ-0013359-1?q=nurse",
        "job_posting_text": "locations\nNortheast Philadelphia, PA\ntime type\nVariable time\nposted on\nPosted Today\njob requisition id\nREQ-0013359\nJob Details\nJoin the mission of Improving Lives as a Patient Care Tech at Jefferson Health. With more than 42,000 employees, were the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done.\n\n\nPatient Care Tech are responsible for the following: \n\n- Performs assigned nursing procedures for the comfort and well-being of the patient.\n\n- Maintains appropriate documentation on all assigned patients, including flow sheets.\n\n- Assists physicians with examinations and tests as needed.\n\n\nReporting to the Nurse Manager, Patient Care Tech will provide direct bedside care to patients. Other tasks include respiratory services, rehabilitation services, and phlebotomy\nJob Description\nHigh School Diploma or equivalent required\nBasic Life Support (BLS) certification required  \nOne (1) year experience in an acute care in-patient environment highly preferred\nPatient Care Tech/Nursing Assistant certification preferred  \nShift/Hours: Per Diem, Days - minimum of 36 hours per every 6 weeks\nThis position is located at Jefferson, Torresdale\nBenefits include, but are not limited to: \nComprehensive Medical, Dental, & Vision Plans \nRetirement Plans \nTuition Reimbursement \nHealth Coaching, Commuter Discounts, Day Care Services, etc. \nWork Shift\nWorkday Day (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n10800 Knights Road, Philadelphia, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Northeast Philadelphia, PA"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "RN - OR - Full Time Days - Jefferson Einstein Montgomery",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Montgomery-County-PA/RN---OR---Full-Time-Days---Jefferson-Einstein-Montgomery_REQ-0013300-1?q=nurse",
        "job_posting_text": "locations\nMontgomery County, PA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0013300\nJob Details\nRN - OR - Full Time Days - Jefferson Einstein Montgomery\nJob Description\nRN - OR - Full Time Days - Jefferson Einstein Montgomery\nJoin the mission of Improving Lives as a Staff Nurse at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done. \nStaff Nurses are responsible for the following: \nPerforms patient procedures within the nursing scope of practice. \nPractices safe medication administration and assesses patient responses to medication. \nParticipates in reviewing and/or implementing clinical pathways and care coordination. \nThe Staff Nurse will provide professional nursing care to a group of patients within a specified time period and complete all required documentation. \nQualifications for this position include: \nBSN Degree preferred \nState Issued RN license \nBasic Life Support (BLS) certification from the American Heart Association  \n\n Work Shift\nWorkday Day (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n559 W. Germantown Pike, East Norriton, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Montgomery County, PA"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "Patient Care Technician II",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Philadelphia-PA/Patient-Care-Technician-II_REQ-0011551-2?q=nurse",
        "job_posting_text": "locations\nPhiladelphia, PA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0011551\nJob Details\nAbout Jefferson\nJoin the mission of Improving Lives as a Patient Care Tech II at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. Our work to improve lives is never done.\n\nAbout Our Unit\nThis unit is located at Thomas Jefferson University Campus.\n\nAwards & Recognition\nJefferson Einstein Hospital is Magnet Recognized. Jefferson is also recognized as the 2nd Best Hospital in the Philadelphia Metro area and the 3rd Best Hospital in Pennsylvania\n\nSchedule Commitment\nSchedules are available 6 weeks in advance.\nJob Description\nResponsibilities\n Reporting to the Nurse Manager, Patient Care Tech IIs will provide direct bedside care to patients:\n    Performs assigned nursing procedures for the comfort and well-being of the patient\n    Maintains appropriate documentation on all assigned patients, including flow sheets\n    Maintains advanced knowledge and experience with phlebotomy and lab specimen collection including T&S, Blood Cultures\n    Assists physicians with examinations and tests as needed\n    Other tasks include respiratory services, and rehabilitation services\nQualifications\nTo qualify as Patient Care Tech II, you must meet the following requirements for consideration:\n    High School Diploma or equivalent required\n    One of the following is required: PCT or related certification, Certified nursing assistant (CNA), EMT\n    Minimum of 2 years nursing assistant, PCT or healthcare experience required. Certification and completion of advanced skills and knowledge training within six months of hire accepted in lieu of experience requirement\n    AHA BLS required\nTotal Rewards\nAs a valued member of the team, you will be eligible to receive our total rewards package which includes:\n    Comprehensive Medical, Dental, & Vision Plans\n    Retirement Plans\n    Tuition Reimbursement\n    Voluntary benefits\n   Health Coaching, Commuter Discounts, Day Care Services, etc.\n Work Shift\nRotating (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n111 S 11th Street, Philadelphia, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Philadelphia, PA"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "TJH FT PACU Registered Nurse",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Philadelphia-PA/TJH-FT-PACU-Registered-Nurse_REQ-0008287-1?q=nurse",
        "job_posting_text": "locations\nPhiladelphia, PA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0008287\nJob Details\nTJH FT PACU RN.\nJob Description\nJoin the mission of Improving Lives as a Staff Nurse at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done.\nStaff Nurses are responsible for the following:\nPerforms patient procedures within the nursing scope of practice.\nPractices safe medication administration and assesses patient responses to medication.\nParticipates in reviewing and/or implementing clinical pathways and care coordination.\nThe Staff Nurse will provide professional nursing care to a group of patients within a specified time period and complete all required documentation.\nQualifications for this position include:\nBSN Degree preferred\nState Issued RN license\nBasic Life Support (BLS) certification from the American Heart Association\nBenefits include, but are not limited to:\nComprehensive Medical, Dental, & Vision Plans\nRetirement Plans\nTuition Reimbursement\nHealth Coaching, Commuter Discounts, Day Care Services, etc.\nWork Shift\nRotating (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n111 S 11th Street, Philadelphia, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Philadelphia, PA"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "Registered Nurse - 2A HRT (Telemetry) - Full Time, Rotating - Jefferson Torresdale",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Northeast-Philadelphia-PA/Registered-Nurse---2A-HRT--Telemetry----Full-Time--Rotating---Jefferson-Torresdale_REQ-0007564-1?q=nurse",
        "job_posting_text": "locations\nNortheast Philadelphia, PA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0007564\nJob Details\nJoin the mission of Improving Lives as a Staff Nurse at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done.\nJob Description\nStaff Nurses are responsible for the following: \n Performs patient procedures within the nursing scope of practice. \nPractices safe medication administration and assesses patient responses to medication. \nParticipates in reviewing and/or implementing clinical pathways and care coordination. \n The Staff Nurse will provide professional nursing care to a group of patients within a specified time period and complete all required documentation\nWork Shift\nRotating (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n10700 Knights Road, Philadelphia, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Northeast Philadelphia, PA"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "Patient Care Tech - Telemetry Unit - PRN - Day - Jefferson Abington",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Montgomery-County-PA/Patient-Care-Tech---Telemetry-Unit---PRN---Day---Jefferson-Abington_REQ-0011363-1?q=nurse",
        "job_posting_text": "locations\nMontgomery County, PA\ntime type\nVariable time\nposted on\nPosted Today\njob requisition id\nREQ-0011363\nJob Details\nJefferson Abington is hiring a per diem, day, PCT! Every other weekend shift from 7AM - 3:30PM with rotational holidays.\nJob Description\nJoin the mission of Improving Lives as a Patient Care Tech at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done. \n Patient Care Tech are responsible for the following:  \n  Performs assigned nursing procedures for the comfort and well-being of the patient.  \nMaintains appropriate documentation on all assigned patients, including flow sheets.  \nAssists physicians with examinations and tests as needed.  \n  Reporting to the Nurse Manager, Patient Care Tech will provide direct bedside care to patients. Other tasks include respiratory services, rehabilitation services, and phlebotomy. Qualifications for this position include:  \n  High School Diploma  \nCPR-BLS through the American Heart Association   \nOne (1) year experience in an acute care inpatient environment preferred  \nPatient Care Tech/Nursing Assistant certification preferred   \nWork Shift\nWorkday Day (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n1200 Old York Road, Abington, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Montgomery County, PA"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "Registered Nurse - Med Surg/Tele 4W - Full Time, Night - Jefferson Frankford",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Northeast-Philadelphia-PA/Registered-Nurse---Med-Surg-Tele-4W---Full-Time--Night---Jefferson-Frankford_REQ-0013734-1?q=nurse",
        "job_posting_text": "locations\nNortheast Philadelphia, PA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0013734\nJob Details\nJoin the mission of Improving Lives as a Staff Nurse at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done.\nJob Description\nStaff Nurses are responsible for the following: \n Performs patient procedures within the nursing scope of practice. \nPractices safe medication administration and assesses patient responses to medication. \nParticipates in reviewing and/or implementing clinical pathways and care coordination. \n The Staff Nurse will provide professional nursing care to a group of patients within a specified time period and complete all required documentation. \n Work Shift\nWorkday Night (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n4900 Frankford Avenue, Philadelphia, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Northeast Philadelphia, PA"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "Vice President and Campus Chief Nursing Officer - Thomas Jefferson University Hospital - Philadelphia, PA",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Gibbon-Building/Vice-President-and-Campus-Chief-Nursing-Officer---Thomas-Jefferson-University-Hospital---Philadelphia--PA_JR_9303587-1?q=nurse",
        "job_posting_text": "locations\nGibbon Building\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nJR_9303587\nJob Details\nJefferson Health, Thomas Jefferson University Hospitals is seeking a highly experienced, quality focused leader, with strong operational and business acumen to serve as Vice President and Chief Nursing Officer (VP/CNO).  Thomas Jefferson University Hospitals spans 2 hospital campuses in Center City Philadelphia and South Philadelphia and includes three main hospital buildings: Thomas Jefferson University Hospital, Jefferson Hospital for Neuroscience, and Methodist Hospital.  Combined the three hospital locations have over 880 licensed beds and 65 ORs.  Thomas Jefferson University Hospital is a Magnet designated academic medical center with a Level I Trauma Center and Level III NICU.  \nJob Description\nThe Jefferson University Hospitals campus Vice President/Chief Nursing Officer (VP/CNO) CNO is an experienced, quality focused, contemporary nursing leader. The VP/CNO will build and lead a strong nursing leadership team committed to the highest standards of nursing practice and quality patient care. This ANCC Magnet organization enjoys high levels of staff engagement and strong inter-professional collaboration with physicians and other disciplines. \nThe Vice President/Chief Nursing Officer (VP/CNO) reports directly to the Regional Chief Nursing Officer for the Central Region of Jefferson Health. The Regional CNO provides the vision and strategic leadership for nursing across the Central Region of the Jefferson Health System.  The VP/CNO realizes that vision by providing strategic leadership and direction for nursing at TJUH, Methodist, JHN including ambulatory nursing. \nAs a member of the TJUH Inc. senior leadership team, the VP/CNO participates in the integrated financial and strategic planning process, development of the hospital’s operating plan focused on quality and safety, patient and family experience, people, growth, finance and operations, and execution of tactics to achieve desired outcomes.  The VP/CNO as one of the senior clinical executives, in partnership with the Chief Operating Officer (COO), Chief Medical Officer (CMO) and Chief Quality Officer (CQO) with responsibility for quality and safety, financial stewardship, technology management, ethics, teaching, and research. She/he ensures the delivery of highly reliable nursing care and patient and family centered care, which is reflective in nursing policy and decision-making. In collaboration with the CQO, the VP/CNO is responsible for building and sustaining a culture of accountability and assuring that nursing practices are based on tenets of patient and family centered care and high reliability throughout nursing and the broader organization.  \nThe VP/CNO ensures the development, implementation, and evaluation of nursing policies, programs and services that are evidence–based and consistent with professional standards and practice at Jefferson Health. She/he serves as a catalyst and role model providing innovative leadership and direction that supports the mission and divisional goals of TJUH, Inc. \nKey Duties  \n·       Ensures the organizational values, goals, and objectives are transformed into daily operations resulting in an excellent quality, efficient, effective, caring, and respectful environment. \n·       Work collaboratively with the medical staff, nursing leadership, and clinical/ financial/operational leaders to deliver cost effective, high quality clinical services and outcomes in partnership with affiliate organizations and providers that optimize the delivery of patient care. \n·       Build and sustain a culture of accountability and ensure that nursing practices are based on tenets of patient and family centered care and high reliability throughout nursing and the broader organization. \n·       Identify strategies for improving the quality of patient care/patient outcomes and operational efficiency within TJUH hospitals.  \n·       Meet all standards of the Patient Satisfaction Initiative Criteria to make TJUH hospitals the sites of choice for Patients and Employees. \n·       Serve as a voice for clinical care nurses and empowering them to reach new heights of clinical excellence and identify new opportunities for staff development and continuing education. \n·       Oversee recruitment, retention, training, and daily staffing dynamics to ensure team engagement and operational/procedural alignment with Jefferson Health mission, values and goals. \n·       Ensure a collaborative partnership in communication and relationship building competencies through strategic planning activities, commitment to shared decision-making, medical staff relationships, diversity, equity and inclusion, relationship management and community involvement. \n·       Utilizes business acumen, inclusive of healthcare financing, human resource management including professional development, strategic management, marketing and information management, and technology development to effectively oversee nursing operations.\n·       Provide leadership and guidance in acquiring and maintaining accreditations. \n·       Prepares and manages according to fiscal year budget plans, ensuring that the budget planning process correctly identifies operational needs and assures that the nursing leadership team operates within the approved fiscal year budget.  \n·       Ensure the development, implementation, and evaluation of nursing policies, programs and services that are evidence–based and consistent with professional standards and practice. \n·       Emulate personal and professional accountability ethics, evidence based clinical and management practice including advocacy for the clinical enterprise and professional nursing practice, including the Jefferson College of Nursing\nQUALIFICATIONS: \n·       Doctoral preparation is strongly preferred. A Bachelor’s and Master’s degree required, one of which must be in Nursing. \n·       An advanced level of knowledge acquired through completion of formal and continuing education in Nursing, health policy, regulatory compliance, process redesign and management are essential. \n·       Extensive clinical nursing and management experience with a minimum of seven (7) years in senior nursing leadership roles is required.  Prior CNO experience preferred.  ACNO experience will be considered for internal candidates. \n·       Significant experience developing and executing nursing strategy and operations in a complex acute care organization. \n·       Nursing leadership experience in an academic medical center or complex healthcare organization is required, preferably in a healthcare system. \n·       Knowledge and experience in ANCC Magnet standards / designation is required, as well as prior experience in a Magnet facility. \n·       Knowledge of nursing staffing methods, retention, recruitment, and finance. Proven strategic-thinking, problem-solving and analytical skills.  \nWork Shift\nWorkday Day (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n111 S 11th Street, Philadelphia, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Gibbon Building"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "Patient Care Tech",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Montgomery-County-PA/Patient-Care-Tech_REQ-0012803-2?q=nurse",
        "job_posting_text": "locations\nMontgomery County, PA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0012803\nJob Details\nPatient Care Technician- Full Time, Nights 36 hours per week. \n4B- Psychiatric unit. \nBehavioral Health experience preferred\n\nJoin the mission of Improving Lives as a Patient Care Tech at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done.\nJob Description\nPerforms assigned nursing procedures for the comfort and well-being of the patient.  \nMaintains appropriate documentation on all assigned patients, including flow sheets.  \nAssists physicians with examinations and tests as needed.  \n  Reporting to the Nurse Manager, Patient Care Tech will provide direct bedside care to patients. Other tasks include respiratory services, rehabilitation services, and phlebotomy. Qualifications for this position include:  \n  High School Diploma  \nCPR-BLS through the American Heart Association   \nOne (1) year experience in an acute care inpatient environment preferred  \nPatient Care Tech/Nursing Assistant certification preferred   \n  Benefits include, but are not limited to:  \n  Comprehensive Medical, Dental, & Vision Plans  \nRetirement Plans  \nTuition Reimbursement  \nHealth Coaching, Commuter Discounts, Day Care Services, etc.  \nWork Shift\nWorkday Night (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n1200 Old York Road, Abington, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Montgomery County, PA"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "PCT Per Diem - Evenings Oncology",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Montgomery-County-PA/PCT-Per-Diem---Evenings-Oncology_REQ-0013620-1?q=nurse",
        "job_posting_text": "locations\nMontgomery County, PA\ntime type\nVariable time\nposted on\nPosted Today\njob requisition id\nREQ-0013620\nJob Details\nFull Time, Evening hours on Oncology unit \n3:00pm- 11:30pm \nRequired to work every third weekend \n\nJoin the mission of Improving Lives as a Patient Care Tech at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done.\nJob Description\nPatient Care Tech are responsible for the following:  \n  Performs assigned nursing procedures for the comfort and well-being of the patient.  \nMaintains appropriate documentation on all assigned patients, including flow sheets.  \nAssists physicians with examinations and tests as needed.  \n  Reporting to the Nurse Manager, Patient Care Tech will provide direct bedside care to patients. Other tasks include respiratory services, rehabilitation services, and phlebotomy. Qualifications for this position include:  \n  High School Diploma  \nCPR-BLS through the American Heart Association   \nOne (1) year experience in an acute care inpatient environment preferred  \nPatient Care Tech/Nursing Assistant certification preferred   \n  Benefits include, but are not limited to:  \n  Comprehensive Medical, Dental, & Vision Plans  \nRetirement Plans  \nTuition Reimbursement  \nHealth Coaching, Commuter Discounts, Day Care Services, etc.  \nWork Shift\nWorkday Evening (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n1200 Old York Road, Abington, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Montgomery County, PA"
    },
    {
        "company": "University of Rochester Medical Center",
        "company_url": "https://rochester.wd5.myworkdayjobs.com/UR_Nursing?q=nurse",
        "job_title": "OB/GYN GOG – Nurse Practitioner/Physician Assistant/Certified Nurse Midwife",
        "job_href": "https://rochester.wd5.myworkdayjobs.com/en-US/UR_Nursing/job/Strong-Memorial-Hospital/OB-GYN-GOG---Nurse-Practitioner-Physician-Assistant-Certified-Nurse-Midwife_R263056?q=nurse",
        "job_posting_text": "locations\nStrong Memorial Hospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR263056\nAs a community, the University of Rochester is defined by a deep commitment to Meliora - Ever Better. Embedded in that ideal are the values we share: equity, leadership, integrity, openness, respect, and accountability. Together, we will set the highest standards for how we treat each other to ensure our community is welcoming to all and is a place where all can thrive.\nJob Location (Full Address):\n601 Elmwood Ave, Rochester, New York, United States of America, 14642\nOpening:\nWorker Subtype:\nRegular\nTime Type:\nFull time\nScheduled Weekly Hours:\n40\nDepartment:\n500604 OB-Gyn APP\nWork Shift:\nUR - Day (United States of America)\nRange:\nUR URCB 218\nCompensation Range:\n$93,927.00 - $140,901.00\nThe referenced pay range represents the minimum and maximum compensation for this job. Individual annual salaries/hourly rates will be set within the job's compensation range, and will be determined by considering factors including, but not limited to, market data, education, experience, qualifications, expertise of the individual, and internal equity considerations.\nResponsibilities:\nAPP Position.\nFull-time  Days (occasionally evenings) \nExciting opportunity for an advanced practice provider to join the health care team at the Gender Wellness Obstetrics and Gynecology office. The Gender Wellness OBGYN office is a UR safety net practice, with embedded services including Behavioral Health, Social Work, and Financial Case Management in conjunction with multiple clinical resources including on-site ultrasound, family planning, high-risk obstetrics, transgender care, and menopause care services.  The APP as part of the multidisciplinary team provides direct patient care and management, in-basket management, follow-up and education for patients. Candidates must have excellent communication skills, self-motivation for on-going learning, flexibility, interest in quality improvement, and teamwork experience. Provider and OBGYN experience is highly desired. Day shift, with evening clinic coverage. Candidates must be NYS NP, PA or CNM licensed/license eligible, and eligible for certification. \n Nurse Practitioner\nRequire a Master's degree as a Nurse Practitioner, an active New York State Registered Nurse license in good standing, an active New York State Nurse Practitioner licensure in good standing and current national certification as an Nurse Practitioner. \nPhysician Assistant\nRequired completion of an ARC-PA approved Physician Assistant program, an active New York State Physician Assistant licensure in good standing and current national certification as a Physician Assistant by NCCPA (National Commission on Certification of Physician Assistants)\nNPs and PAs will demonstrate clinical competence, superior verbal and written communication skills, interpersonal effectiveness and customer relation skills, computer competence and must have an active desire to learn. The APP will participate in the education of learners (students and new employees), using clinical learning experiences, knowledge sharing and skill training. \n\nEOE Minorities/Females/Protected Veterans/Disabled\n The University of Rochester is committed to fostering, cultivating, and preserving an inclusive and welcoming culture to advance the University’s Mission to Learn, Discover, Heal, Create – and Make the World Ever Better. In support of our values and those of our society, the University is committed to not discriminating on the basis of age, color, disability, ethnicity, gender identity or expression, genetic information, marital status, military/veteran status, national origin, race, religion, creed, sex, sexual orientation, citizenship status, or any other characteristic protected by federal, state, or local law (Protected Characteristics). This commitment extends to non-discrimination in the administration of our policies, admissions, employment, access, and recruitment of candidates, for all persons consistent with our values and based on applicable law.",
        "job_location": "Strong Memorial Hospital"
    },
    {
        "company": "Methodist Le Bonheur Healthcare",
        "company_url": "https://methodisthealth.wd5.myworkdayjobs.com/MLH?q=nurse",
        "job_title": "Flight Nurse (RN) - Critical Care Transport - Memphis Pedi-Flite Team",
        "job_href": "https://methodisthealth.wd5.myworkdayjobs.com/en-US/MLH/job/Le-Bonheur---Security-and-Garage/Flight-Nurse--RN----Critical-Care-Transport---Memphis-Pedi-Flite-Team_R-11135?q=nurse",
        "job_posting_text": "remote type\nOn Campus\nlocations\nLe Bonheur - Security and Garage\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-11135\nIf you are looking to make an impact on a meaningful scale, come join us as we embrace the Power of One!\n We strive to be an employer of choice and establish a reputation for being a talent rich organization where Associates can grow their career caring for others. For over a century, we’ve served the health care needs of the people of Memphis and the Mid-South.\n Are you a skilled pediatric nursing professional with a passion for pediatric critical care? Our Pedi-Flite Team is dedicated to transporting critically ill pediatric patients within a 400-mile radius using three modes of transportation: ambulance, fixed wing, and helicopter.  Our team is composed of pediatric and neonatal critical care nurses, respiratory therapists, and EMTs, all committed to providing the highest level of care during transport. This is a unique opportunity to be part of a dynamic and specialized team, making a significant impact on the lives of young patients and their families.\n\n Working at MLH means carrying the mission forward of caring for our community and impacting the lives of patients in every way through compassion, a deliberate focus on service expectations and a consistent thriving for excellence.\n\nA Brief Overview\nResponsible for the nursing care of patients requiring specialized judgment and skill. This judgment and skill is based on knowledge of the natural, behavioral and nursing sciences and humanities as the basis for application of the nursing process in wellness and illness care. Models appropriate behavior as exemplified in MLH Mission, Vision and Values. \n\nWhat you will do\nProvides nursing care from the initial contact until patient care is relinquished to the accepting medical facility; maintains thorough patient care documentation.\nPractices nursing within his/her scope of practice as defined by the states regulating each base.\nKnowledgeable in use and routine maintenance of all equipment and supplies used by Pedi-Flite. Responsible for reporting medical equipment failures and taking initial steps to insure repair of equipment as directed. Maintains adequate supplies onboard aircraft and ambulance to deliver patient care. Keeps aircraft clean and orderly to insure rapid response to all transport requests.\nMaintains positive interpersonal relationships with colleagues, EMS representatives, hospitals and the public.\nFunctions as a medical flight member preforming required briefs, documentation etc.\nPerforms advanced skills and procedures as approved by Pedi-Flite Medical Director(s) which includes ETT tube placement, Ventilators, Nitric administration, etc.\nServes as a role model, educator and clinical resource.\nParticipates regularly in Pedi-Flite activities, meetings, education, projects and committees.\nPerforms other duties as assigned or requested\n\nEducation/Formal Training Requirements\nAssociate's Degree Nursing- RN \nBachelor's Degree Nursing- RN \n\nWork Experience Requirements\n3-5 years Critical Care \n3-5 years Pediatric and neonatal critical care \n\nLicenses and Certifications Requirements\nBASIC LIFE SUPPORT - American Heart Association  \nRegistered Nurse Tennessee - Tennessee Board of Nursing  \nRegistered Nurse Arkansas - Arkansas State Board of Nursing  \nRegistered Nurse Mississippi - Mississippi Board of Nursing  \n\nKnowledge, Skills and Abilities\nAnalytical skills necessary to assess complex patient conditions effectively and to develop comprehensive plans of care.\nSynthesizes multiple sources of information to assist in the resolution of human responses to complex problems.\nSkill and proficiency in applying highly technical principles, concepts and techniques, which are central to the nursing profession.\nOther certifications may be required depending on assigned nursing unit\n\nSupervision Provided by this Position\nThe Registered Nurse directs and delegates all patient care activities on nursing units\n\nPhysical Demands\nThe physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion. \nMust have good balance and coordination. \nThe physical requirements of this position are: medium work - exerting up to 50 lbs. of force occasionally and/or up to 25 lbs. of force frequently. \nThe Associate is required to have close visual acuity including color, depth perception, and field of vision to perform an activity, such as assessing patients, preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading. \nFrequent invasive and non-invasive patient contact. \nExposure to patient body fluids as well as exposure to hazardous or poisonous materials. \nAbility to react quickly to emergency situations \n\nOur Associates are passionate about what they do, the service they provide and the patients they serve.  We value family, team and a Power of One culture that requires commitment to the highest standards of care and unity.\n\nBoasting one of the South's largest medical centers, Memphis blends a friendly community, a thriving and growing downtown, and a low cost of living. We see each day as a new opportunity to make a difference in the lives of the people in our community.",
        "job_location": "Le Bonheur - Security and Garage"
    },
    {
        "company": "Methodist Le Bonheur Healthcare",
        "company_url": "https://methodisthealth.wd5.myworkdayjobs.com/MLH?q=nurse",
        "job_title": "MLH Olive Branch RN ED - FT36 7p-7a",
        "job_href": "https://methodisthealth.wd5.myworkdayjobs.com/en-US/MLH/job/Methodist-Olive-Branch-Hospital/MLH-Olive-Branch-RN-ED---FT36-7p-7a_R-11098?q=nurse",
        "job_posting_text": "remote type\nOn Campus\nlocations\nMethodist Olive Branch Hospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-11098\nIf you are looking to make an impact on a meaningful scale, come join us as we embrace the Power of One!\n We strive to be an employer of choice and establish a reputation for being a talent rich organization where Associates can grow their career caring for others. For over a century, we’ve served the health care needs of the people of Memphis and the Mid-South.\n Responsible for delivering and coordinating nursing care for patients within a multidisciplinary team, utilizing the nursing process to ensure comprehensive, high-quality care. Provides compassionate, patient-centered care while supporting patients and families through emotional challenges and crises. Prioritizes patient safety and strives for optimal care outcomes through evidence-based practice. Educates and advocates for both patients and their families, empowering them with the knowledge and resources needed for treatment and self-care. Demonstrates professionalism and upholds the MLH Mission, Vision, and Values, serving as a role model for excellence in nursing practice.\n\n Working at MLH means carrying the mission forward of caring for our community and impacting the lives of patients in every way through compassion, a deliberate focus on service expectations and a consistent thriving for excellence.\n\nA Brief Overview\nResponsible for delivering and coordinating nursing care for patients within a multidisciplinary team, utilizing the nursing process to ensure comprehensive, high-quality care. Provides compassionate, patient-centered care while supporting patients and families through emotional challenges and crises. Prioritizes patient safety and strives for optimal care outcomes through evidence-based practice. Educates and advocates for both patients and their families, empowering them with the knowledge and resources needed for treatment and self-care. Demonstrates professionalism and upholds the MLH Mission, Vision, and Values, serving as a role model for excellence in nursing practice.\n\nWhat you will do\nConducts comprehensive nursing assessments to determine appropriate interventions and develop individualized care plans.\nProvides patient and family education on care plans, medications, and self-care strategies.\nDevelops, implements, and adjusts personalized patient care plans based on ongoing clinical assessments.\nAdministers medications safely, following best practices in medication management.\nCollaborates with interdisciplinary teams to ensure coordinated, high-quality patient care.\n\nEducation Qualifications\nPost-Graduate Certificate or Diploma Nursing - RN\nPreferred: Bachelor's Degree Nursing - RN\nExperience Qualifications\nMinimum of 6 months RN experience\nPreferred: Greater than 1 year experience in similar clinical setting\nSkills and Abilities\nComprehensive understanding of patient care, including the ability to conduct thorough assessments using the nursing process.\nStrong knowledge of the Nurse Practice Act and the scope of practice for a Registered Nurse.\nAbility to process complex clinical information using critical thinking to develop, implement, and support individualized care plans.\nAbility to effectively delegate tasks to team members, ensuring a collaborative, team-based approach to delivering high-quality patient care.\nFamiliarity with healthcare technology that enhances patient safety and care efficiency (e.g., bar code scanning, electronic health records).\nLicenses and Certifications\nBASIC LIFE SUPPORT - American Heart Association\nRegistered Nurse Tennessee - Tennessee Board of Nursing\nPreferred: Certification in clinical specialty\nSupervision Provided by this Position\nThe Registered Nurse directs and delegates all patient care activities on nursing units.\nPhysical Demands\nThe physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion.\nMust have good balance and coordination.\nThe physical requirements of this position are: medium work - exerting up to 50 lbs. of force occasionally and/or up to 25 lbs. of force frequently.\nThe Associate is required to have close visual acuity including color, depth perception, and field of vision to perform an activity, such as assessing patients, preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading.\nFrequent invasive and non-invasive patient contact.\nExposure to patient body fluids as well as exposure to hazardous or poisonous materials.\nAbility to react quickly to emergency situations.\nOur Associates are passionate about what they do, the service they provide and the patients they serve. We value family, team and a Power of One culture that requires commitment to the highest standards of care and unity.\n\nBoasting one of the South's largest medical centers, Memphis blends a friendly community, a thriving and growing downtown, and a low cost of living. We see each day as a new opportunity to make a difference in the lives of the people in our community.",
        "job_location": "Methodist Olive Branch Hospital"
    },
    {
        "company": "Methodist Le Bonheur Healthcare",
        "company_url": "https://methodisthealth.wd5.myworkdayjobs.com/MLH?q=nurse",
        "job_title": "RN FT32 5p-1a",
        "job_href": "https://methodisthealth.wd5.myworkdayjobs.com/en-US/MLH/job/Methodist-Olive-Branch-Hospital/RN-FT32-5p-1a_R-9593?q=nurse",
        "job_posting_text": "remote type\nOn Campus\nlocations\nMethodist Olive Branch Hospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-9593\nIf you are looking to make an impact on a meaningful scale, come join us as we embrace the Power of One!\n We strive to be an employer of choice and establish a reputation for being a talent rich organization where Associates can grow their career caring for others. For over a century, we’ve served the health care needs of the people of Memphis and the Mid-South.\n Responsible for delivering and coordinating nursing care for patients within a multidisciplinary team, utilizing the nursing process to ensure comprehensive, high-quality care. Provides compassionate, patient-centered care while supporting patients and families through emotional challenges and crises. Prioritizes patient safety and strives for optimal care outcomes through evidence-based practice. Educates and advocates for both patients and their families, empowering them with the knowledge and resources needed for treatment and self-care. Demonstrates professionalism and upholds the MLH Mission, Vision, and Values, serving as a role model for excellence in nursing practice.\n\n Working at MLH means carrying the mission forward of caring for our community and impacting the lives of patients in every way through compassion, a deliberate focus on service expectations and a consistent thriving for excellence.\n\nA Brief Overview\nResponsible for delivering and coordinating nursing care for patients within a multidisciplinary team, utilizing the nursing process to ensure comprehensive, high-quality care. Provides compassionate, patient-centered care while supporting patients and families through emotional challenges and crises. Prioritizes patient safety and strives for optimal care outcomes through evidence-based practice. Educates and advocates for both patients and their families, empowering them with the knowledge and resources needed for treatment and self-care. Demonstrates professionalism and upholds the MLH Mission, Vision, and Values, serving as a role model for excellence in nursing practice.\n\nWhat you will do\nConducts comprehensive nursing assessments to determine appropriate interventions and develop individualized care plans.\nProvides patient and family education on care plans, medications, and self-care strategies.\nDevelops, implements, and adjusts personalized patient care plans based on ongoing clinical assessments.\nAdministers medications safely, following best practices in medication management.\nCollaborates with interdisciplinary teams to ensure coordinated, high-quality patient care.\n\nEducation Qualifications\nPost-Graduate Certificate or Diploma Nursing - RN\nPreferred: Bachelor's Degree Nursing - RN\nExperience Qualifications\nMinimum of 6 months RN experience\nPreferred: Greater than 1 year experience in similar clinical setting\nSkills and Abilities\nComprehensive understanding of patient care, including the ability to conduct thorough assessments using the nursing process.\nStrong knowledge of the Nurse Practice Act and the scope of practice for a Registered Nurse.\nAbility to process complex clinical information using critical thinking to develop, implement, and support individualized care plans.\nAbility to effectively delegate tasks to team members, ensuring a collaborative, team-based approach to delivering high-quality patient care.\nFamiliarity with healthcare technology that enhances patient safety and care efficiency (e.g., bar code scanning, electronic health records).\nLicenses and Certifications\nBASIC LIFE SUPPORT - American Heart Association\nRegistered Nurse Tennessee - Tennessee Board of Nursing\nPreferred: Certification in clinical specialty\nSupervision Provided by this Position\nThe Registered Nurse directs and delegates all patient care activities on nursing units.\nPhysical Demands\nThe physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion.\nMust have good balance and coordination.\nThe physical requirements of this position are: medium work - exerting up to 50 lbs. of force occasionally and/or up to 25 lbs. of force frequently.\nThe Associate is required to have close visual acuity including color, depth perception, and field of vision to perform an activity, such as assessing patients, preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading.\nFrequent invasive and non-invasive patient contact.\nExposure to patient body fluids as well as exposure to hazardous or poisonous materials.\nAbility to react quickly to emergency situations.\nOur Associates are passionate about what they do, the service they provide and the patients they serve. We value family, team and a Power of One culture that requires commitment to the highest standards of care and unity.\n\nBoasting one of the South's largest medical centers, Memphis blends a friendly community, a thriving and growing downtown, and a low cost of living. We see each day as a new opportunity to make a difference in the lives of the people in our community.",
        "job_location": "Methodist Olive Branch Hospital"
    },
    {
        "company": "Methodist Le Bonheur Healthcare",
        "company_url": "https://methodisthealth.wd5.myworkdayjobs.com/MLH?q=nurse",
        "job_title": "Registered Nurse (RN) - University OR Transplant Team - Full Time Days",
        "job_href": "https://methodisthealth.wd5.myworkdayjobs.com/en-US/MLH/job/Methodist-University-Hospital/RN---University-OR-Transplant-Team---Full-Time-Days_R-566?q=nurse",
        "job_posting_text": "remote type\nOn Campus\nlocations\nMethodist University Hospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-566\nIf you are looking to make an impact on a meaningful scale, come join us as we embrace the Power of One!\n We strive to be an employer of choice and establish a reputation for being a talent rich organization where Associates can grow their career caring for others. For over a century, we’ve served the health care needs of the people of Memphis and the Mid-South.\n Responsible for the nursing care of patients requiring specialized judgment and skill. This judgment and skill is based on knowledge of the natural, behavioral and nursing sciences and humanities as the basis for application of the nursing process in wellness and illness care.\nModels appropriate behavior as exemplified in MLH Mission, Vision and Values.\n\n Working at MLH means carrying the mission forward of caring for our community and impacting the lives of patients in every way through compassion, a deliberate focus on service expectations and a consistent thriving for excellence.\n\nA Brief Overview\nResponsible for delivering and coordinating nursing care for patients within a multidisciplinary team, utilizing the nursing process to ensure comprehensive, high-quality care. Provides compassionate, patient-centered care while supporting patients and families through emotional challenges and crises. Prioritizes patient safety and strives for optimal care outcomes through evidence-based practice. Educates and advocates for both patients and their families, empowering them with the knowledge and resources needed for treatment and self-care. Demonstrates professionalism and upholds the MLH Mission, Vision, and Values, serving as a role model for excellence in nursing practice.\n\nWhat you will do\nConducts comprehensive nursing assessments to determine appropriate interventions and develop individualized care plans.\nProvides patient and family education on care plans, medications, and self-care strategies.\nDevelops, implements, and adjusts personalized patient care plans based on ongoing clinical assessments.\nAdministers medications safely, following best practices in medication management.\nCollaborates with interdisciplinary teams to ensure coordinated, high-quality patient care.\n\nEducation Qualifications\nPost-Graduate Certificate or Diploma Nursing - RN\nPreferred: Bachelor's Degree Nursing - RN\nExperience Qualifications\nMinimum of 6 months RN experience\nPreferred: Greater than 1 year experience in similar clinical setting\nSkills and Abilities\nComprehensive understanding of patient care, including the ability to conduct thorough assessments using the nursing process.\nStrong knowledge of the Nurse Practice Act and the scope of practice for a Registered Nurse.\nAbility to process complex clinical information using critical thinking to develop, implement, and support individualized care plans.\nAbility to effectively delegate tasks to team members, ensuring a collaborative, team-based approach to delivering high-quality patient care.\nFamiliarity with healthcare technology that enhances patient safety and care efficiency (e.g., bar code scanning, electronic health records).\nLicenses and Certifications\nBASIC LIFE SUPPORT - American Heart Association\nRegistered Nurse Tennessee - Tennessee Board of Nursing\nPreferred: Certification in clinical specialty\nSupervision Provided by this Position\nThe Registered Nurse directs and delegates all patient care activities on nursing units.\nPhysical Demands\nThe physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion.\nMust have good balance and coordination.\nThe physical requirements of this position are: medium work - exerting up to 50 lbs. of force occasionally and/or up to 25 lbs. of force frequently.\nThe Associate is required to have close visual acuity including color, depth perception, and field of vision to perform an activity, such as assessing patients, preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading.\nFrequent invasive and non-invasive patient contact.\nExposure to patient body fluids as well as exposure to hazardous or poisonous materials.\nAbility to react quickly to emergency situations.\nOur Associates are passionate about what they do, the service they provide and the patients they serve. We value family, team and a Power of One culture that requires commitment to the highest standards of care and unity.\n\nBoasting one of the South's largest medical centers, Memphis blends a friendly community, a thriving and growing downtown, and a low cost of living. We see each day as a new opportunity to make a difference in the lives of the people in our community.",
        "job_location": "Methodist University Hospital"
    },
    {
        "company": "Methodist Le Bonheur Healthcare",
        "company_url": "https://methodisthealth.wd5.myworkdayjobs.com/MLH?q=nurse",
        "job_title": "CVOR RN 10 hour days",
        "job_href": "https://methodisthealth.wd5.myworkdayjobs.com/en-US/MLH/job/Methodist-University-Hospital/CVOR-RN-10-hour-days_R-7284?q=nurse",
        "job_posting_text": "remote type\nOn Campus\nlocations\nMethodist University Hospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-7284\nIf you are looking to make an impact on a meaningful scale, come join us as we embrace the Power of One!\n We strive to be an employer of choice and establish a reputation for being a talent rich organization where Associates can grow their career caring for others. For over a century, we’ve served the health care needs of the people of Memphis and the Mid-South.\n Responsible for the nursing care of patients requiring specialized judgment and skill. This judgment and skill is based on knowledge of the natural, behavioral and nursing sciences and humanities as the basis for application of the nursing process in wellness and illness care.\nModels appropriate behavior as exemplified in MLH Mission, Vision and Values.\n\n Working at MLH means carrying the mission forward of caring for our community and impacting the lives of patients in every way through compassion, a deliberate focus on service expectations and a consistent thriving for excellence.\n\nA Brief Overview\nResponsible for delivering and coordinating nursing care for patients within a multidisciplinary team, utilizing the nursing process to ensure comprehensive, high-quality care. Provides compassionate, patient-centered care while supporting patients and families through emotional challenges and crises. Prioritizes patient safety and strives for optimal care outcomes through evidence-based practice. Educates and advocates for both patients and their families, empowering them with the knowledge and resources needed for treatment and self-care. Demonstrates professionalism and upholds the MLH Mission, Vision, and Values, serving as a role model for excellence in nursing practice.\n\nWhat you will do\nConducts comprehensive nursing assessments to determine appropriate interventions and develop individualized care plans.\nProvides patient and family education on care plans, medications, and self-care strategies.\nDevelops, implements, and adjusts personalized patient care plans based on ongoing clinical assessments.\nAdministers medications safely, following best practices in medication management.\nCollaborates with interdisciplinary teams to ensure coordinated, high-quality patient care.\n\nEducation Qualifications\nPost-Graduate Certificate or Diploma Nursing - RN\nPreferred: Bachelor's Degree Nursing - RN\nExperience Qualifications\nMinimum of 6 months RN experience\nPreferred: Greater than 1 year experience in similar clinical setting\nSkills and Abilities\nComprehensive understanding of patient care, including the ability to conduct thorough assessments using the nursing process.\nStrong knowledge of the Nurse Practice Act and the scope of practice for a Registered Nurse.\nAbility to process complex clinical information using critical thinking to develop, implement, and support individualized care plans.\nAbility to effectively delegate tasks to team members, ensuring a collaborative, team-based approach to delivering high-quality patient care.\nFamiliarity with healthcare technology that enhances patient safety and care efficiency (e.g., bar code scanning, electronic health records).\nLicenses and Certifications\nBASIC LIFE SUPPORT - American Heart Association\nRegistered Nurse Tennessee - Tennessee Board of Nursing\nPreferred: Certification in clinical specialty\nSupervision Provided by this Position\nThe Registered Nurse directs and delegates all patient care activities on nursing units.\nPhysical Demands\nThe physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion.\nMust have good balance and coordination.\nThe physical requirements of this position are: medium work - exerting up to 50 lbs. of force occasionally and/or up to 25 lbs. of force frequently.\nThe Associate is required to have close visual acuity including color, depth perception, and field of vision to perform an activity, such as assessing patients, preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading.\nFrequent invasive and non-invasive patient contact.\nExposure to patient body fluids as well as exposure to hazardous or poisonous materials.\nAbility to react quickly to emergency situations.\nOur Associates are passionate about what they do, the service they provide and the patients they serve. We value family, team and a Power of One culture that requires commitment to the highest standards of care and unity.\n\nBoasting one of the South's largest medical centers, Memphis blends a friendly community, a thriving and growing downtown, and a low cost of living. We see each day as a new opportunity to make a difference in the lives of the people in our community.",
        "job_location": "Methodist University Hospital"
    },
    {
        "company": "Methodist Le Bonheur Healthcare",
        "company_url": "https://methodisthealth.wd5.myworkdayjobs.com/MLH?q=nurse",
        "job_title": "Clinical Lead RN - Le Bonheur Peds Germantown - FT Days",
        "job_href": "https://methodisthealth.wd5.myworkdayjobs.com/en-US/MLH/job/Memphis-Pediatrics/Clinical-Lead-RN---Le-Bonheur-Peds-Germantown---FT-Days_R-10982?q=nurse",
        "job_posting_text": "remote type\nOn Campus\nlocations\nMemphis Pediatrics\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-10982\nIf you are looking to make an impact on a meaningful scale, come join us as we embrace the Power of One!\n We strive to be an employer of choice and establish a reputation for being a talent rich organization where Associates can grow their career caring for others. For over a century, we’ve served the health care needs of the people of Memphis and the Mid-South.\n The Clinic Lead is responsible for clinic flow and coordination of clinic staff daily work schedules in conjunction with the Office Manager. Assists with the daily clinical activities under the supervision of the physician, RN and/or nurse practitioner. Models appropriate behavior as exemplified in MLH Mission, Vision and Values.\n\n Working at MLH means carrying the mission forward of caring for our community and impacting the lives of patients in every way through compassion, a deliberate focus on service expectations and a consistent thriving for excellence.\n\nA Brief Overview\nThe Clinic Lead is responsible for clinic flow and coordination of clinic staff daily work schedules in conjunction with the Office Manager. Assists with the daily clinical activities under the supervision of the physician, RN and/or nurse practitioner. Models appropriate behavior as exemplified in MLH Mission, Vision and Values.\n\nWhat you will do\nProvides managerial support when the Office Manager is off-site or unavailable.\nComplies with established patient care guidelines, maintains clinic policies, procedures and objectives.\nPerforms patient care activities under the supervision of physician, RN, and/or Nurse Practitioner.  Accurately obtains, organizes, and records necessary patient data.\nUpdates all patient records subsequent to clinical information from physicians, nurse practitioner, including lab, etc., and assists in maintaining pertinent records.\nMaintains a safe, clean, orderly environment for the patients and staff.\n\nEducation/Formal Training Requirements\nTechnical Degree or Diploma Nursing - LPN \n\nWork Experience Requirements\n1-3 years Clinic or physician office \n\nLicenses and Certifications Requirements\nBASIC LIFE SUPPORT - American Heart Association  \nEmergency Medical Personnel Tennessee - Tennessee Emergency Medical Services Division  \nLicensed Practical Nurse - Arkansas - Arkansas State Board of Nursing  \nLicensed Practical Nurse - Mississippi - Mississippi Board of Nursing  \nLicensed Practical Nurse - Tennessee - Tennessee Board of Nursing  \n\nKnowledge, Skills and Abilities\nKnowledge of medical terminology.\nAbility to read, write and understand verbal or written instructions.\nAbility to foster and maintain good working relationships with patients and families.\nDemonstrates compassion and patience with a deep level of concern for patients.\nAbility to effectively communicate verbally with others.\nKnowledge of computer data entry/retrieval skills (MS Office Suite); prior experience with electronic medical record systems preferred. Ability to set priorities, coordinates and organizes multiple tasks, and maintains control of workflow.\nAbility to maintain confidentiality at all times according to clinic policy and procedures and HIPAA requirements.\nAbility to understand principles and implement basic procedures of infection control.\n\nSupervision Provided by this Position\nProvides supervisory support, direction, and guidance when the Office Manager is off-site.\n\nPhysical Demands\nThe physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion. \nMust have good balance and coordination. \nThe physical requirements of this position are: medium work - exerting up to 50 lbs. of force occasionally and/or up to 25 lbs. of force frequently. \nThe Associate is required to have close visual acuity including color, depth perception, and field of vision to perform an activity, such as assessing patients, preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading. \nFrequent invasive and non-invasive patient contact. \nExposure to patient body fluids as well as exposure to hazardous or poisonous materials. \nAbility to react quickly to emergency situations. \n\nOur Associates are passionate about what they do, the service they provide and the patients they serve.  We value family, team and a Power of One culture that requires commitment to the highest standards of care and unity.\n\nBoasting one of the South's largest medical centers, Memphis blends a friendly community, a thriving and growing downtown, and a low cost of living. We see each day as a new opportunity to make a difference in the lives of the people in our community.",
        "job_location": "Memphis Pediatrics"
    },
    {
        "company": "Methodist Le Bonheur Healthcare",
        "company_url": "https://methodisthealth.wd5.myworkdayjobs.com/MLH?q=nurse",
        "job_title": "LPN - Olive Branch Primary Care - FT days",
        "job_href": "https://methodisthealth.wd5.myworkdayjobs.com/en-US/MLH/job/Primary-Care---5480-Goodman-Road/LPN---Olive-Branch-Primary-Care---FT-days_R-10996?q=nurse",
        "job_posting_text": "remote type\nOn Campus\nlocations\nPrimary Care - 5480 Goodman Road\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-10996\nIf you are looking to make an impact on a meaningful scale, come join us as we embrace the Power of One!\n We strive to be an employer of choice and establish a reputation for being a talent rich organization where Associates can grow their career caring for others. For over a century, we’ve served the health care needs of the people of Memphis and the Mid-South.\n Responsible for assisting with the daily clinical activities under the supervision of the physician, RN,  and/or nurse practitioner providing primary care services. Models appropriate behavior as exemplified in MLH Mission, Vision and Values.\n\n Working at MLH means carrying the mission forward of caring for our community and impacting the lives of patients in every way through compassion, a deliberate focus on service expectations and a consistent thriving for excellence.\n\nA Brief Overview\nResponsible for assisting with the daily clinical activities under the supervision of the physician, RN,  and/or nurse practitioner providing primary care services. Models appropriate behavior as exemplified in MLH Mission, Vision and Values. \n\nWhat you will do\nComplies with established patient care guidelines, maintains established clinic policies, procedures and objectives, is aware of patient rights and confidentiality issues and abides by established communication policy with regard to the age specific populations.\nAccurately obtains, organizes and records necessary patient data.\nUpdates all patient records subsequent to clinical information from physicians, nurse practitioner, including lab, etc., and assists in maintaining pertinent records.\nAssists physicians, RNs, nurse practitioners with procedures as needed.\nPerforms under supervision of physician, RN, and/or nurse practitioner, the day-to-day clinical operations.\nHelps maintain a clean, orderly and safe environment for patient and staff.\nMay performs Limited Scope X-Ray duties in accordance to state regulations with certification as required or on an as needed basis.\nPerforms other job functions as assigned or requested.\n\nEducation/Formal Training Requirements\nTechnical Degree or Diploma Nursing - LPN \n\nWork Experience Requirements\n No prior work experience \n\nLicenses and Certifications Requirements\nBASIC LIFE SUPPORT - American Heart Association  \nLicensed Practical Nurse - Arkansas - Arkansas State Board of Nursing  \nLicensed Practical Nurse - Mississippi - Mississippi Board of Nursing  \nLicensed Practical Nurse - Tennessee - Tennessee Board of Nursing  \n\nKnowledge, Skills and Abilities\nStrong written and verbal communication skills with the ability to work with patients, patient families and physicians in a tactful and professional manner.\nAbility to begin the patient visit with eye contact, smile and greeting, while using the patient’s name.\nAbility to work independently and as part of a multidisciplinary team.\nPerforms computer skills demonstrated by successful navigation of the EMR with appropriate documentation.  Demonstrates ability to review computer reports following evidenced based guidelines.\nAbility to react quickly to emergency situations.\n\nSupervision Provided by this Position\nThere are no supervisory or lead responsibilities assigned to this position.\n\nPhysical Demands\nThe physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion. \nMust have good balance and coordination. \nThe physical requirements of this position are: medium work - exerting up to 50 lbs. of force occasionally and/or up to 25 lbs. of force frequently. \nThe Associate is required to have close visual acuity including color, depth perception, and field of vision to perform an activity, such as assessing patients, preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading. \nFrequent invasive and non-invasive patient contact. \nExposure to patient body fluids as well as exposure to hazardous or poisonous materials. \n\nOur Associates are passionate about what they do, the service they provide and the patients they serve.  We value family, team and a Power of One culture that requires commitment to the highest standards of care and unity.\n\nBoasting one of the South's largest medical centers, Memphis blends a friendly community, a thriving and growing downtown, and a low cost of living. We see each day as a new opportunity to make a difference in the lives of the people in our community.",
        "job_location": "Primary Care - 5480 Goodman Road"
    },
    {
        "company": "Methodist Le Bonheur Healthcare",
        "company_url": "https://methodisthealth.wd5.myworkdayjobs.com/MLH?q=nurse",
        "job_title": "RN PRN",
        "job_href": "https://methodisthealth.wd5.myworkdayjobs.com/en-US/MLH/job/Medical-Office-Complex/RN-PRN_R-11099-1?q=nurse",
        "job_posting_text": "remote type\nOn Campus\nlocations\nMedical Office Complex\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR-11099\nIf you are looking to make an impact on a meaningful scale, come join us as we embrace the Power of One!\n We strive to be an employer of choice and establish a reputation for being a talent rich organization where Associates can grow their career caring for others. For over a century, we’ve served the health care needs of the people of Memphis and the Mid-South.\n Responsible for delivering and coordinating nursing care for patients within a multidisciplinary team, utilizing the nursing process to ensure comprehensive, high-quality care. Provides compassionate, patient-centered care while supporting patients and families through emotional challenges and crises. Prioritizes patient safety and strives for optimal care outcomes through evidence-based practice. Educates and advocates for both patients and their families, empowering them with the knowledge and resources needed for treatment and self-care. Demonstrates professionalism and upholds the MLH Mission, Vision, and Values, serving as a role model for excellence in nursing practice.\n\n Working at MLH means carrying the mission forward of caring for our community and impacting the lives of patients in every way through compassion, a deliberate focus on service expectations and a consistent thriving for excellence.\n\nA Brief Overview\nResponsible for delivering and coordinating nursing care for patients within a multidisciplinary team, utilizing the nursing process to ensure comprehensive, high-quality care. Provides compassionate, patient-centered care while supporting patients and families through emotional challenges and crises. Prioritizes patient safety and strives for optimal care outcomes through evidence-based practice. Educates and advocates for both patients and their families, empowering them with the knowledge and resources needed for treatment and self-care. Demonstrates professionalism and upholds the MLH Mission, Vision, and Values, serving as a role model for excellence in nursing practice.\n\nWhat you will do\nConducts comprehensive nursing assessments to determine appropriate interventions and develop individualized care plans.\nProvides patient and family education on care plans, medications, and self-care strategies.\nDevelops, implements, and adjusts personalized patient care plans based on ongoing clinical assessments.\nAdministers medications safely, following best practices in medication management.\nCollaborates with interdisciplinary teams to ensure coordinated, high-quality patient care.\n\nEducation Qualifications\nPost-Graduate Certificate or Diploma Nursing - RN\nPreferred: Bachelor's Degree Nursing - RN\nExperience Qualifications\nMinimum of 6 months RN experience\nPreferred: Greater than 1 year experience in similar clinical setting\nSkills and Abilities\nComprehensive understanding of patient care, including the ability to conduct thorough assessments using the nursing process.\nStrong knowledge of the Nurse Practice Act and the scope of practice for a Registered Nurse.\nAbility to process complex clinical information using critical thinking to develop, implement, and support individualized care plans.\nAbility to effectively delegate tasks to team members, ensuring a collaborative, team-based approach to delivering high-quality patient care.\nFamiliarity with healthcare technology that enhances patient safety and care efficiency (e.g., bar code scanning, electronic health records).\nLicenses and Certifications\nBASIC LIFE SUPPORT - American Heart Association\nRegistered Nurse Tennessee - Tennessee Board of Nursing\nPreferred: Certification in clinical specialty\nSupervision Provided by this Position\nThe Registered Nurse directs and delegates all patient care activities on nursing units.\nPhysical Demands\nThe physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion.\nMust have good balance and coordination.\nThe physical requirements of this position are: medium work - exerting up to 50 lbs. of force occasionally and/or up to 25 lbs. of force frequently.\nThe Associate is required to have close visual acuity including color, depth perception, and field of vision to perform an activity, such as assessing patients, preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading.\nFrequent invasive and non-invasive patient contact.\nExposure to patient body fluids as well as exposure to hazardous or poisonous materials.\nAbility to react quickly to emergency situations.\nOur Associates are passionate about what they do, the service they provide and the patients they serve. We value family, team and a Power of One culture that requires commitment to the highest standards of care and unity.\n\nBoasting one of the South's largest medical centers, Memphis blends a friendly community, a thriving and growing downtown, and a low cost of living. We see each day as a new opportunity to make a difference in the lives of the people in our community.",
        "job_location": "Medical Office Complex"
    },
    {
        "company": "Nationwide Children’s Hospital",
        "company_url": "https://nationwidechildrens.wd5.myworkdayjobs.com/NCHCareers?q=nurse",
        "job_title": "Mental Health Specialist I - PCD, Psychiatric Crisis Department (Evenings)",
        "job_href": "https://nationwidechildrens.wd5.myworkdayjobs.com/en-US/NCHCareers/job/Main-Campus-Columbus-OH/Mental-Health-Specialist-I---PCD--Psychiatric-Crisis-Department--Evenings-_R-11584-1?q=nurse",
        "job_posting_text": "locations\nMain Campus, Columbus, OH\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR-11584\nOverview:\n\n Evening Shift: 3:00pm-11:30pm\n24 Hours per week available (0.6 FTE)\n32 Hours per week available (0.8 FTE)\nEvery other weekend required\nBenefits eligible.\nPosition Starts at $19.77 an hour. Pay to commensurate with experience. \n$1.50 per hour evening shift differential. $1.75 weekend shift differential.\n\n Job Description Summary:\n\n Performs basic supportive and trauma-informed care to specified patients and families under the direction and supervision of registered nurse or clinical supervisor.\n\n Job Description:\n\n Essential Functions:\nParticipates with the interdisciplinary team in specialized patient care. Cares for patient assignment as delegated.\nEffectively establishes therapeutic relationships with patients and families on the unit including but not limited to effective communication and education.\nProvides trauma-informed care, utilizes positive reinforcement and operates within a therapeutic relationship, maintains staff and patient safety through de-escalation, limit setting, and physical interventions.\nCollaborates with other healthcare professionals to develop treatment plans.\nActs as a resource to unit staff regarding diagnoses, behavior plans, relationship based care, protective equipment, crisis management.\n\nEducation Requirement:\nHigh School Diploma or equivalent, required.\nCurrent enrollment in and completion of half a Psychology, Social Work, or related undergraduate program, or equivalent experience, required.\n\nLicensure Requirement:\n(not specified)\n\nCertifications:\nBasic Life Support (BLS) certification from the American Heart Association, required.\nTherapeutic Crisis Intervention certification provided by the organization, required by conclusion of orientation. \n\nSkills:\nEffective written and verbal communication, interpersonal and problem-solving skills.\n\nExperience:\nOne year of hospital experience in a mental health role within the past three years, or equivalent education, required.  \n\nPhysical Requirements:\nOCCASIONALLY: Biohazard waste, Chemicals/Medications, Climb stairs/ladder, Fume /Gases /Vapors, Lifting / Carrying: 0-10 lbs, Lifting / Carrying: 11-20 lbs, Lifting / Carrying: 21-40 lbs, Lifting / Carrying: 41-60 lbs, Patient Equipment, Pushing / Pulling: 0-25 lbs, Pushing / Pulling: 26-40 lbs, Pushing / Pulling: 41-60 lbs, Pushing / Pulling: 61-100 lbs\nFREQUENTLY: Bend/twist, Blood and/or Bodily Fluids, Communicable Diseases and/or Pathogens, Computer skills, Flexing/extending of neck, Loud Noises, Reaching above shoulder, Squat/kneel\nCONTINUOUSLY: Audible speech, Color vision, Decision Making, Depth perception, Hand use: grasping, gripping, turning, Hearing acuity, Interpreting Data, Peripheral vision, Problem solving, Repetitive hand/arm use, Seeing – Far/near, Sitting, Standing, Walking\n\nAdditional Physical Requirements performed but not listed above:\nMust be able to perform therapeutic crisis intervention moves (TCI).\nAble to wear and function in helmets and other safety equipment.\nRapid physical response when needed.\nApplies the principles of body mechanics in lifting or moving patients and/or equipment.\nMust be able to move or reposition patients of any weight or size with the assistance of another person(s) and/or equipment.\n\n \n \"The above list of duties is intended to describe the general nature and level of work performed by individuals assigned to this classification. It is not to be construed as an exhaustive list of duties performed by the individuals so classified, nor is it intended to limit or modify the right of any supervisor to assign, direct, and control the work of employees under their supervision. EOE M/F/Disability/Vet\"",
        "job_location": "Main Campus, Columbus, OH"
    },
    {
        "company": "Nationwide Children’s Hospital",
        "company_url": "https://nationwidechildrens.wd5.myworkdayjobs.com/NCHCareers?q=nurse",
        "job_title": "Mental Health Specialist I - PCD, Psychiatric Crisis Department (Evenings)",
        "job_href": "https://nationwidechildrens.wd5.myworkdayjobs.com/en-US/NCHCareers/job/Main-Campus-Columbus-OH/Mental-Health-Specialist-I---PCD--Psychiatric-Crisis-Department--Evenings-_R-11585-1?q=nurse",
        "job_posting_text": "locations\nMain Campus, Columbus, OH\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR-11585\nOverview:\n\n Evening Shift: 3:00pm-11:30pm\n24 Hours per week available (0.6 FTE)\n32 Hours per week available (0.8 FTE)\nEvery other weekend required\nBenefits eligible.\nPosition Starts at $19.77 an hour. Pay to commensurate with experience. \n$1.50 per hour evening shift premium. $1.75 weekend shift differential.\n\n Job Description Summary:\n\n Performs basic supportive and trauma-informed care to specified patients and families under the direction and supervision of registered nurse or clinical supervisor.\n\n Job Description:\n\n Essential Functions:\nParticipates with the interdisciplinary team in specialized patient care. Cares for patient assignment as delegated.\nEffectively establishes therapeutic relationships with patients and families on the unit including but not limited to effective communication and education.\nProvides trauma-informed care, utilizes positive reinforcement and operates within a therapeutic relationship, maintains staff and patient safety through de-escalation, limit setting, and physical interventions\nCollaborates with other healthcare professionals to develop treatment plans.\nActs as a resource to unit staff regarding diagnoses, behavior plans, relationship based care, protective equipment, crisis management.\n\nEducation Requirement:\nHigh School Diploma or equivalent, required.\nCurrent enrollment in and completion of half a Psychology, Social Work, or related undergraduate program, or equivalent experience, required.\n\nLicensure Requirement:\n(not specified)\n\nCertifications:\nBasic Life Support (BLS) certification from the American Heart Association, required.\nTherapeutic Crisis Intervention certification provided by the organization, required by conclusion of orientation. \n\nSkills:\nEffective written and verbal communication, interpersonal and problem-solving skills.\n\nExperience:\nOne year of hospital experience in a mental health role within the past three years, or equivalent education, required.  \n\nPhysical Requirements:\nOCCASIONALLY: Biohazard waste, Chemicals/Medications, Climb stairs/ladder, Fume /Gases /Vapors, Lifting / Carrying: 0-10 lbs, Lifting / Carrying: 11-20 lbs, Lifting / Carrying: 21-40 lbs, Lifting / Carrying: 41-60 lbs, Patient Equipment, Pushing / Pulling: 0-25 lbs, Pushing / Pulling: 26-40 lbs, Pushing / Pulling: 41-60 lbs, Pushing / Pulling: 61-100 lbs\nFREQUENTLY: Bend/twist, Blood and/or Bodily Fluids, Communicable Diseases and/or Pathogens, Computer skills, Flexing/extending of neck, Loud Noises, Reaching above shoulder, Squat/kneel\nCONTINUOUSLY: Audible speech, Color vision, Decision Making, Depth perception, Hand use: grasping, gripping, turning, Hearing acuity, Interpreting Data, Peripheral vision, Problem solving, Repetitive hand/arm use, Seeing – Far/near, Sitting, Standing, Walking\n\nAdditional Physical Requirements performed but not listed above:\nMust be able to perform therapeutic crisis intervention moves (TCI).\nAble to wear and function in helmets and other safety equipment.\nRapid physical response when needed.\nApplies the principles of body mechanics in lifting or moving patients and/or equipment.\nMust be able to move or reposition patients of any weight or size with the assistance of another person(s) and/or equipment.\n\n \n \"The above list of duties is intended to describe the general nature and level of work performed by individuals assigned to this classification. It is not to be construed as an exhaustive list of duties performed by the individuals so classified, nor is it intended to limit or modify the right of any supervisor to assign, direct, and control the work of employees under their supervision. EOE M/F/Disability/Vet\"",
        "job_location": "Main Campus, Columbus, OH"
    },
    {
        "company": "Nationwide Children’s Hospital",
        "company_url": "https://nationwidechildrens.wd5.myworkdayjobs.com/NCHCareers?q=nurse",
        "job_title": "Hospital Pediatrics Faculty - Associate Division Director for Research",
        "job_href": "https://nationwidechildrens.wd5.myworkdayjobs.com/en-US/NCHCareers/job/Main-Campus-Columbus-OH/Hospital-Pediatrics-Faculty---Associate-Division-Director-for-Research_R-17181?q=nurse",
        "job_posting_text": "locations\nMain Campus, Columbus, OH\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-17181\nOverview:\n\n The Division of Hospital Pediatrics at Nationwide Children’s Hospital and the Department of Pediatrics at The Ohio State University, Columbus, Ohio is seeking a mid-career faculty member to join our team as Associate Division Director for Research.\nThe Division of Hospital Medicine and the Abigail Wexner Research Institute at Nationwide Children’s provide outstanding infrastructure for single- and multi-center hospital-medicine specific research. Nationwide Children’s Hospital is one of the Top 10 National Institutes of Health funded free-standing pediatric research facilities. In 2023, our hospital medicine division’s extramural grant funding exceeded $700,000 supporting a wide portfolio of multi-center projects focused on evidence translation and equity.\nThe Division of Hospital Pediatrics currently has 56 faculty members, including pediatric, newborn, and med/peds hospitalists with diverse academic and clinical interests. An ACGME-accredited two or three-year fellowship program started in 2018 and welcomes two fellows per year. Supported by superb clinical infrastructure, the division had over 7,800 discharges and 23,000 patient days in 2023. Newborn hospitalists cover the nursery at Ohio State Medical Center involving over 5,000 deliveries per year.\nIdeal candidates for this academic position will be hospital medicine fellowship or research fellowship-trained hospitalists with a strong track record in clinical and/or translational research, mentorship, and teaching. Responsibilities will include the conduct of individual and collaborative original scientific research, faculty and fellow research mentorship, and provision of clinical care.\n\n Job Description Summary:\n\n Provides medical care and treatment to patients.\n\n Job Description:\n\n Essential Functions:\nConducts patient assessments and diagnoses medical conditions.\nDevelops and implements treatment plans for patients in accordance with established protocols. Monitors patient progress and adjusts treatment plans as necessary.\nOrders and interprets diagnostic tests to aid in patient diagnosis and treatment.\nCommunicates with patients and their families to provide education and support.\nMaintains accurate and up-to-date medical records for each patient and coordinates care with other healthcare professionals.\nParticipates in the training and education of medical students, residents, and fellows as required.\nStays up-to-date with medical advancements and research to provide the best possible care.\n\nEducation Requirement:\nDoctor of Medicine or Doctor of Osteopathic Medicine equivalent, required.\nGraduate of an approved Fellowship program if applicable, required.\n\nLicensure Requirement:\nMedical License in the State of Ohio, required.\nUnrestricted licensed physician, required.\n\nCertifications:\nBoard Certification or eligibility in Pediatrics, required.\n\nSkills:\n(not specified)\n\nExperience:\nPrior clinical practice experience may be required based on the needs of the division.\n\nPhysical Requirements:\nOCCASIONALLY: Bend/twist, Blood and/or Bodily Fluids, Chemicals/Medications, Communicable Diseases and/or Pathogens, Flexing/extending of neck, Fume /Gases /Vapors, Lifting / Carrying: 0-10 lbs, Lifting / Carrying: 11-20 lbs, Lifting / Carrying: 21-40 lbs, Loud Noises, Patient Equipment, Pushing / Pulling: 0-25 lbs, Reaching above shoulder, Squat/kneel\nFREQUENTLY: Computer skills, Hand use: grasping, gripping, turning, Repetitive hand/arm use, Sitting, Standing, Walking\nCONTINUOUSLY: Audible speech, Color vision, Decision Making, Depth perception, Hearing acuity, Interpreting Data, Peripheral vision, Problem solving, Seeing – Far/near\n\nAdditional Physical Requirements performed but not listed above:\nMust be able to move or reposition patients of any weight or size with the assistance of another person(s) and/or equipment.\n\n\n \n \"The above list of duties is intended to describe the general nature and level of work performed by individuals assigned to this classification. It is not to be construed as an exhaustive list of duties performed by the individuals so classified, nor is it intended to limit or modify the right of any supervisor to assign, direct, and control the work of employees under their supervision. EOE M/F/Disability/Vet\"",
        "job_location": "Main Campus, Columbus, OH"
    },
    {
        "company": "Nationwide Children’s Hospital",
        "company_url": "https://nationwidechildrens.wd5.myworkdayjobs.com/NCHCareers?q=nurse",
        "job_title": "Staff RN - H11B Endo/Renal/GI (Nights or Day/Night Rotation)",
        "job_href": "https://nationwidechildrens.wd5.myworkdayjobs.com/en-US/NCHCareers/job/Main-Campus-Columbus-OH/Staff-RN---H11B-Endo-Renal-GI--Nights-or-Day-Night-Rotation-_R-17202?q=nurse",
        "job_posting_text": "locations\nMain Campus, Columbus, OH\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR-17202\nOverview:\n\n 36 hrs/week, straight nights or day/night rotation, every other weekend, 1 summer and 1 winter holiday.\nConsidering new grads and experienced RNs.\nBase pay $34.68/hr plus applicable shift differentials.\n\n Job Description Summary:\n\n Assists patients to move rapidly, uneventfully, and as effectively as possible through their episode of care while maintaining quality and safety as a priority. Delegates, directs, oversees and provides developmentally appropriate patient care. Practices professional nursing and promotes patient advocacy in accordance with the ANA Code of Ethics for Nurses and maintains a current Ohio Nursing License.\n\n Job Description:\n\n Essential Functions:\nProvides nursing care using a Family Centered approach. \nAssesses individualized patient needs. Communicates patient care needs and priorities to assigned Licensed Practical Nurses (LPNs), Patient Care Assistants (PCAs), Unit Coordinators, and Allied Health personnel.\nPlans, implements, educates and evaluates care using Evidence-Based Practices. \nUtilizes Therapeutic Communication while monitoring the physical, psychological, and social needs of patients and families.\nEngages in the “workplace community” by staying aware of changes, participating in data collection or auditing, understanding Quality Improvement, and representing staff at relevant meetings and then reporting important information and updates back to staff.\nDocuments according to organizational standards, policies, and procedures.\n\nEducation Requirement:\nBSN or Associate degree with commitment to obtain BSN within 5 years of hire, required.\n\nLicensure Requirement:\nLicensed as a Registered Nurse in the State of Ohio.\n\nCertifications:\nCurrent CPR certification required.\nMust be willing to obtain and maintain NRP, PALS, ACLS, APHON or other necessary certification as determined by your manager based on business unit.\n\nSkills:\n(not specified)\n\nExperience:\n(not specified)\n\nPhysical Requirements:\nOCCASIONALLY: Biohazard waste, Climb stairs/ladder, Driving motor vehicles (work required) *additional testing may be required, Fume /Gases /Vapors, Hand use: grasping, gripping, turning, Lifting / Carrying: 41-60 lbs, Lifting / Carrying: 61-100 lbs, Machinery, Power Tools, Pushing / Pulling: 100 lbs or greater with assistance, Reaching above shoulder\nFREQUENTLY: Bend/twist, Blood and/or Bodily Fluids, Chemicals/Medications, Communicable Diseases and/or Pathogens, Depth perception, Electricity, Lifting / Carrying: 0-10 lbs, Lifting / Carrying: 11-20 lbs, Lifting / Carrying: 21-40 lbs, Patient Equipment, Pushing / Pulling: 0-25 lbs, Pushing / Pulling: 26-40 lbs, Pushing / Pulling: 41-60 lbs, Pushing / Pulling: 61-100 lbs, Repetitive hand/arm use, Sitting, Squat/kneel\nCONTINUOUSLY: Audible speech, Color vision, Computer skills, Decision Making, Hearing acuity, Interpreting Data, Peripheral vision, Problem solving, Seeing – Far/near, Standing, Walking\n\nAdditional Physical Requirements performed but not listed above:\n(not specified)\n\n\n \n \"The above list of duties is intended to describe the general nature and level of work performed by individuals assigned to this classification. It is not to be construed as an exhaustive list of duties performed by the individuals so classified, nor is it intended to limit or modify the right of any supervisor to assign, direct, and control the work of employees under their supervision. EOE M/F/Disability/Vet\"",
        "job_location": "Main Campus, Columbus, OH"
    },
    {
        "company": "Nationwide Children’s Hospital",
        "company_url": "https://nationwidechildrens.wd5.myworkdayjobs.com/NCHCareers?q=nurse",
        "job_title": "Charge RN - Psychiatric Crisis Department - EOS (Evenings)",
        "job_href": "https://nationwidechildrens.wd5.myworkdayjobs.com/en-US/NCHCareers/job/Main-Campus-Columbus-OH/Charge-RN---Psychiatric-Crisis-Department---EOS--Evenings-_R-12389-2?q=nurse",
        "job_posting_text": "locations\nMain Campus, Columbus, OH\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR-12389\nOverview:\n\n Evening Shift: 3pm - 11:30 pm\n0.8 FTE / 32 hours per week\nMonday - Friday, No weekends\nBenefits Eligible\nBase rate starts at $34.68/hour, plus $1.50/hour Charge Nurse premium. \nPay to be commensurate with experience.\n\n Job Description Summary:\n\n Plans, directs, and evaluates the overall patient care and functions in a particular area during an assigned shift. Serves as a role model to positively influence culture and work environment. Practices professional nursing and promotes patient advocacy in accordance with the ANA Code of Ethics for Nurses.\n\n Job Description:\n\n Essential Functions:\nCoordinates the activities of a particular shift and directs, organizes, and assigns work to the employees. Ensures adequate supplies, equipment and utilization of staff.\nServes as an expert EPIC Super User. Assesses, monitors, and supports employees throughout the shift.\nFacilitates direct patient care through coaching, delegation and service recovery. Provides direct patient care as needed.\nEngages in the “workplace community” by staying aware of changes, participating in data collection or auditing, understanding Quality Improvement, and representing staff at relevant meetings and then reporting important information and updates back to staff.\nEnsures regulatory compliance. Institutes emergency responses as appropriate. Maintains quality and safety as a priority.\nSpecifies the critical resources required to accomplish the team's objectives.\nMakes appropriate staffing decisions with understanding and consideration of workload targets and budget impact.\n\nEducation Requirement:\nBSN, required.\n\nLicensure Requirement:\nCurrent Ohio Nursing License, required.\n\nCertifications:\n(not specified)\n\nSkills:\n(not specified)\n\nExperience:\nTwo years nursing experience, preferred.\n\nPhysical Requirements:\nOCCASIONALLY: Biohazard waste, Climb stairs/ladder, Cold Temperatures, Electricity, Fume /Gases /Vapors, Hot Temperatures, Lifting / Carrying: 61-100 lbs, Loud Noises, Machinery, Power Tools, Pushing / Pulling: 100 lbs or greater with assistance, Reaching above shoulder, Working at Heights, Working Outdoors\nFREQUENTLY: Bend/twist, Blood and/or Bodily Fluids, Chemicals/Medications, Communicable Diseases and/or Pathogens, Flexing/extending of neck, Hand use: grasping, gripping, turning, Lifting / Carrying: 0-10 lbs, Lifting / Carrying: 11-20 lbs, Patient Equipment, Pushing / Pulling: 0-25 lbs, Pushing / Pulling: 26-40 lbs, Sitting, Squat/kneel, Standing, Walking\nCONTINUOUSLY: Audible speech, Color vision, Computer skills, Decision Making, Depth perception, Hearing acuity, Interpreting Data, Peripheral vision, Problem solving, Repetitive hand/arm use, Seeing – Far/near\n\nAdditional Physical Requirements performed but not listed above:\n(not specified)\n\n \n \"The above list of duties is intended to describe the general nature and level of work performed by individuals assigned to this classification. It is not to be construed as an exhaustive list of duties performed by the individuals so classified, nor is it intended to limit or modify the right of any supervisor to assign, direct, and control the work of employees under their supervision. EOE M/F/Disability/Vet\"",
        "job_location": "Main Campus, Columbus, OH"
    },
    {
        "company": "Allina Health",
        "company_url": "https://allina.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Nursing Assistant Float",
        "job_href": "https://allina.wd5.myworkdayjobs.com/en-US/External/job/United-Hospital/Nursing-Assistant-Float_R-0065027?q=nurse",
        "job_posting_text": "locations\nUnited Hospital\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR-0065027\nLocation Address:\n333 Smith Ave N\nSaint Paul, MN 55102-2344\nDate Posted:\nJuly 10, 2025\nDepartment:\n34003820 Patient Care Floats\nShift:\nDay/Evening (United States of America)\nShift Length:\n8 hour shift\nHours Per Week:\n28\nUnion Contract:\nSEIU-4-United Service Workers-SUH\nWeekend Rotation: \nEvery Other\nJob Summary:\nAllina Health is a not-for-profit health system that cares for individuals, families and communities throughout Minnesota and western Wisconsin. If you value putting patients first, consider a career at Allina Health. Our mission is to provide exceptional care as we prevent illness, restore health and provide comfort to all who entrust us with their care. This includes you and your loved ones. We are committed to providing whole person care, investing in your well-being, and enriching your career.\nKey Position Details:\n0.7 FTE (56-hours per 2-week pay period)\n8-hour day/evening shifts\nEvery other weekend\nJob Description:\nUnder the direct supervision of a RN, assists in the delivery of patient care. This includes performing personal care such as feeding, bathing, dressing, grooming, moving and transporting patients, or changing linens. Collects and documents vital signs and other observations of patients.\n\nPrinciple Responsibilities\nPerforms personal care/interventions as assigned.\nCompletes interventions according to identified critical elements of each procedure.\nAnswers patient call lights promptly for both assigned and other patients.\nDistributes and sets up water, snacks and patient trays and assists patients.\nAssists patient with grooming and hygiene needs, maintains skin integrity, personal comfort and population specific needs of the patient.\nProvides assistance with ambulation, transfer, positioning and range of motion (ROM) according to activity order and needs of the patient.\nImplements activities of fall prevention plan as specified in plan of care.\nCollects and saves specimens.\nProvides assistance to the RN for admission, transfer, discharge and post-mortem care.\nMay transport medications excluding controlled substances within the site.\nObserves, collects and documents health status data as assigned.\nCompletes measurements according to critical elements of policy/procedures, which may include: temperatures, radial pulses, blood pressures, respirations, weights, intake and output.\nReports immediately to the RN observations/health status data that are not within normal limits for the patient or are significantly changed.\nDocuments according to documentation guidelines.\nContributes to an environment that is safe for patients, visitors and employees.\nProtects patient, self and others from injury during transfers, lifts and transports by using proper equipment and body mechanics.\nReports environmental risks or equipment malfunctions to supervisor.\nUses equipment following policies, procedures and manufacturer directions or standards.\nMay handle hazardous waste (identifies, segregates, and disposes of hazardous waste; ensures container integrity; knows emergency response procedures to spills, fires, and evacuation procedures).\nOther duties as assigned.\n\nRequired Qualifications\nMust meet one of the following requirements:\n◦ 18 years of age OR:\n◦ 17 years of age with high school diploma or GED\nMust meet one of the following requirements:\n◦ Successful completion of Certified Nursing Assistant (CNA) program OR:\n◦ Completion of one semester of clinical rotations within an accredited nursing program OR:\n◦ Completion of the Allina Health Nursing Assistant Academy Program OR:\n◦ Previous direct patient care experience\n\nLicenses/Certifications\nMust meet one of the requirements below:\n◦ Current BLS certification from the American Heart Association OR:\n◦ Current BLS certification from the American Red Cross OR:\n◦ Allina in-house BLS training within 30 days of hire\n\nPhysical Demands\nMedium Work*:\nLifting weight up to 32 lbs. occasionally (*Allina Safe Patient Moving Policy), up to 25 lbs. frequently\nPay Range\nPay Range: $20.71 to $26.97 per hour\nThe pay described reflects the base hourly pay range. Your starting rate would depend on a variety of factors including, but not limited to, your experience, education, and the union agreement (if applicable). Shift, weekend and/or other differentials may be available to increase your pay rate for certain shifts or work.\nBenefit Summary\nAllina Health believes the best way to provide safe and compassionate care for our patients is by nurturing the passion of those who care for them. That’s why we devote extraordinary resources to help you grow and thrive — not only as a professional but also as a whole person. When you join our team, you have access to a wealth of valuable employee benefits that support the total well-being — mind, body, spirit and community — of you and your family members. \nAllina Health is all in on your well-being. Because well-being means something different to everyone, our award-winning program provides you with the resources you need to help you navigate your personal journey. This includes up to $100 in well-being dollars, dedicated well-being navigators, and many programs, activities, articles, videos, personal coaching and tools to support you on your journey.  \nIn addition, Allina Health offers employee resources groups (ERGs) -- voluntary, employee-led groups that serve as a resource for members and organizations by fostering a diverse, inclusive workplace aligned with the organization's mission, values, goals, business practices, and objectives. Allina Health also engages employees in various community involvement and volunteering events.  \nBenefits include:\nMedical/Dental\nPTO/Time Away\nRetirement Savings Plans\nLife Insurance\nShort-term/Long-term Disability\nPaid Caregiver Leave\nVoluntary Benefits (vision, legal, critical illness)\nTuition Reimbursement or Continuing Medical Education as applicable\nStudent Loan Support Benefits to navigate the Federal Public Service Loan Forgiveness Program\nAllina Health is a 501(c)(3) eligible employer\n*Benefit eligibility/offerings are determined by FTE and if you are represented by a union.",
        "job_location": "United Hospital"
    },
    {
        "company": "Allina Health",
        "company_url": "https://allina.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Registered Nurse-Perianesthesia",
        "job_href": "https://allina.wd5.myworkdayjobs.com/en-US/External/job/Abbott-Northwestern-Hospital/Registered-Nurse-Perianesthesia_R-0065029-1?q=nurse",
        "job_posting_text": "locations\nAbbott Northwestern Hospital\ntime type\nPart time\nposted on\nPosted Today\ntime left to apply\nEnd Date: July 18, 2025 (7 days left to apply)\njob requisition id\nR-0065029\nLocation Address:\n2800 10th Ave\nReceiving Dock\nMinneapolis, MN 55407-1311\nDate Posted:\nJuly 10, 2025\nPosting Expiration Date:\nJuly 18, 2025\nDepartment:\n31005006 AHMHI CV/EP Labs MPLS\nShift:\nDay/Evening (United States of America)\nShift Length:\n10 hour shift\nHours Per Week:\n30\nUnion Contract:\nMNA-01-Abbott Northwestern RN-RAN\nWeekend Rotation: \nOccasional\nJob Summary:\nAllina Health is a not-for-profit health system that cares for individuals, families and communities throughout Minnesota and western Wisconsin. If you value putting patients first, consider a career at Allina Health. Our mission is to provide exceptional care as we prevent illness, restore health and provide comfort to all who entrust us with their care. This includes you and your loved ones. We are committed to providing whole person care, investing in your well-being, and enriching your career.\nKey Position Details:\nTier 1: Six months current ANW CV/EP Lab experience\nTier 2: One-year current CV/EP Lab experience\nTier 3: Two years current ICU experience\n0.75 FTE (60-hours per 2-week pay period)\n10-hour day/evening shifts\nOccasional weekends\nJob Description:\nNursing is the diagnosis and treatment of human response to actual or potential health problems. This includes establishing an intentional therapeutic relationship between a registered nurse and a patient and family. As a leader and the integrator of care, the professional nurse has the responsibility, authority, and accountability for planning, coordinating and evaluating the patient’s care needs.\n\nWorks with patients that are undergoing or recovering from anesthesia or sedation monitoring closely for complications and ensuring the optimal safety and comfort of patients under anesthesia.\n\nPrinciple Responsibilities\nComprehensive assessment of patient and family needs; identification of outcomes based on needs assessment; establishing the plan of care; supervising the progress; and modification of the plan of care as needed.\nMaintains education and competencies to remain proficient to provide high quality patient care practice and skills.\nIncorporates evidence-based nursing practice taking into consideration current statutes, rules and regulations when developing the plan of care.\nEstablishes, in the collaboration with the family and patient, realistic and measurable patient expected outcomes based on nursing diagnoses, patients present and potential capabilities, goals, available resources and plan for continuity of care.\nIdentifies outcomes that are age appropriate, culturally appropriate, realistic and attainable.\nCoordinates, collaborates, and delegates appropriately to ensure care is provided in a safe, effective fashion.\nFulfills all organizational requirements.\nSupplemental roles:\nCharge Nurse (only when acting in this role).\n◦ Demonstrates ability to coordinate, delegate, and direct unit operation, collaborates effectively with unit staff, leadership and other disciplines.\nPreceptor (only when acting in this role).\n◦ Demonstrates ability to identify the orientee's learning needs, plans appropriate learning experiences and demonstrates ability to validate clinical competence of orientee.\nOther duties as assigned.\n\nRequired Qualifications\nAssociate's or Vocational degree\n0 to 2 years critical care RN experience\n\nPreferred Qualifications \nBachelor's degree\n0 to 2 years perianesthesia experience\n\nLicenses/Certifications\nLicensed Registered Nurse – MN Board of Nursing required if working in state of MN upon hire / WI Department of Safety & Professional Services required if working in the state of WI upon hire\nMust meet at least ONE of the requirements below:\n◦ Current BLS certification from the American Heart Association\n◦ Current BLS certification from the American Red Cross\n◦ Allina in-house BLS training (within 30 days of hire)\nACLS/BLS Tier 2-Advanced Cardiac Life Support - Allina Health required by completion of orientation\nPALS - Pediatric Advance Life Support - Allina Health preferred by most sites\nCPAN American Board of Perianesthesia Nursing Certification preferred\nCAPA American Board of Perianesthesia Nursing Certification preferred\n\nPhysical Demands\nMedium Work*:\nLifting weight up to 32 lbs. occasionally (*Allina Safe Patient Moving Policy), up to 25 lbs. frequently\nPay Range\nPay Range: $41.67 to $69.39 per hour\nThe pay described reflects the base hourly pay range. Your starting rate would depend on a variety of factors including, but not limited to, your experience, education, and the union agreement (if applicable). Shift, weekend and/or other differentials may be available to increase your pay rate for certain shifts or work.\nBenefit Summary\nAllina Health believes the best way to provide safe and compassionate care for our patients is by nurturing the passion of those who care for them. That’s why we devote extraordinary resources to help you grow and thrive — not only as a professional but also as a whole person. When you join our team, you have access to a wealth of valuable employee benefits that support the total well-being — mind, body, spirit and community — of you and your family members. \nAllina Health is all in on your well-being. Because well-being means something different to everyone, our award-winning program provides you with the resources you need to help you navigate your personal journey. This includes up to $100 in well-being dollars, dedicated well-being navigators, and many programs, activities, articles, videos, personal coaching and tools to support you on your journey.  \nIn addition, Allina Health offers employee resources groups (ERGs) -- voluntary, employee-led groups that serve as a resource for members and organizations by fostering a diverse, inclusive workplace aligned with the organization's mission, values, goals, business practices, and objectives. Allina Health also engages employees in various community involvement and volunteering events.  \nBenefits include:\nMedical/Dental\nPTO/Time Away\nRetirement Savings Plans\nLife Insurance\nShort-term/Long-term Disability\nPaid Caregiver Leave\nVoluntary Benefits (vision, legal, critical illness)\nTuition Reimbursement or Continuing Medical Education as applicable\nStudent Loan Support Benefits to navigate the Federal Public Service Loan Forgiveness Program\nAllina Health is a 501(c)(3) eligible employer\n*Benefit eligibility/offerings are determined by FTE and if you are represented by a union.",
        "job_location": "Abbott Northwestern Hospital"
    },
    {
        "company": "Allina Health",
        "company_url": "https://allina.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Registered Nurse-Perianesthesia",
        "job_href": "https://allina.wd5.myworkdayjobs.com/en-US/External/job/Abbott-Northwestern-Hospital/Registered-Nurse-Perianesthesia_R-0065031?q=nurse",
        "job_posting_text": "locations\nAbbott Northwestern Hospital\ntime type\nFull time\nposted on\nPosted Today\ntime left to apply\nEnd Date: July 18, 2025 (7 days left to apply)\njob requisition id\nR-0065031\nLocation Address:\n2800 10th Ave\nReceiving Dock\nMinneapolis, MN 55407-1311\nDate Posted:\nJuly 10, 2025\nPosting Expiration Date:\nJuly 18, 2025\nDepartment:\n31005006 AHMHI CV/EP Labs MPLS\nShift:\nDay/Evening (United States of America)\nShift Length:\n10 hour shift\nHours Per Week:\n40\nUnion Contract:\nMNA-01-Abbott Northwestern RN-RAN\nWeekend Rotation: \nOccasional\nJob Summary:\nAllina Health is a not-for-profit health system that cares for individuals, families and communities throughout Minnesota and western Wisconsin. If you value putting patients first, consider a career at Allina Health. Our mission is to provide exceptional care as we prevent illness, restore health and provide comfort to all who entrust us with their care. This includes you and your loved ones. We are committed to providing whole person care, investing in your well-being, and enriching your career.\nKey Position Details:\nTier 1: Six months current ANW CV/EP Lab experience\nTier 2: One-year current CV/EP Lab experience\nTier 3: Two years current ICU experience\n1.0 FTE (80-hours per 2-week pay period)\n10-hour day/evening shifts\nOccasional weekends\nJob Description:\nNursing is the diagnosis and treatment of human response to actual or potential health problems. This includes establishing an intentional therapeutic relationship between a registered nurse and a patient and family. As a leader and the integrator of care, the professional nurse has the responsibility, authority, and accountability for planning, coordinating and evaluating the patient’s care needs.\n\nWorks with patients that are undergoing or recovering from anesthesia or sedation monitoring closely for complications and ensuring the optimal safety and comfort of patients under anesthesia.\n\nPrinciple Responsibilities\nComprehensive assessment of patient and family needs; identification of outcomes based on needs assessment; establishing the plan of care; supervising the progress; and modification of the plan of care as needed.\nMaintains education and competencies to remain proficient to provide high quality patient care practice and skills.\nIncorporates evidence-based nursing practice taking into consideration current statutes, rules and regulations when developing the plan of care.\nEstablishes, in the collaboration with the family and patient, realistic and measurable patient expected outcomes based on nursing diagnoses, patients present and potential capabilities, goals, available resources and plan for continuity of care.\nIdentifies outcomes that are age appropriate, culturally appropriate, realistic and attainable.\nCoordinates, collaborates, and delegates appropriately to ensure care is provided in a safe, effective fashion.\nFulfills all organizational requirements.\nSupplemental roles:\nCharge Nurse (only when acting in this role).\n◦ Demonstrates ability to coordinate, delegate, and direct unit operation, collaborates effectively with unit staff, leadership and other disciplines.\nPreceptor (only when acting in this role).\n◦ Demonstrates ability to identify the orientee's learning needs, plans appropriate learning experiences and demonstrates ability to validate clinical competence of orientee.\nOther duties as assigned.\n\nRequired Qualifications\nAssociate's or Vocational degree\n0 to 2 years critical care RN experience\n\nPreferred Qualifications \nBachelor's degree\n0 to 2 years perianesthesia experience\n\nLicenses/Certifications\nLicensed Registered Nurse – MN Board of Nursing required if working in state of MN upon hire / WI Department of Safety & Professional Services required if working in the state of WI upon hire\nMust meet at least ONE of the requirements below:\n◦ Current BLS certification from the American Heart Association\n◦ Current BLS certification from the American Red Cross\n◦ Allina in-house BLS training (within 30 days of hire)\nACLS/BLS Tier 2-Advanced Cardiac Life Support - Allina Health required by completion of orientation\nPALS - Pediatric Advance Life Support - Allina Health preferred by most sites\nCPAN American Board of Perianesthesia Nursing Certification preferred\nCAPA American Board of Perianesthesia Nursing Certification preferred\n\nPhysical Demands\nMedium Work*:\nLifting weight up to 32 lbs. occasionally (*Allina Safe Patient Moving Policy), up to 25 lbs. frequently\nPay Range\nPay Range: $41.67 to $69.39 per hour\nThe pay described reflects the base hourly pay range. Your starting rate would depend on a variety of factors including, but not limited to, your experience, education, and the union agreement (if applicable). Shift, weekend and/or other differentials may be available to increase your pay rate for certain shifts or work.\nBenefit Summary\nAllina Health believes the best way to provide safe and compassionate care for our patients is by nurturing the passion of those who care for them. That’s why we devote extraordinary resources to help you grow and thrive — not only as a professional but also as a whole person. When you join our team, you have access to a wealth of valuable employee benefits that support the total well-being — mind, body, spirit and community — of you and your family members. \nAllina Health is all in on your well-being. Because well-being means something different to everyone, our award-winning program provides you with the resources you need to help you navigate your personal journey. This includes up to $100 in well-being dollars, dedicated well-being navigators, and many programs, activities, articles, videos, personal coaching and tools to support you on your journey.  \nIn addition, Allina Health offers employee resources groups (ERGs) -- voluntary, employee-led groups that serve as a resource for members and organizations by fostering a diverse, inclusive workplace aligned with the organization's mission, values, goals, business practices, and objectives. Allina Health also engages employees in various community involvement and volunteering events.  \nBenefits include:\nMedical/Dental\nPTO/Time Away\nRetirement Savings Plans\nLife Insurance\nShort-term/Long-term Disability\nPaid Caregiver Leave\nVoluntary Benefits (vision, legal, critical illness)\nTuition Reimbursement or Continuing Medical Education as applicable\nStudent Loan Support Benefits to navigate the Federal Public Service Loan Forgiveness Program\nAllina Health is a 501(c)(3) eligible employer\n*Benefit eligibility/offerings are determined by FTE and if you are represented by a union.",
        "job_location": "Abbott Northwestern Hospital"
    },
    {
        "company": "Allina Health",
        "company_url": "https://allina.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Nursing Assistant Float",
        "job_href": "https://allina.wd5.myworkdayjobs.com/en-US/External/job/United-Hospital/Nursing-Assistant-Float_R-0065028?q=nurse",
        "job_posting_text": "locations\nUnited Hospital\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR-0065028\nLocation Address:\n333 Smith Ave N\nSaint Paul, MN 55102-2344\nDate Posted:\nJuly 10, 2025\nDepartment:\n34003820 Patient Care Floats\nShift:\nDay/Evening (United States of America)\nShift Length:\n8 hour shift\nHours Per Week:\n32\nUnion Contract:\nSEIU-4-United Service Workers-SUH\nWeekend Rotation: \nEvery Other\nJob Summary:\nAllina Health is a not-for-profit health system that cares for individuals, families and communities throughout Minnesota and western Wisconsin. If you value putting patients first, consider a career at Allina Health. Our mission is to provide exceptional care as we prevent illness, restore health and provide comfort to all who entrust us with their care. This includes you and your loved ones. We are committed to providing whole person care, investing in your well-being, and enriching your career.\nKey Position Details:\n0.8 FTE (64-hours per 2-week pay period)\n8-hour day/evening shifts\nEvery other weekend\nJob Description:\nUnder the direct supervision of a RN, assists in the delivery of patient care. This includes performing personal care such as feeding, bathing, dressing, grooming, moving and transporting patients, or changing linens. Collects and documents vital signs and other observations of patients.\n\nPrinciple Responsibilities\nPerforms personal care/interventions as assigned.\nCompletes interventions according to identified critical elements of each procedure.\nAnswers patient call lights promptly for both assigned and other patients.\nDistributes and sets up water, snacks and patient trays and assists patients.\nAssists patient with grooming and hygiene needs, maintains skin integrity, personal comfort and population specific needs of the patient.\nProvides assistance with ambulation, transfer, positioning and range of motion (ROM) according to activity order and needs of the patient.\nImplements activities of fall prevention plan as specified in plan of care.\nCollects and saves specimens.\nProvides assistance to the RN for admission, transfer, discharge and post-mortem care.\nMay transport medications excluding controlled substances within the site.\nObserves, collects and documents health status data as assigned.\nCompletes measurements according to critical elements of policy/procedures, which may include: temperatures, radial pulses, blood pressures, respirations, weights, intake and output.\nReports immediately to the RN observations/health status data that are not within normal limits for the patient or are significantly changed.\nDocuments according to documentation guidelines.\nContributes to an environment that is safe for patients, visitors and employees.\nProtects patient, self and others from injury during transfers, lifts and transports by using proper equipment and body mechanics.\nReports environmental risks or equipment malfunctions to supervisor.\nUses equipment following policies, procedures and manufacturer directions or standards.\nMay handle hazardous waste (identifies, segregates, and disposes of hazardous waste; ensures container integrity; knows emergency response procedures to spills, fires, and evacuation procedures).\nOther duties as assigned.\n\nRequired Qualifications\nMust meet one of the following requirements:\n◦ 18 years of age OR:\n◦ 17 years of age with high school diploma or GED\nMust meet one of the following requirements:\n◦ Successful completion of Certified Nursing Assistant (CNA) program OR:\n◦ Completion of one semester of clinical rotations within an accredited nursing program OR:\n◦ Completion of the Allina Health Nursing Assistant Academy Program OR:\n◦ Previous direct patient care experience\n\nLicenses/Certifications\nMust meet one of the requirements below:\n◦ Current BLS certification from the American Heart Association OR:\n◦ Current BLS certification from the American Red Cross OR:\n◦ Allina in-house BLS training within 30 days of hire\n\nPhysical Demands\nMedium Work*:\nLifting weight up to 32 lbs. occasionally (*Allina Safe Patient Moving Policy), up to 25 lbs. frequently\nPay Range\nPay Range: $20.71 to $26.97 per hour\nThe pay described reflects the base hourly pay range. Your starting rate would depend on a variety of factors including, but not limited to, your experience, education, and the union agreement (if applicable). Shift, weekend and/or other differentials may be available to increase your pay rate for certain shifts or work.\nBenefit Summary\nAllina Health believes the best way to provide safe and compassionate care for our patients is by nurturing the passion of those who care for them. That’s why we devote extraordinary resources to help you grow and thrive — not only as a professional but also as a whole person. When you join our team, you have access to a wealth of valuable employee benefits that support the total well-being — mind, body, spirit and community — of you and your family members. \nAllina Health is all in on your well-being. Because well-being means something different to everyone, our award-winning program provides you with the resources you need to help you navigate your personal journey. This includes up to $100 in well-being dollars, dedicated well-being navigators, and many programs, activities, articles, videos, personal coaching and tools to support you on your journey.  \nIn addition, Allina Health offers employee resources groups (ERGs) -- voluntary, employee-led groups that serve as a resource for members and organizations by fostering a diverse, inclusive workplace aligned with the organization's mission, values, goals, business practices, and objectives. Allina Health also engages employees in various community involvement and volunteering events.  \nBenefits include:\nMedical/Dental\nPTO/Time Away\nRetirement Savings Plans\nLife Insurance\nShort-term/Long-term Disability\nPaid Caregiver Leave\nVoluntary Benefits (vision, legal, critical illness)\nTuition Reimbursement or Continuing Medical Education as applicable\nStudent Loan Support Benefits to navigate the Federal Public Service Loan Forgiveness Program\nAllina Health is a 501(c)(3) eligible employer\n*Benefit eligibility/offerings are determined by FTE and if you are represented by a union.",
        "job_location": "United Hospital"
    },
    {
        "company": "Memorial Hermann Health System",
        "company_url": "https://memorialhermann.wd5.myworkdayjobs.com/external?q=nurse",
        "job_title": "Advanced Practice Provider - CVICU/CVIMU (FT, Night)",
        "job_href": "https://memorialhermann.wd5.myworkdayjobs.com/en-US/external/job/TMCChildrens-Hospital/Advanced-Practice-Provider---CVICU-CVIMU--FT--Night-_100171465?q=nurse",
        "job_posting_text": "locations\nTMC/Children's Hospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\n100171465\nAt Memorial Hermann, we pursue a common goal of delivering high quality, efficient care while creating exceptional experiences for every member of our community. When we say every member of our community, that includes our employees. We know that when our employees feel cared for, heard and valued, they are inspired to create moments that exceed expectations, while prioritizing safety, compassion, personalization and efficiency. If you want to advance your career and contribute to our vision of creating healthier communities, now and for generations to come, we want you to be a part of our team.\nJob Summary\n*Rotating weekends & holidays; No call\n*3X12 hour shifts/week - 7p-7a (paid for 40 hrs)\n*Schedule flexibility depending on unit needs \n*AGACNP required; No FNP\n*2-3 years of RN or NP Cardiac Critical Care experience required\n*New NPs MUST have 2-3 years of RN experience with Critical Care ICU, Cardiac Care, fresh transplants, and hemodynamic monitoring\n*Patient populations include CT surgery patients, endovascular and open aortic repairs, and CABG/Valves\n*8% geographical differential for the medical center\n\nPosition responsible for providing serving as expert clinician, educator, consultant, case manager, and researcher; in collaboration with the medical and nursing staff, monitors the clinical care of patients and provides clinical support to improve patient care and patient outcomes.\nJob Description\nMinimum Qualifications\nEducation: Masters degree in Nursing with certification by the American Nurse Credentialing Center or the Pediatric Nursing Certification in area of intended practice\nLicenses / Certifications:\nCurrent State of Texas license to practice professional nursing\nCertified in Basic Life Support; current Advanced Cardiac Life Support (ACLS) or obtains certification within three (3) months of hire\nExperience / Knowledge / Skills:\nThree (3) years clinical nursing experience in area of intended practice; two (2) years experience in an Advanced Practice role\nPrincipal Accountabilities\nRole of Clinical Expert\nDevelops and assists in the implementation of nursing care plans and standards specific to the age/needs of the patient/population served.\nAssists and provides direction to nursing staff with clinical decision-making and priority setting; models excellence in nursing practice through the utilization of advanced concepts in the areas of assessment, diagnosis, planning, implementation and evaluation of perceived, actual or potential problems that occur in a variety of patient populations.\nFunctions as a facilitator and innovator for state-of-the-art nursing care with direct involvement in implementing and evaluating new techniques and equipment for safety, cost-effectiveness, and benefits related to nursing practice.\nCompletes history and physical on patients as indicated; writes medical orders per established protocols; provides approved clinical services, including removal of sutures, and complex wound care.\nPerforms daily rounds on assigned physician patients. Assesses the health status of assigned patients by collecting and analyzing patient data and evaluating the appropriateness of care.\nRole of Educator\nAssists patients, their significant others, and families in the acquisition of information related to health and wellness, including the prevention of illness and injury; develops and implements educational information, materials, and programs for discharge planning and teaching of healthcare consumers.\nServes as a resource to nursing staff, nursing students, and other health care personnel in the acquisition of knowledge and skills related to nursing knowledge.\nContributes to professional nursing literature by publishing scholarly works; contributes to nursing education as a faculty member.\nRole of Researcher\nExpands the scientific base of nursing practice by conducting and facilitating nursing research; disseminates research findings through presentations and publications.\nCritically analyzes current nursing research methods and results for utilization in the expansion and improvement of patient care and patient outcomes.",
        "job_location": "TMC/Children's Hospital"
    },
    {
        "company": "Ohio Health",
        "company_url": "https://ohiohealth.wd5.myworkdayjobs.com/OhioHealthJobs?q=nurse",
        "job_title": "Administrative Nurse Manager/Flex Team",
        "job_href": "https://ohiohealth.wd5.myworkdayjobs.com/en-US/OhioHealthJobs/job/INFORMATION-SERVICES/Administrative-Nurse-Mgr_JR134101?q=nurse",
        "job_posting_text": "locations\nINFORMATION SERVICES\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nJR134101\nWe are more than a health system. We are a belief system. We believe wellness and sickness are both part of a lifelong partnership, and that everyone could use an expert guide. We work hard, care deeply and reach further to help people uncover their own power to be healthy. We inspire hope. We learn, grow, and achieve more – in our careers and in our communities.\nJob Description Summary:\nThis position ensures the delivery of evidence-based practice by professional nursing personnel and other staff in the designated area of responsibility.  They are responsible for planning, organizing, directing, and evaluating the delivery of evidence-based patient care in a cost effective manner.  The Manager operationalizes the Nursing Philosophy along with the mission, vision, values, goals and objectives of OhioHealth.  They are accountable and responsible for administrative and fiscal management of the department and in meeting the goals in all four quadrants of the balanced scorecard at the unit/department level. In addition, they will contribute significantly to the overall goals and objectives of the organization.\nResponsibilities And Duties:\n30% Patient Care\nAssumes accountability for ongoing delivery of patient care during all operating hours; maintains a broad awareness of daily operations to guide patient care delivery; assures application of the nursing process by Registered Nurses in the clinical setting assessment, planning, implementation and evaluation ; assures documentation of patient care in the medical record. Uses data from various sources to initiate continuous quality improvement at the unit level. Coordinates nursing care in collaboration with other healthcare disciplines and assists in integrating services across the continuum of health care. Accountable for nursing practice in a safe environment. Participates in process improvement activities and root cause analysis investigations.\n30%\nOperations and Personnel Management\n1. Develops and is responsible for annual operational and capital budget. Manages resources to remain within established budget and controls materials, supplies, and equipment necessary for unit operations. Ensures that budget and program objectives are met.\n2. Develops budgeted fiscal year staffing plans. Develops, maintains, and evaluates effectiveness of position control i.e. development of labor budget, determination of FTEs, scheduling FTEs and final approval to ensure compliance with staff plan .\n3. Ensures provision of qualified human resources to identified patient care needs; develops, coordinates and approves staffing time schedules, considering scope of practice, competencies, patient needs, and staff competency.\n4. Responsible for recruitment, selection, retention and evaluation of personnel. Ensures appropriate orientation, training, competence, continuing education, and professional growth and development of personnel.\n5. Effectively evaluates performance of personnel. Advocates work environment that minimizes work-related illness or injury.\n6. Assesses impact of, and plans strategies to address, diversity, ethics and the changing needs of society. Strives to provide a workforce reflecting population diversity. Ensures delivery of culturally competent care and healthy, safe working environment.\n7. Uses information systems to retrieve, implement, and retain essential records and services.\n15% Leadership\n1. Facilitates development of leadership activities and promotes staff and self-attendance at meetings and educational programs. Actively participates in organizational committees and decision making.\n2. Provides input into executive level decisions; keeps staff informed of executive level activities.\n3. Facilitates atmosphere of participative management and development of collegial relationships among nursing staff; ensures registered nurse participation in decision making at the unit level. Participates on Shared Governance Councils. Serves as a link between nursing staff and other health care disciplines, both within and outside of organized nursing services. Actively participates in interdepartmental relationship building.\n4. Participates in nursing policy formation and decision making. Identifies methods to achieve and monitor compliance with requirements of regulatory organizations.\n5. Participates in renovation and project management.\n6. Actively participates in service line growth and practice innovation.\n7. Actively participates in strategic planning activities.\n15% Professional Development\n1. Contributes to development of self and staff through educational programs to meet identified learning needs and through written performance recognition and/or disciplinary procedures.\n2. Facilitates and encourages staff to obtain relevant specialty certification. Earns and maintains appropriate specialty certification.\n3. Participates in education of nursing and other students in health care environment.\n4. Participates and encourages staff to participate in organizational policy formation and decision making.\n5. Actively participates in divisional, departmental and hospital/organization activities. Develops and maintains professional competencies by attending educational programs and participation in professional organizations. Seeks opportunities for publication, presentation, and professional leadership in professional and community societies.\n6. Serves as a member or officer of community groups or agencies; participates and assumes leadership roles in professional organizations and encourages staff participation.\n10% Research and Evidence-Based Practice\n1. Ensures an evidence-based practice environment. Facilitates dissemination of research findings and integration of evidence-based guidelines and practices in the health care setting.\n2. Identifies areas of clinical and administrative inquiry suitable for nurse researchers.3\n. Identifies key measures for department success, based on hospital/organization goal and objectives. Monitors progress of goals and develops actions to attain goals.\n4. Communicates goals to staff and others in the organization.\nMinimum Qualifications:\nBachelor's Degree  (Required)BLS - Basic Life Support - American Heart Association, RN - Registered Nurse - Ohio Board of Nursing\nAdditional Job Description:\nSpecialized Knowledge: Process improvement skills. Project management skills. May require advance training in specialty areas. Skills in computer applications as appropriate to area(s) of responsibility. Demonstrated skills in interpersonal relationships, verbal and written communication, management, adult education and nursing practice standards. Minimum 3 years clinical nursing experience. Previous leadership experience such as precepting, charge role, clinical lead role, mentoring, or department committee leadership.\nWork Shift:\nDay\nScheduled Weekly Hours :\n40\nDepartment\nFlex Pool Administrators\nJoin us!\n... if your passion is to work in a caring environment\n... if you believe that learning is a life-long process\n... if you strive for excellence and want to be among the best in the healthcare industry\nEqual Employment Opportunity\nOhioHealth is an equal opportunity employer and fully supports and maintains compliance with all state, federal, and local regulations. OhioHealth does not discriminate against associates or applicants because of race, color, genetic information, religion, sex, sexual orientation, gender identity or expression, age, ancestry, national origin, veteran status, military status, pregnancy, disability, marital status, familial status, or other characteristics protected by law. Equal employment is extended to all person in all aspects of the associate-employer relationship including recruitment, hiring, training, promotion, transfer, compensation, discipline, reduction in staff, termination, assignment of benefits, and any other term or condition of employment ",
        "job_location": "INFORMATION SERVICES"
    },
    {
        "company": "Centene Corporation",
        "company_url": "https://centene.wd5.myworkdayjobs.com/centene_external?q=nurse",
        "job_title": "Clinical Review Nurse - Correspondence",
        "job_href": "https://centene.wd5.myworkdayjobs.com/en-US/centene_external/job/Little-Rock---One-Allied-Dr---Building-Two---Ste-2520-AR-Health--Wellness-10164/Clinical-Review-Nurse---Correspondence_1579550-1?q=nurse",
        "job_posting_text": "locations\nLittle Rock - One Allied Dr. - Building Two - Ste 2520 (AR Health & Wellness) (10164)\nRemote-AR\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\n1579550\nYou could be the one who changes everything for our 28 million members as a clinical professional on our Medical Management/Health Services team. Centene is a diversified, national organization offering competitive benefits including a fresh perspective on workplace flexibility.\n Position Purpose: Drafts correspondence letters based on review outcomes in accordance with National Committee for Quality Assurance (NCQA) standards. Works with senior management to identify and implement opportunities for improvement.\nPerforms clinical review of outcomes including creating and editing denial letters with the correspondence team based on denial determinations in accordance with National Committee for Quality Assurance (NCQA) standards\nContributes to correspondence letter template creation and maintenance with the correspondence team\nInvestigates denials through comprehensive review of clinical documentation, clinical criteria/guidelines, and policy, including insurance rejections due to coding issues and provides supplemental information to resolve denial claims\nAssists with issues and/or questions related to correspondence with the state, local, and federal agencies including third party payer to ensure issues are resolved in a timely manner\nMaintains and monitors cases to ensure timely resolution and logs of actions and/or decisions are appropriately documented\nCoordinates with interdepartmental teams on training needed within the utilization management team based on trends\nProvides feedback to leadership to improve clinical processes and procedures to prevent recurrences based on industry best practices\nPerforms other duties as assigned\nComplies with all policies and standards\nEducation/Experience: Requires Graduate from an Accredited School of Nursing or Bachelor’s degree in Nursing and 2 – 4 years of related experience.\n\nKnowledge of Medicare and Medicaid regulations preferred.\nKnowledge of utilization management processes preferred.\n\nLicense/Certification:\nLPN - Licensed Practical Nurse - State Licensure required and\nWork Location: Remote\nSchedule: 12:00 PM – 9:00 PM CST\nPreferred Experience: Drafting correspondence letters based on review outcomes, with knowledge of NCQA standards\nPay Range: $26.50 - $47.59 per hour\nCentene offers a comprehensive benefits package including: competitive pay, health insurance, 401K and stock purchase plans, tuition reimbursement, paid time off plus holidays, and a flexible approach to work with remote, hybrid, field or office work schedules.  Actual pay will be adjusted based on an individual's skills, experience, education, and other job-related factors permitted by law, including full-time or part-time status.  Total compensation may also include additional forms of incentives.  Benefits may be subject to program eligibility.\nCentene is an equal opportunity employer that is committed to diversity, and values the ways in which we are different. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other characteristic protected by applicable law.\n\nQualified applicants with arrest or conviction records will be considered in accordance with the LA County Ordinance and the California Fair Chance Act",
        "job_location": "2 Locations"
    },
    {
        "company": "Centene Corporation",
        "company_url": "https://centene.wd5.myworkdayjobs.com/centene_external?q=nurse",
        "job_title": "Clinical Review Nurse - Prior Authorization",
        "job_href": "https://centene.wd5.myworkdayjobs.com/en-US/centene_external/job/San-Antonio---10130-State-Hwy-151-Ste-121-11077/Clinical-Review-Nurse---Prior-Authorization_1572875-1?q=nurse",
        "job_posting_text": "locations\nSan Antonio - 10130 State Hwy 151, Ste 121 (11077)\nRemote-MS\nRemote-OR\nRemote-TX\nRemote-CA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\n1572875\nYou could be the one who changes everything for our 28 million members as a clinical professional on our Medical Management/Health Services team. Centene is a diversified, national organization offering competitive benefits including a fresh perspective on workplace flexibility.\n Qualified candidates must hold an active RN license in one of the following states: California, Mississippi, Texas, or Oregon.\nPosition Purpose: Analyzes all prior authorization requests to determine medical necessity of service and appropriate level of care in accordance with national standards, contractual requirements, and a member's benefit coverage. Provides recommendations to the appropriate medical team to promote quality and cost effectiveness of medical care.\nPerforms medical necessity and clinical reviews of authorization requests to determine medical appropriateness of care in accordance with regulatory guidelines and criteria\nWorks with healthcare providers and authorization team to ensure timely review of services and/or requests to ensure members receive authorized care\nCoordinates as appropriate with healthcare providers and interdepartmental teams, to assess medical necessity of care of member\nEscalates prior authorization requests to Medical Directors as appropriate to determine appropriateness of care\nAssists with service authorization requests for a member’s transfer or discharge plans to ensure a timely discharge between levels of care and facilities\nCollects, documents, and maintains all member’s clinical information in health management systems to ensure compliance with regulatory guidelines\nAssists with providing education to providers and/or interdepartmental teams on utilization processes to promote high quality and cost-effective medical care to members\nProvides feedback on opportunities to improve the authorization review process for members\nPerforms other duties as assigned\nComplies with all policies and standards\nEducation/Experience:\nRequires Graduate from an Accredited School of Nursing or Bachelor’s degree in Nursing and 2 – 4 years of related experience. Clinical knowledge and ability to analyze authorization requests and determine medical necessity of service preferred. Knowledge of Medicare and Medicaid regulations preferred. Knowledge of utilization management processes preferred.\n\nLicense/Certification:\nOregon RN licensure required OR\nCalifornia RN licensure required OR\nTexas RN licensure required OR\nMississippi RN licensure required\nPay Range: $26.50 - $47.59 per hour\nCentene offers a comprehensive benefits package including: competitive pay, health insurance, 401K and stock purchase plans, tuition reimbursement, paid time off plus holidays, and a flexible approach to work with remote, hybrid, field or office work schedules.  Actual pay will be adjusted based on an individual's skills, experience, education, and other job-related factors permitted by law, including full-time or part-time status.  Total compensation may also include additional forms of incentives.  Benefits may be subject to program eligibility.\nCentene is an equal opportunity employer that is committed to diversity, and values the ways in which we are different. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other characteristic protected by applicable law.\n\nQualified applicants with arrest or conviction records will be considered in accordance with the LA County Ordinance and the California Fair Chance Act",
        "job_location": "5 Locations"
    },
    {
        "company": "Air Products",
        "company_url": "https://airproducts.wd5.myworkdayjobs.com/AP0001?q=nurse",
        "job_title": "Business Development Manager (m/w/d)",
        "job_href": "https://airproducts.wd5.myworkdayjobs.com/en-US/AP0001/job/Residence-West-Germany-0992/Business-Development-Manager_JR-2025-16846?q=nurse",
        "job_posting_text": "locations\nResidence West Germany (0992)\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nJR-2025-16846\nAt Air Products, our purpose is to bring people together to reimagine what’s possible, collaborate and innovate solutions to the world’s most significant energy and environmental sustainability challenges. Grow with us as we embark on building tomorrow together by being the safest, most diverse and most profitable industrial gas company in the world.  \nReimagine What’s Possible\nDu bist ein echtes Vertriebstalent mit Begeisterung für Technik und den direkten Draht zum Kunden?\nDann gestalte mit uns die Zukunft der Gasversorgung – kundenorientiert, innovativ und nachhaltig!\nFür unser wachsendes Gasegeschäft suchen wir Dich als Vertriebsmitarbeiter (m/w/d) im Außendienst für den Vertrieb von technischen Gasen in Flaschen und Kleintankanlagen (CryoEase®) im westlichen Baden-Württemberg und angrenzenden Rheinland-Pfalz.\nDeine Aufgaben:\nDu betreust und entwickelst Dein Vertriebsgebiet im westlichen Baden-Württemberg und angrenzenden Rheinland-Pfalz\nDu gewinnst neue Kunden aus dem produzierendem Gewerbe und Industrie für unsere Gaslösungen\nDu pflegst langfristige Beziehungen zu Bestandskunden und Vertriebspartnern\nDu arbeitest eng mit dem Innendienst zusammen und entwickelst Dein Gebiet strategisch weiter\nDu führst eigenständig Besuchstermine, Verhandlungen und Jahresgespräche\nDu baust Dir ein starkes Netzwerk zu Marktpartnern, Verbänden und Organisationen auf\nDu vertrittst unser Unternehmen auf Fachveranstaltungen und Messen\nDas bringst Du mit:\nEine abgeschlossene kaufmännische oder technische Ausbildung\nErfahrung im Außendienst oder technischen Vertrieb\nBegeisterung für den Kundenkontakt und ein Gespür für neue Geschäftsmöglichkeiten\nKommunikationsstärke, Verhandlungsgeschick und ein sicheres Auftreten\nTechnisches Verständnis – idealerweise für die metallverarbeitende Industrie\nFührerschein Klasse B und Lust auf eigenverantwortliches Arbeiten im Außendienst\nWas wir Dir bieten:\nEine verantwortungsvolle Position mit viel Gestaltungsspielraum\nEin motiviertes Team und direkter Austausch mit dem Management\nEin attraktives Gehaltspaket mit 13. Monatsgehalt, Urlaubsgeld und 30 Tagen Urlaub\nEinen Firmenwagen – auch zur privaten Nutzung\nDie Möglichkeit, Dir ein JobRad zu leasen\nFlexible Arbeitszeiten – weil wir wissen, dass das Leben nicht nur aus Arbeit besteht\nEin nachhaltiges Arbeitsumfeld mit klaren Umweltzielen\nEine positive Employee Experience – vom ersten Tag bis zur Rente\nBereit für den nächsten Karriereschritt?\nDann bewerben Sie sich jetzt online.\nEinsatzgebiet: Westliches Baden-Württemberg & angrenzendes Rheinland-Pfalz\nStartdatum: Schnellstmöglich\nBerichtslinie: Vertriebsleitung Südwest\nWe are the world’s largest hydrogen producer with over 80 years of industrial gas experience. We are hydrogen and industrial gas experts delivering safe, end-to-end solutions, investing in real, clean energy projects at scale, and driving the industry forward to generate a cleaner future.\nAt Air Products, we work in an environment where we put safety first, diversity is essential, inclusion is our culture, and each person knows they belong and matter. To learn more, visit About Air Products. ",
        "job_location": "Residence West Germany (0992)"
    },
    {
        "company": "Air Products",
        "company_url": "https://airproducts.wd5.myworkdayjobs.com/AP0001?q=nurse",
        "job_title": "Account Manager - Hydrogen Operations",
        "job_href": "https://airproducts.wd5.myworkdayjobs.com/en-US/AP0001/job/Edmonton-Alberta/Account-Manager_JR-2025-16133?q=nurse",
        "job_posting_text": "locations\nEdmonton, Alberta\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nJR-2025-16133\nAt Air Products, our purpose is to bring people together to reimagine what’s possible, collaborate and innovate solutions to the world’s most significant energy and environmental sustainability challenges. Grow with us as we embark on building tomorrow together by being the safest, most diverse and most profitable industrial gas company in the world.  \nReimagine What’s Possible\nAre you a driven and results-oriented professional with a passion for building strong client relationships in the chemical industry? We are seeking a dynamic Account Manager to join our hydrogen business team in Edmonton, Alberta.\nThe successful candidate will possess strong business acumen and technical background as well as a passion for impacting the bottom line. The position requires a highly motivated, self-starter with strong analytical skills who is capable of independent learning. Associated with the position is the potential for growth within the role and beyond, commensurate with the candidate’s skills and development.\nIn this role, the Account Manager will work closely with various functions including operations, business development, environmental, finance, and accounting to achieve business objectives.\nWhat's In It for You: \nAt Air Products we foster a culture of inclusion where every voice is heard, and everyone feels they belong and matter. Additionally, we offer competitive pay and great benefits for our employees. Check out some of our benefits below!\nAffordable Medical, Dental and Vision Insurance (on day 1 of employment)\nPaid vacation and holidays\nLife Insurance (Basic Life - Paid for by Air Products) & Optional Life Insurance\nDefined Contribution Pension Plan (DCPP) at 4% of base pay\nCompany matched RRSP plan\nHealthcare Spending Account\nMany more supplemental benefits available \nRequired Skills / Abilities:  \nExcellent analytical skills and business acumen – ability to formulate and articulate winning strategies and value creation for clients.\nThe ability to build relationships and influence is essential for success in this role.\nProven ability to lead and influence cross-functional teams to deliver timely customer-facing products/proposals.\nExcellent interpersonal communication and technical skills are required to effectively use working relationships with key stakeholders to achieve business objectives.\nMust be a self-starter with strong problem-solving skills and an ability to work in a lean organization. \nDemonstrated strong critical thinking skills and must be attentive to detail.\nStrong working knowledge of Microsoft Office (Excel, Word, Power Point).\nKey Job Responsibilities:\nDevelop and effectively lead high-quality, long-term Client relationships for assigned accounts. Manage product supply/demand forecasts, contract compliance, invoicing data and accounts receivable. \nDevelop and execute strategies for contract renewals, protecting the base business.\nCollaborating closely with operations, provide commercial guidance on the overall production and transportation of hydrogen aimed at improving overall profitability.\nStrong focus on safety, reliability, efficiency, cost management, and overall system optimization.\nIdentify and evaluate alternatives to mitigate business and operational risks.\nDevelop a solid understanding of the technical aspects of hydrogen feedstock sourcing, production, distribution and fueling to communicate the advantages of hydrogen to key stakeholders. \nPerform economic evaluations to justify and prioritize the execution of productivity projects to achieve business targets.  \nDevelop presentations and technical reports required for internal stakeholders and clients.\nUnderstand client’s technical/operational requirements. Keep current on market, client and industry trends and evaluate/communicate impacts on business as well as potential for opportunities. Complete opportunity assessments, technology comparisons, and budgetary proposals.\nMinimum Hiring Requirements:\nBachelor’s degree in engineering preferred (registered with APEGA)\nMBA an asset.\n5 to 6 years of related experience in business or technical roles in a plant environment is required,\nKnowledge of chemical, petrochemical, refining & upgrading operations preferred.\nUnderstanding evolving carbon policies, including provincial GHG programs viewed favorably.\nTravel:\nTravel expectation is 15% within Alberta and some travel to Ontario.\nMust possess a valid driver’s license and the ability to travel within Canada & the US.\nJoin Air Products, where we proudly value the skills, dedication, and leadership that Veterans bring to the table. As a Veteran-friendly organization, we actively encourage and welcome Veterans to apply for various roles within our company. We recognize the unique strengths and experiences that Veterans contribute, and we foster a workplace that honors your service while providing a platform for professional growth.  \n   #LI-Hybrid \n#LI-AT1\n#INDGIG\nWe are the world’s largest hydrogen producer with over 80 years of industrial gas experience. We are hydrogen and industrial gas experts delivering safe, end-to-end solutions, investing in real, clean energy projects at scale, and driving the industry forward to generate a cleaner future.\nAt Air Products, we work in an environment where we put safety first, diversity is essential, inclusion is our culture, and each person knows they belong and matter. To learn more, visit About Air Products. \nAir Products offers a competitive salary, extensive health benefits package, company paid pension and company matched RRSP plans.  \nWe strive to be inclusive of the diversity of our employees, invest in their development and foster a collaborative and respectful work environment where all employees feel like they belong and matter.   \nWe are committed to employment equity for women, aboriginal people, visible minorities, and persons with disabilities. We are an Equal opportunity employer. All qualified applicants will receive consideration for employment regardless of their background. In accordance with AODA, applicants with disability requiring accommodation during the recruitment process are encouraged to make their needs known in advance.   \nDue to Canadian Immigration regulations, we are only able to consider applications from Canadian citizens or other individuals legally entitled to work in Canada.  \n \nWe thank all applicants in advance for their interest, however only those being considered will be contacted.  ",
        "job_location": "Edmonton, Alberta"
    }
]