[
    {
        "company": "Intermountain Healthcare (IMH)",
        "company_url": "https://imh.wd5.myworkdayjobs.com/IntermountainCareers?q=nurse",
        "job_title": "Registered Respiratory Therapist PRN1",
        "job_href": "https://imh.wd5.myworkdayjobs.com/en-US/IntermountainCareers/job/Intermountain-Health-Lutheran-Hospital/Registered-Respiratory-Therapist-PRN1_R140300?q=nurse",
        "job_posting_text": "locations\nIntermountain Health Lutheran Hospital\ntime type\nPart time\nposted on\nPosted Today\ntime left to apply\nEnd Date: May 31, 2025 (6 days left to apply)\njob requisition id\nR140300\nJob Description:\nThe Respiratory Therapist RRT provides advanced-level respiratory care to patients designed to diagnose, evaluate, treat, manage, and control deficiencies and/or abnormalities of the cardiopulmonary system within the prescription of the order physician. This position acts as a resource to the CRT staff. The RRT may be responsible for special clinical projects or assignments as designated by leadership according to the needs of the department.\nClick here to learn more about Intermountain Health Respiratory Therapy! \nClick Here to schedule a phone call with a recruiter!\nPosting Specifics:\nHours: PRN\nDays/Evenings\nBenefits Eligible: No\nAdditional Details: Shift differentials given for evenings, nights and weekends\nEssential Functions\nPerforms, interprets, and evaluates diagnostic testing procedures according to protocol. Obtains arterial gases. Oversees and troubleshoots the operation of equipment for optimal patient care. Initiates Respiratory Protocol according to department criteria. Initiates interventions based on the interpretation of assessments.\nAdministers medications in a timely and safe manner. Evaluates effect and re-evaluates appropriately and according to protocol. Ensures that progress of patient is communicated to staff, physicians and other departments.\nMaintains awareness of assigned patient’s overall condition. Communicates and shares patient information with the physicians and nurses. Makes appropriate recommendations for patient care. Recognizes the educational needs of patients and families in relation to health promotion and wellness. Teaches patients and families self-care techniques and modalities.\nCompletes documentation according to departmental standards. Accurately documents productivity information. Monitors supplies and equipment and notifies appropriate person when supplies are low, out on loan or broken. Utilizes time effectively to achieve productivity standard, including utilizing low census time when patient load does not support full productivity. \nParticipates in quality and patient safety initiatives. Identifies potential areas for improvement including processes that could be streamlined or revised to improve patient satisfaction. Identifies potential safety hazards that may create problems for patients and/or staff and takes appropriate actions. Participates in departmental meetings, contributing ideas or feedback.\nPromotes the profession of Respiratory Care and acts as a resource, consultant, and mentor to staff within department and patient care areas through development of others.\nParticipates in quality improvement and research activities as part of the Respiratory Care Team to guide the development of standards of patient care.\nMay be required to float to other departments (within scope of competency and qualifications) based on business need.\nMay be required to be placed on-call during a regularly scheduled shift.\nMinimum Qualifications\nGraduate of a NBRC approved Respiratory Therapist program is required. Education must be obtained from an accredited institution. Degree will be verified.\nRegistered by the National Board for Respiratory Care (RRT). \nCurrent license as Registered Respiratory Therapy in the state of practice is required.\nBasic Life Support (BLS) for healthcare providers is required.\nSpecific certifications as required (i.e. PALS, ACLS, NRP) is required.\nPhysical Requirements:\nPhysical Requirements\nOngoing need for employee to see and read information, labels, assess patient needs, operate monitors, identify equipment and supplies.\nFrequent interactions with patient care providers, patients, and visitors that require employee to verbally communicate as well as hear and understand spoken information, alarms, needs, and issues quickly and accurately, particularly during emergency situations.\n Manual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use and typing for documenting patient care, accessing needed information, medication preparation, etc.\nExpected to lift and utilize full range of movement to transfer patients. Will also bend to retrieve, lift, and carry supplies and equipment. Typically includes items of varying weights, up to and including heavy items.\nNeed to walk and assist with transporting/ambulating patients and obtaining and distributing supplies and equipment. This includes pushing/pulling gurneys and portable equipment, including heavy items. Often required to navigate crowded and busy rooms (full of equipment, power cords on the floor, etc.).\nMay be expected to stand in a stationary position for an extended period of time.\nLocation:\nIntermountain Health Lutheran Hospital\nWork City:\nWheat Ridge\nWork State:\nColorado\nScheduled Weekly Hours:\n0\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience. \n$30.94 - $47.77\nWe care about your well-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged. \nLearn more about our comprehensive benefits package here.\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\nAt Intermountain Health, we use the artificial intelligence (\"AI\") platform, HiredScore to improve your job application experience. HiredScore helps match your skills and experiences to the best jobs for you. While HiredScore assists in reviewing applications, all final decisions are made by Intermountain personnel to ensure fairness. We protect your privacy and follow strict data protection rules. Your information is safe and used only for recruitment. Thank you for considering a career with us and experiencing our AI-enhanced recruitment process.\nAll positions subject to close without notice.",
        "job_location": "Intermountain Health Lutheran Hospital"
    },
    {
        "company": "Roswell Park Comprehensive Cancer Center",
        "company_url": "https://roswellpark.wd5.myworkdayjobs.com/ExternalCareers?q=nurse",
        "job_title": "Nurse I/Nurse II - Inpatient Float Pool (Third Shift/Full Time)",
        "job_href": "https://roswellpark.wd5.myworkdayjobs.com/en-US/ExternalCareers/job/Hospital/Nurse-I-Nurse-II---Inpatient-Float-Pool--Third-Shift-Full-Time-_R-19275?q=nurse",
        "job_posting_text": "locations\nHospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-19275\nTitle: \nNurse I/Nurse II - Inpatient Float Pool (Third Shift/Full Time)\nJob Type:\nRegular\nCompany:\nRoswell Park Comprehensive Cancer Center\nDepartment: \nNursing - Resource Pool\nTime Type: \nFull time\nWeekly Hours: \n37.5\nFTE:\n0.9375\nShift: \nThird Shift (United States of America)\nSummary: \nRoswell Park Comprehensive Cancer Center is seeking a full-time Nurse I or Nurse II for the Nursing - Resource Pool (Infusion Float Pool) department. The Nurse I plans, provides and supervises nursing interventions for individuals with cancer and cancer related health care problems; diagnoses and treats human responses to actual or potential health problems through such services as patient care, health teaching, and health counseling; provides interventions supportive to or restorative of life and well-being and executes medical regimens prescribed by a physician, dentist or other licensed health care provider authorized by the State Education Commissioner’s regulations; supervises Licensed Practical Nurses, Hospital Clinical Assistants and clinical secretaries in the provision of nursing interventions to patients; enhances professional growth and development through participation in educational programs, current literature, in-service meetings and workshops.\n\nThe Nurse II plans, provides and supervises nursing interventions for individuals with cancer and cancer-related health care problems; diagnoses and treats human responses to actual or potential health problems through such services as patient care, health teaching, and health counseling; provides interventions supportive to or restorative of life and well-being; executes medical regimens prescribed by a physician, dentist or other licensed health care provider authorized by the State Education Commissioner’s regulations; supervises Nurse I’s, Licensed Practical Nurses, Hospital Clinical Assistants and Clinical Support Assistants; performs administrative tasks with assigned area of responsibility; enhances professional growth and development through participation in educational programs, current literature, inservice meetings and workshops.\nQualifications:\nRequired Education and Experience\n\nLicense Requirement\nLicense to practice as a Registered Nurse in the State of New York.\nEducation and Experience\n1. Graduation from an accredited school of nursing and the equivalent of one (1) year of full-time oncology nursing experience; or\n2. Graduation from an accredited school of nursing and the equivalent of one (1) year of full-time critical care experience; or\n3. Graduation from an accredited school of nursing and the equivalent of three (3) years of full-time medical-surgical experience in an acute care setting; or\n4. Graduation from an accredited school of nursing, the equivalent of one (1) year of full-time medical-surgical experience in an acute care setting and completion of Roswell Park nursing orientation with the ability to function independently at a satisfactory level for three (3) months (full-time) as a Nurse I at Roswell Park.\n\nNOTES:\n1. Incumbents will serve a one (1) year full-time probationary period as a Nurse II.\n2. Required degrees must have been granted by an accredited college or university or one recognized by Roswell Park Comprehensive Cancer Center as following acceptable educational practices.\nEqual Employment Opportunity Statement\nRoswell Park Cancer Institute Corporation (RPCIC) and Health Research Inc. (HRI) Roswell Park Division believe that all persons are entitled to equal employment opportunities, and we do not discriminate against our employees, applicants or job seekers because of their race, color, religion, sex, sexual orientation, gender identity or expression, national origin, creed, age, disability, pregnancy-related condition, military or veteran status, marital or familial status, domestic violence victim status, citizenship status, genetic information, individual’s relationship or association with a member of a protected category or any other protected group status as defined by law.\nReasonable Accommodation Request\nRPCIC and HRI are committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the employment process, please email HR-PayAndBenefits@RoswellPark.org and let us know the nature of your request and your contact information.\nOur Core Values\nRPCIC and HRI are committed to providing an environment where patients, families, employees and community are treated with courtesy and respect. We support an inclusive environment that nurtures the talents, skills and abilities of each individual to embody and reflect our core values: Innovation, Integrity, Teamwork, Commitment, Compassion and Respect.\nHistorical Compensation Information Statement \nPursuant to Executive Order 161, no State entity, as defined by the Executive Order, is permitted to ask, or mandate, in any form, that an applicant for employment provide his or her current compensation, or any prior compensation history, until such time as the applicant is extended a conditional offer of employment with compensation. If such information has been requested from you before such time, please contact the Governor’s Office of Employee Relations at (518) 474-6988 or via email at info@goer.ny.gov.",
        "job_location": "Hospital"
    },
    {
        "company": "Roswell Park Comprehensive Cancer Center",
        "company_url": "https://roswellpark.wd5.myworkdayjobs.com/ExternalCareers?q=nurse",
        "job_title": "Nurse I (First Shift/Full Time)",
        "job_href": "https://roswellpark.wd5.myworkdayjobs.com/en-US/ExternalCareers/job/Roswell/Nurse-I--First-Shift-Full-Time-_R-19469?q=nurse",
        "job_posting_text": "locations\nRoswell\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-19469\nTitle: \nNurse I (First Shift/Full Time)\nJob Type:\nRegular\nCompany:\nRoswell Park Comprehensive Cancer Center\nDepartment: \nNursing - 6 West\nTime Type: \nFull time\nWeekly Hours: \n37.5\nFTE:\n0.9375\nShift: \nFirst Shift (United States of America)\nSummary: \nPlans, provides and supervises nursing interventions for individuals with cancer and cancer related health care problems; diagnoses and treats human responses to actual or potential health problems through such services as patient care, health teaching, and health counseling; provides interventions supportive to or restorative of life and well-being and executes medical regimens prescribed by a physician, dentist or other licensed health care provider authorized by the State Education Commissioner’s regulations; supervises Licensed Practical Nurses, Hospital Clinical Assistants and clinical secretaries in the provision of nursing interventions to patients; enhances professional growth and development through participation in educational programs, current literature, in-service meetings and workshops.\nQualifications:\nRequired Education and Experience\n\nLicense Requirement\nLicense to practice as a Registered Nurse in the State of New York.\nEducation and Experience\n1. Graduation from an accredited school of nursing1; or\n2. Graduation from an accredited school of nursing and prior experience working in a nursing home, psychiatric facility or other sub-acute facility1; or\n3. Graduation from an accredited school of nursing and the equivalent of one (1) year of full-time medical-surgical experience in an acute care setting. 2\n\nNOTES:\n1. Incumbents must serve a one (1) year full-time probationary period as a Nurse I in order to be eligible for promotion to a Nurse II.\n2 Upon successful completion of orientation and the ability to function independently at a satisfactory level for three (3) months (full-time), the incumbent would be eligible to be promoted to a Nurse II. This individual would then serve a one (1) year full-time probationary period as a Nurse II.\n3. Required degrees must have been granted by an accredited college or university or one recognized by Roswell Park Comprehensive Cancer Center as following acceptable educational practices.\nPreferred Candidate\nThe preferred candidate should have previous experience working as Patient Care Technician and/or working in a acute care setting.\nEqual Employment Opportunity Statement\nRoswell Park Cancer Institute Corporation (RPCIC) and Health Research Inc. (HRI) Roswell Park Division believe that all persons are entitled to equal employment opportunities, and we do not discriminate against our employees, applicants or job seekers because of their race, color, religion, sex, sexual orientation, gender identity or expression, national origin, creed, age, disability, pregnancy-related condition, military or veteran status, marital or familial status, domestic violence victim status, citizenship status, genetic information, individual’s relationship or association with a member of a protected category or any other protected group status as defined by law.\nReasonable Accommodation Request\nRPCIC and HRI are committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the employment process, please email HR-PayAndBenefits@RoswellPark.org and let us know the nature of your request and your contact information.\nOur Core Values\nRPCIC and HRI are committed to providing an environment where patients, families, employees and community are treated with courtesy and respect. We support an inclusive environment that nurtures the talents, skills and abilities of each individual to embody and reflect our core values: Innovation, Integrity, Teamwork, Commitment, Compassion and Respect.\nHistorical Compensation Information Statement \nPursuant to Executive Order 161, no State entity, as defined by the Executive Order, is permitted to ask, or mandate, in any form, that an applicant for employment provide his or her current compensation, or any prior compensation history, until such time as the applicant is extended a conditional offer of employment with compensation. If such information has been requested from you before such time, please contact the Governor’s Office of Employee Relations at (518) 474-6988 or via email at info@goer.ny.gov.",
        "job_location": "Roswell"
    },
    {
        "company": "Roswell Park Comprehensive Cancer Center",
        "company_url": "https://roswellpark.wd5.myworkdayjobs.com/ExternalCareers?q=nurse",
        "job_title": "Patient Care Technician",
        "job_href": "https://roswellpark.wd5.myworkdayjobs.com/en-US/ExternalCareers/job/Bieler-Clinical-Sciences-Center-BCSC/Patient-Care-Technician_R-19407?q=nurse",
        "job_posting_text": "locations\nBieler Clinical Sciences Center (BCSC)\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-19407\nTitle: \nPatient Care Technician\nJob Type:\nRegular\nCompany:\nRoswell Park Comprehensive Cancer Center\nDepartment: \nAmbulatory Services - Survivorship & Supportive Care\nTime Type: \nFull time\nWeekly Hours: \n40\nFTE:\n1\nShift: \nFirst Shift (United States of America)\nSummary: \nAssists nurses and therapists with numerous duties involving direct and indirect patient care; transports patients within the organization; picks up and delivers x-rays, supplies, mail, scans and other items as needed in the clinic; assists with patient flow through; monitors and maintains quality assurance and quality improvement activities.\nQualifications:\nRequired Education and Experience\n\n1. High School Diploma or High School Equivalency Diploma and the equivalent of one (1) year of full-time direct patient experience; or\n2. High School Diploma or High School Equivalency Diploma and the equivalent of three (3) years of full-time experience in a healthcare setting; or\n3. High School Diploma or High School Equivalency Diploma and the equivalent of three (3) years of full-time face-to-face customer service experience; or\n4. Matriculation in a Nursing Program.\n\nNOTE:\nRequired degrees must have been granted by an accredited school, college or university or one recognized by Roswell Park Comprehensive Cancer Center as following acceptable educational practices.\nPreferred Qualifications\nThe preferred candidate should have previous CNA experience as well as customer service and healthcare experience.\nEqual Employment Opportunity Statement\nRoswell Park Cancer Institute Corporation (RPCIC) and Health Research Inc. (HRI) Roswell Park Division believe that all persons are entitled to equal employment opportunities, and we do not discriminate against our employees, applicants or job seekers because of their race, color, religion, sex, sexual orientation, gender identity or expression, national origin, creed, age, disability, pregnancy-related condition, military or veteran status, marital or familial status, domestic violence victim status, citizenship status, genetic information, individual’s relationship or association with a member of a protected category or any other protected group status as defined by law.\nReasonable Accommodation Request\nRPCIC and HRI are committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the employment process, please email HR-PayAndBenefits@RoswellPark.org and let us know the nature of your request and your contact information.\nOur Core Values\nRPCIC and HRI are committed to providing an environment where patients, families, employees and community are treated with courtesy and respect. We support an inclusive environment that nurtures the talents, skills and abilities of each individual to embody and reflect our core values: Innovation, Integrity, Teamwork, Commitment, Compassion and Respect.\nHistorical Compensation Information Statement \nPursuant to Executive Order 161, no State entity, as defined by the Executive Order, is permitted to ask, or mandate, in any form, that an applicant for employment provide his or her current compensation, or any prior compensation history, until such time as the applicant is extended a conditional offer of employment with compensation. If such information has been requested from you before such time, please contact the Governor’s Office of Employee Relations at (518) 474-6988 or via email at info@goer.ny.gov.",
        "job_location": "Bieler Clinical Sciences Center (BCSC)"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "RN - Med Surg (Full Time - Days) Washington Twshp, NJ",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Gloucester-County-NJ/RN---Med-Surg--Full-Time---Days--Washington-Twshp--NJ_REQ-0007568-1?q=nurse",
        "job_posting_text": "locations\nGloucester County, NJ\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0007568\nJob Details\nJoin the mission of Improving Lives as a Registered Nurse (RN) at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done.\nJob Description\nJoin the mission of Improving Lives as a Staff Nurse at Jefferson Health. With more than 42,000 employees, were the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done.Staff Nurses are responsible for the following: Performs patient procedures within the nursing scope of practice. Practices safe medication administration and assesses patient responses to medication. Participates in reviewing and/or implementing clinical pathways and care coordination.The Staff Nurse will provide professional nursing care to a group of patients within a specified time period and complete all required documentation.Benefits include, but are not limited to: Comprehensive Medical, Dental,  Vision Plans Retirement Plans Tuition Reimbursement Health Coaching, Commuter Discounts, Day Care Services, etc.Qualifications for this position include: BSN Degree preferred State Issued RN license Basic Life Support (BLS) certification from the American Heart Association\nWork Shift\nWorkday Day (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n435 Hurffville-Cross Keys Rd, Turnersville, New Jersey, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. ",
        "job_location": "Gloucester County, NJ"
    },
    {
        "company": "Advocate Aurora Health (AAH)",
        "company_url": "https://aah.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Registered Nurse (RN) -Med/Surg/Tele/Vent-7p-7a",
        "job_href": "https://aah.wd5.myworkdayjobs.com/en-US/External/job/Advocate-Lutheran-General-Hospital---1775-Dempster-St/Registered-Nurse--RN---Med-Surg-Tele-Vent-7p-7a_R153542?q=nurse",
        "job_posting_text": "locations\nAdvocate Lutheran General Hospital - 1775 Dempster St\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR153542\nDepartment:\n34414 Advocate Lutheran General Hospital - Med Surg: IU 3 Center\nStatus: \nFull time\nBenefits Eligible:\nYes\nHours Per Week:\n36\nSchedule Details/Additional Information:\nIncludes weekends and holidays\nTitle:  Registered Nurse – Medical/Surgical/Vent/Telemetry Unit – 3CE\nScheduled Hours: 12 HR Shifts: 7p-7a; \n                                Full Time                              \nJob Summary:\nUsing evidence-based practice, clinical decision making, compassion and skilled dialogue, the registered nurse leads efforts to create the safest patient environment and the best patient experience. The nurse delivers and coordinates patient-centered care across the continuum to support the successful transition of patients to other healthcare delivery systems or their home communities. The registered nurse is responsible for providing and coordinating comprehensive patient care through the appropriate utilization of assessment, diagnosis, planning, implementation and evaluation, in accordance with established standards, policies and procedures.\n3 CE is a 25-bed unit that provides nursing care to a wide scope of diverse patient populations requiring telemetry monitoring related to medical, surgical or cardiac-related issues or also requiring ventilator support in our Magnet-designated, level 1 trauma, teaching hospital.  Excellent nursing culture and exposure to patients with diverse and complex medical issues to build the skills and knowledge and grow in your nursing career.\nPosition Requirements:\nGraduate of an accredited school of nursing with Current IL RN license\nBSN preferred, ADN acceptable with agreement for nurses with less than 12 months of experience to enroll in BSN completion program to be completed in four years.  Nurses with more than 12 months’ experience in direct patient care must possess a BSN or obtain either BSN or Advocate Aurora Health (AAH) recognized nursing certification within one year of the date of hire or becoming eligible to sit for certification, whichever is later.\nMinimum 2 years of nursing experience required, preferably on a telemetry or stepdown unit\nCurrent AHA CPR and ACLS\nAbility to work weekends, holidays, and different shifts in order to accommodate staffing\nWork environment includes probability of exposure to adverse, hazardous, or unpleasant conditions while caring for the sick\nAbility to assist in evacuation of patients in the event of a fire or other disaster\nRoutinely works with potentially infectious specimens and patients\nAbility to respond to patients in a timely manner and access all areas of the unit\nAbility to lift up to 35 pounds without assistance. For patient lifts of over 35 pounds, or when patient is unable to assist with the lift, patient handling equipment is expected to be used, with at least one other team member, when available. Unique patient lifting/movement situations will be assessed on a case-by-case basis.\nPay Range\n$37.50 - $56.25\nOur Commitment to You:\nAdvocate Health offers a comprehensive suite of Total Rewards: benefits and well-being programs, competitive compensation, generous retirement offerings, programs that invest in your career development and so much more – so you can live fully at and away from work, including:\nCompensation\nBase compensation listed within the listed pay range based on factors such as qualifications, skills, relevant experience, and/or training\nPremium pay such as shift, on call, and more based on a teammate's job\nIncentive pay for select positions\nOpportunity for annual increases based on performance\nBenefits and more\nPaid Time Off programs\nHealth and welfare benefits such as medical, dental, vision, life, and Short- and Long-Term Disability\nFlexible Spending Accounts for eligible health care and dependent care expenses\nFamily benefits such as adoption assistance and paid parental leave\nDefined contribution retirement plans with employer match and other financial wellness programs\nEducational Assistance Program\nAbout Advocate Health \nAdvocate Health is the third-largest nonprofit, integrated health system in the United States, created from the combination of Advocate Aurora Health and Atrium Health. Providing care under the names Advocate Health Care in Illinois; Atrium Health in the Carolinas, Georgia and Alabama; and Aurora Health Care in Wisconsin, Advocate Health is a national leader in clinical innovation, health outcomes, consumer experience and value-based care. Headquartered in Charlotte, North Carolina, Advocate Health services nearly 6 million patients and is engaged in hundreds of clinical trials and research studies, with Wake Forest University School of Medicine serving as the academic core of the enterprise. It is nationally recognized for its expertise in cardiology, neurosciences, oncology, pediatrics and rehabilitation, as well as organ transplants, burn treatments and specialized musculoskeletal programs. Advocate Health employs 155,000 teammates across 69 hospitals and over 1,000 care locations, and offers one of the nation’s largest graduate medical education programs with over 2,000 residents and fellows across more than 200 programs. Committed to providing equitable care for all, Advocate Health provides more than $6 billion in annual community benefits.",
        "job_location": "Advocate Lutheran General Hospital - 1775 Dempster St"
    },
    {
        "company": "Advocate Aurora Health (AAH)",
        "company_url": "https://aah.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Registered Nurse (RN) - Cardiac Cath Lab-Registry",
        "job_href": "https://aah.wd5.myworkdayjobs.com/en-US/External/job/Advocate-Lutheran-General-Hospital---1775-Dempster-St/Registered-Nurse--RN----Cardiac-Cath-Lab-Registry_R144933?q=nurse",
        "job_posting_text": "locations\nAdvocate Lutheran General Hospital - 1775 Dempster St\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR144933\nDepartment:\n36918 Advocate Lutheran General Hospital - Cardiac Cath Lab\nStatus: \nPart time\nBenefits Eligible:\nNo\nHours Per Week:\n0\nSchedule Details/Additional Information:\nMonday - Friday, 0700-1730\nTitle:  Registered Nurse – CARDIAC CATH LAB\nScheduled Hours: 10 hour shifts; Department open 7a-1730p\n                                 Monday through Friday;\nCommit to 20 hours a month\n                                  Job Summary:\nThe unit has four state of the art Cath Labs with terrific patient experience design. The physicians perform minimally invasive tests and procedures to diagnose and treat cardiovascular disease (complex catheterizations, electrophysiology and structural heart procedures). As a nurse in this department you will assist the cardiovascular team throughout the procedure from prep through recovery.\nThe Cath Lab provides a collaborative/supportive team approach; embraces teaching/learning with a supportive and engaged leadership team.\nUsing evidence-based practice, clinical decision making, compassion and skilled dialogue, the registered nurse leads efforts to create the safest patient environment and the best patient experience. The nurse delivers and coordinates patient-centered care across the continuum to support the successful transition of patients to other healthcare delivery systems or their home communities. The registered nurse is responsible for providing and coordinating comprehensive patient care through the appropriate utilization of assessment, diagnosis, planning, implementation and evaluation, in accordance with established standards, policies and procedures.\nPosition Requirements:\nGraduate of an accredited school of nursing with Current IL RN license\nBSN preferred, ADN acceptable with agreement for nurses with less than 12 months of experience to enroll in BSN completion program to be completed in four years.  Nurses with more than 12 months experience in direct patient care must possess a BSN or obtain either BSN or Advocate Aurora Health (AAH) recognized nursing certification within one year of the date of hire or becoming eligible to sit for certification, whichever is later.\nMust possess at minimum 2 years Cath Lab nursing experience.\nCurrent AHA CPR and ACLS\nAbility to work weekends, holidays, and different shifts in order to accommodate staffing\nCertain positions may need to take call\nWork environment includes probability of exposure to adverse, hazardous, or unpleasant conditions while caring for the sick\nAbility to assist in evacuation of patients in the event of a fire or other disaster\nRoutinely works with potentially infectious specimens and patients\nAbility to respond to patients in a timely manner and access all areas of the unit\nAbility to lift up to 35 pounds without assistance. For patient lifts of over 35 pounds, or when patient is unable to assist with the lift, patient handling equipment is expected to be used, with at least one other team member, when available. Unique patient lifting/movement situations will be assessed on a case-by-case basis.\n\n\n                            Pay Range\n$37.50 - $56.25\nOur Commitment to You:\nAdvocate Health offers a comprehensive suite of Total Rewards: benefits and well-being programs, competitive compensation, generous retirement offerings, programs that invest in your career development and so much more – so you can live fully at and away from work, including:\nCompensation\nBase compensation listed within the listed pay range based on factors such as qualifications, skills, relevant experience, and/or training\nPremium pay such as shift, on call, and more based on a teammate's job\nIncentive pay for select positions\nOpportunity for annual increases based on performance\nBenefits and more\nPaid Time Off programs\nHealth and welfare benefits such as medical, dental, vision, life, and Short- and Long-Term Disability\nFlexible Spending Accounts for eligible health care and dependent care expenses\nFamily benefits such as adoption assistance and paid parental leave\nDefined contribution retirement plans with employer match and other financial wellness programs\nEducational Assistance Program\nAbout Advocate Health \nAdvocate Health is the third-largest nonprofit, integrated health system in the United States, created from the combination of Advocate Aurora Health and Atrium Health. Providing care under the names Advocate Health Care in Illinois; Atrium Health in the Carolinas, Georgia and Alabama; and Aurora Health Care in Wisconsin, Advocate Health is a national leader in clinical innovation, health outcomes, consumer experience and value-based care. Headquartered in Charlotte, North Carolina, Advocate Health services nearly 6 million patients and is engaged in hundreds of clinical trials and research studies, with Wake Forest University School of Medicine serving as the academic core of the enterprise. It is nationally recognized for its expertise in cardiology, neurosciences, oncology, pediatrics and rehabilitation, as well as organ transplants, burn treatments and specialized musculoskeletal programs. Advocate Health employs 155,000 teammates across 69 hospitals and over 1,000 care locations, and offers one of the nation’s largest graduate medical education programs with over 2,000 residents and fellows across more than 200 programs. Committed to providing equitable care for all, Advocate Health provides more than $6 billion in annual community benefits.",
        "job_location": "Advocate Lutheran General Hospital - 1775 Dempster St"
    }
]