[
    {
        "company": "Intermountain Healthcare (IMH)",
        "company_url": "https://imh.wd5.myworkdayjobs.com/IntermountainCareers?q=nurse",
        "job_title": "RN Care Manager PRN",
        "job_href": "https://imh.wd5.myworkdayjobs.com/en-US/IntermountainCareers/job/Intermountain-Health-Logan-Regional-Hospital/Case-Manager-RN_R141988-1?q=nurse",
        "job_posting_text": "locations\nIntermountain Health Logan Regional Hospital\ntime type\nPart time\nposted on\nPosted Today\ntime left to apply\nEnd Date: July 21, 2025 (29 days left to apply)\njob requisition id\nR141988\nJob Description:\nThe nurse care manager works collaboratively with physicians and other members of the health care team to improve the health of patients with chronic conditions or complex needs. The position educates patients and caregivers to help them manage their health care needs. The incumbent facilitates communication, coordinates services, addresses barriers, and promotes optimal allocation of resources while balancing clinical quality and cost management.\nJob Specifics\nPay Range: Non/Exempt $43.98 - $63.79 Non-Exempt\nBenefits Eligible: No\nFTE: PRN\nShift: Cover 1 Weekend/month, as well as PRN for other Care Managers as needed at Logan Regional Hospital from 8 am - 4:30 pm.\nJob Essentials\nOrganizes and prioritizes daily work by assessing new, current, and discharging patient needs in area(s) of responsibility. Completes documentation as required.\nPerforms utilization review activities to provide patient appropriate, timely, and cost effective care. Coordinates care with patient, care providers, hospital financial services, and third-party payers.\nMaintains an active role in denial prevention. Proactively intervenes with payers to prevent inpatient denials. Performs retroactive reviews on discharged patients as assigned. Communicates any necessary information to payers to help appeal existing denials. Uses level of care criteria to justify the patient's severity of illness and intensity of service. Reviews payer requirements and government regulations to ensure safe and cost-effective healthcare.\nScreens and coordinates the discharge planning process from patient admission to departure. Assesses patient needs, develops a discharge plan, and coordinates with internal and external services for care during and after the hospital stay\nIdentifies patients with potential avoidable delays, extended stay, readmission, or discharge needs. Coordinates with care providers and leaders to reach optimal solutions.\nEducates, communicates, and coordinates with multiple patient care teams to ensure the patient receives quality care, a timely discharge, and to identify and resolve delays and issues.\nMinimum Qualifications\nCurrent RN license for state in which the nurse practices.\nThree years of clinical nursing experience.\nRNs hired or promoted into this role need to have or obtain their BSN within three years of hire or promotion.\n\nPreferred Qualifications\nBachelor's degree in Nursing (BSN). Education must be obtained from an accredited institution. Degree will be verified.\nCase management Certification.\nExperience in Case management, Utilization review, and/or discharge planning.\nPhysical Requirements:\nOngoing need for employee to see and read information, labels, monitors, identify equipment and supplies, and be able to assess patient needs.\nFrequent interactions with patient care providers, patients, and visitors that require employee to verbally communicate as well as hear and understand spoken information, alarms, needs, and issues quickly and accurately, particularly during emergency situations.\nManual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use and typing for documenting patient care, accessing needed information, etc.\nLocation:\nIntermountain Health Logan Regional Hospital\nWork City:\nLogan\nWork State:\nUtah\nScheduled Weekly Hours:\n0\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience. \n$43.98 - $63.79\nWe care about your well-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged. \nLearn more about our comprehensive benefits package here.\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\nAt Intermountain Health, we use the artificial intelligence (\"AI\") platform, HiredScore to improve your job application experience. HiredScore helps match your skills and experiences to the best jobs for you. While HiredScore assists in reviewing applications, all final decisions are made by Intermountain personnel to ensure fairness. We protect your privacy and follow strict data protection rules. Your information is safe and used only for recruitment. Thank you for considering a career with us and experiencing our AI-enhanced recruitment process.\nAll positions subject to close without notice.",
        "job_location": "Intermountain Health Logan Regional Hospital"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "RN Inpatient Rehab, FT Days",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Einstein-Hosp-Phila---Tower-Bldg/RN-Inpatient-Rehab--FT-Days_REQ-0012732?q=nurse",
        "job_posting_text": "locations\nEinstein Hosp Phila - Tower Bldg\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0012732\nJob Details\nJob Description\nWork Shift\nWorkday Day (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n5501 Old York Road, Philadelphia, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Einstein Hosp Phila - Tower Bldg"
    },
    {
        "company": "Advocate Aurora Health (AAH)",
        "company_url": "https://aah.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Registered Nurse - L&D .9 7p",
        "job_href": "https://aah.wd5.myworkdayjobs.com/en-US/External/job/Advocate-Christ-Hospital--Medical-Center---4440-W-95th-St/Registered-Nurse---L-D-9-7p_R156393?q=nurse",
        "job_posting_text": "locations\nAdvocate Christ Hospital & Medical Center - 4440 W 95th St\ntime type\nFull time\nposted on\nPosted Today\ntime left to apply\nEnd Date: June 26, 2025 (4 days left to apply)\njob requisition id\nR156393\nDepartment:\n35005 Advocate Christ Medical Center - Labor and Delivery\nStatus: \nFull time\nBenefits Eligible:\nYes\nHours Per Week:\n36\nSchedule Details/Additional Information:\nNight shift 7p-7a, rotating weekends/holidays\nPosition Requirements: Education Required:Completion of an accredited or approved program in Nursing. Experience Required: Typically requires 1 year of experience in clinical nursing. Knowledge Skills and Abilities Required:Demonstrates progression to provide holistic patient care and the ability to view clinical situations from a patient and family focus.Demonstrates progression to recognize situational changes that require unplanned or unanticipated interventions and responds to situations with confidence timeliness and flexibility.Proficient computer skills use of electronic mail and electronic medical records systems.Excellent communication (written and verbal) listening and interpersonal skills.Demonstrates human relation skills with the ability to develop rapport and maintain positive professional relationships with a variety of patients team members and physicians. Ability to take initiative and work collaboratively with others.Demonstrated ability to effectively make critical independent decisions.Excellent organization prioritization and problem~solving skills.Demonstrates time management skills with an ability to multi~task and prioritize in an environment with frequent interruptions.Demonstrates coordination collaboration delegation and team building skills.Certification AddendumTeam members will maintain annual educational requirements for hospital based certifications (e.g. DNV CARF or others). Licensure Registration and/or Certification Required:Registered Nurse license issued by the state in which the team member practices andBasic Life Support (BLS) for Healthcare Providers certification issued by the American Heart Association (AHA). Physical Requirements and Working Conditions:Must be able to sit stand walk lift squat bend reach above shoulders and twist frequently throughout the workday.Must be able to:lift up to 50 lbs. from floor to waist.lift up to 20 lbs. over the head.carry up to 40 lbs. a reasonable distance.Must be able to:push/pul\nPay Range\n$37.50 - $56.25\nOur Commitment to You:\nAdvocate Health offers a comprehensive suite of Total Rewards: benefits and well-being programs, competitive compensation, generous retirement offerings, programs that invest in your career development and so much more – so you can live fully at and away from work, including:\nCompensation\nBase compensation listed within the listed pay range based on factors such as qualifications, skills, relevant experience, and/or training\nPremium pay such as shift, on call, and more based on a teammate's job\nIncentive pay for select positions\nOpportunity for annual increases based on performance\nBenefits and more\nPaid Time Off programs\nHealth and welfare benefits such as medical, dental, vision, life, and Short- and Long-Term Disability\nFlexible Spending Accounts for eligible health care and dependent care expenses\nFamily benefits such as adoption assistance and paid parental leave\nDefined contribution retirement plans with employer match and other financial wellness programs\nEducational Assistance Program\nAbout Advocate Health \nAdvocate Health is the third-largest nonprofit, integrated health system in the United States, created from the combination of Advocate Aurora Health and Atrium Health. Providing care under the names Advocate Health Care in Illinois; Atrium Health in the Carolinas, Georgia and Alabama; and Aurora Health Care in Wisconsin, Advocate Health is a national leader in clinical innovation, health outcomes, consumer experience and value-based care. Headquartered in Charlotte, North Carolina, Advocate Health services nearly 6 million patients and is engaged in hundreds of clinical trials and research studies, with Wake Forest University School of Medicine serving as the academic core of the enterprise. It is nationally recognized for its expertise in cardiology, neurosciences, oncology, pediatrics and rehabilitation, as well as organ transplants, burn treatments and specialized musculoskeletal programs. Advocate Health employs 155,000 teammates across 69 hospitals and over 1,000 care locations, and offers one of the nation’s largest graduate medical education programs with over 2,000 residents and fellows across more than 200 programs. Committed to providing equitable care for all, Advocate Health provides more than $6 billion in annual community benefits.",
        "job_location": "Advocate Christ Hospital & Medical Center - 4440 W 95th St"
    }
]