[
    {
        "company": "Intermountain Healthcare (IMH)",
        "company_url": "https://imh.wd5.myworkdayjobs.com/IntermountainCareers?q=nurse",
        "job_title": "Advanced Practice Provider Medical Oncology",
        "job_href": "https://imh.wd5.myworkdayjobs.com/en-US/IntermountainCareers/job/Lutheran-Medical-Center-Radiation-Oncology/Advanced-Practice-Provider-Medical-Oncology_R142895?q=nurse",
        "job_posting_text": "locations\nLutheran Medical Center Radiation Oncology\ntime type\nFull time\nposted on\nPosted Today\ntime left to apply\nEnd Date: July 12, 2026 (30+ days left to apply)\njob requisition id\nR142895\nJob Description:\nWhen you join us, you’ll become a part of a nationally recognized health system dedicated to our mission of “helping people live the healthiest lives possible\nAbout this role:\nAs an Advanced Practice Provider- Medical Oncology, you will work with a team of healthcare professionals committed to providing quality care and excellent patient experience. In this role you will work with 3 Oncologists to provide top-notch care and patient experience. Here are some highlights you can expect.\nYou would practice at the Cancer Center at Lutheran Medical Center Campus in Wheat Ridge, CO\nYour hours will be Mon-Fri 8am-5pm, or 4/10s\nno call/no weekends\nYou would mostly see patients in the clinic for follow up and plans of care\nYou will round at the hospital as needed.\nThis position includes a $10,000 sign-on bonus, and up to $7,500.00 in relocation assistance if applicable.\nProductivity Model is offered: $18.00 wRVU/ 487.50/calendar quarter\nHow we'll support you:\nWe care about your well-being, which is why we provide our caregivers with a generous benefits package. In addition, we offer paid time off, license reimbursement, malpractice insurance coverage, and an annual CME allowance to support your continuous growth and development. Learn more about our comprehensive benefits package here.\nWhat you’ll bring:\nAPRN or PA-C degree from an accredited program\n Unrestricted license as an NP or PA in the state of Colorado or able to obtain\nCurrent BLS, DEA, and full prescriptive authority\nMinimum 1 year of NP or PA experience, preferably in oncology\nCan consider a new graduate NP with recent RN oncology experience\nWe are not able to accept candidates requiring Visa sponsorship currently\nAbout us:\nIntermountain Health is a model health system by providing extraordinary care and superior service at an affordable cost. We are an integrated not-for-profit system of 33 hospitals, 385 clinics, and a medical group with more than 5,000 employed physicians and advanced practice providers across seven states in the mountain west. \nOur value statements are core to our culture. They reflect the behavior and attitudes that are important to us, are an agreement for how we treat each other, help us make decisions on how to act, and are a promise of what people can expect from us. Learn more about our Mission, Vision, and Values at: About Intermountain!\nIntermountain Health was recently recognized by the American Medical Association’s Joy in Medicine award for our commitment to physician wellbeing.\nWhat does it mean to be a part of Intermountain Health?\nIt means joining the Power of We, building an environment where providers and caregivers can deliver the best in healthcare. Realizing each caregiver and volunteer is vital to providing care to our patients, because WE can only achieve the extraordinary together. Committed to the best in research and most advanced technology, the results are better clinical patient outcomes\nLife in Denver, CO\nGood Samaritan Hospital is a 234-bed Level II Trauma Center. Our mission is to bring health and hope to the poor, the vulnerable, our communities and each other. Opening in 2004, Good Samaritan Hospital is an Accredited Chest Pain Center, Primary Stroke Center, and a Cardiovascular Center of Excellence. We’re especially proud of our people, who helped win us the Outstanding Patience Experience Award  for 2021, 2022, and 2023 according to Healthgrades.\nLutheran Medical Center is a 338-bed Level II Trauma Center that provides comprehensive, specialty care to the poor, the vulnerable, our communities and each other. Dating back to 1905, we are proud of the rich history and inspiring mission our hospital has embodied for over 110 years.\nPlatte Valley Medical Center is a 98-bed Level III Trauma community hospital that is proud to offer comprehensive, integrated care focused on holistic health. We are proud to extend the mission of Intermountain Health by providing care for the poor, the vulnerable, our communities and each other.\nSaint Joseph Hospital is a 365-bed facility and one of the top-ranked hospitals in Denver. We have been awarded the highest national recognition possible for nursing excellence – Magnet designation – by the ANCC. We are proud to extend the mission of Intermountain Health by providing care for the poor, the vulnerable, our communities and each other. Our deep community roots date back to 1873, making us one of the oldest hospitals in Colorado. We are proud to have received several awards including  America’s 250 Best Hospital Awards according to Healthgrades for 2022 and 2023.\nPhysical Requirements:\nLocation:\nLutheran Medical Center Radiation Oncology\nWork City:\nGolden\nWork State:\nColorado\nScheduled Weekly Hours:\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience. \n$56.76 - $87.59\nWe care about your well-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged. \nLearn more about our comprehensive benefits package here.\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\nAt Intermountain Health, we use the artificial intelligence (\"AI\") platform, HiredScore to improve your job application experience. HiredScore helps match your skills and experiences to the best jobs for you. While HiredScore assists in reviewing applications, all final decisions are made by Intermountain personnel to ensure fairness. We protect your privacy and follow strict data protection rules. Your information is safe and used only for recruitment. Thank you for considering a career with us and experiencing our AI-enhanced recruitment process.\nAll positions subject to close without notice.",
        "job_location": "Lutheran Medical Center Radiation Oncology"
    },
    {
        "company": "Roswell Park Comprehensive Cancer Center",
        "company_url": "https://roswellpark.wd5.myworkdayjobs.com/ExternalCareers?q=nurse",
        "job_title": "Patient Care Technician (First Shift/Full Time)",
        "job_href": "https://roswellpark.wd5.myworkdayjobs.com/en-US/ExternalCareers/job/Roswell/Patient-Care-Technician--First-Shift-Full-Time-_R-19701?q=nurse",
        "job_posting_text": "locations\nRoswell\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-19701\nTitle: \nPatient Care Technician (First Shift/Full Time)\nJob Type:\nRegular\nCompany:\nRoswell Park Comprehensive Cancer Center\nDepartment: \nNursing - 6 West\nTime Type: \nFull time\nWeekly Hours: \n40\nFTE:\n1\nShift: \nFirst Shift (United States of America)\nSummary: \nAssists nurses and therapists with numerous duties involving direct and indirect patient care; transports patients within the organization; picks up and delivers x-rays, supplies, mail, scans and other items as needed in the clinic; assists with patient flow through; monitors and maintains quality assurance and quality improvement activities.\nQualifications:\nMinimum Qualifications\n\n1. High School Diploma or High School Equivalency Diploma and the equivalent of one (1) year of full-time direct patient experience; or\n2. High School Diploma or High School Equivalency Diploma and the equivalent of three (3) years of full-time experience in a healthcare setting; or\n3. High School Diploma or High School Equivalency Diploma and the equivalent of three (3) years of full-time face-to-face customer service experience; or\n4. Matriculation in a Nursing Program.\n\nNOTE: \nRequired degrees must have been granted by an accredited college or university or one recognized by Roswell Park Comprehensive Cancer Center as following acceptable educational practices.\nPreferred Qualifications\nThe preferred candidate should have previous patient care experience in a hospital setting, including direct clinical experience. In addition, the preferred candidate should have prior experience working as a Patient Care Technician (PCT) and/or\ncurrently enrolled in an accredited nursing program.\nEqual Employment Opportunity Statement\nRoswell Park Cancer Institute Corporation (RPCIC) and Health Research Inc. (HRI) Roswell Park Division believe that all persons are entitled to equal employment opportunities, and we do not discriminate against our employees, applicants or job seekers because of their race, color, religion, sex, sexual orientation, gender identity or expression, national origin, creed, age, disability, pregnancy-related condition, military or veteran status, marital or familial status, domestic violence victim status, citizenship status, genetic information, individual’s relationship or association with a member of a protected category or any other protected group status as defined by law.\nReasonable Accommodation Request\nRPCIC and HRI are committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the employment process, please email HR-PayAndBenefits@RoswellPark.org and let us know the nature of your request and your contact information.\nOur Core Values\nRPCIC and HRI are committed to providing an environment where patients, families, employees and community are treated with courtesy and respect. We support an inclusive environment that nurtures the talents, skills and abilities of each individual to embody and reflect our core values: Innovation, Integrity, Teamwork, Commitment, Compassion and Respect.\nHistorical Compensation Information Statement \nPursuant to Executive Order 161, no State entity, as defined by the Executive Order, is permitted to ask, or mandate, in any form, that an applicant for employment provide his or her current compensation, or any prior compensation history, until such time as the applicant is extended a conditional offer of employment with compensation. If such information has been requested from you before such time, please contact the Governor’s Office of Employee Relations at (518) 474-6988 or via email at info@goer.ny.gov.",
        "job_location": "Roswell"
    },
    {
        "company": "Memorial Hermann Health System",
        "company_url": "https://memorialhermann.wd5.myworkdayjobs.com/external?q=nurse",
        "job_title": "RN - Medical Surgical, Days (Pearland)",
        "job_href": "https://memorialhermann.wd5.myworkdayjobs.com/en-US/external/job/Pearland-Hospital/RN---Medical-Surgical--Days--Pearland-_100171419?q=nurse",
        "job_posting_text": "locations\nPearland Hospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\n100171419\nAt Memorial Hermann, we pursue a common goal of delivering high quality, efficient care while creating exceptional experiences for every member of our community. When we say every member of our community, that includes our employees. We know that when our employees feel cared for, heard and valued, they are inspired to create moments that exceed expectations, while prioritizing safety, compassion, personalization and efficiency. If you want to advance your career and contribute to our vision of creating healthier communities, now and for generations to come, we want you to be a part of our team.\nJob Summary\nCollaborates with interdisciplinary team in the delivery of patient care, utilizing the nursing process; provides professional nursing care to patients, including conducting nursing assessments, assisting with exams and treatment, patient education, and maintenance of medical records.  \n\nLocated in dynamic Pearland, one of the fastest-growing communities in the country, Memorial Hermann Pearland Hospital (ANCC Magnet designated) brings the expertise of the Memorial Hermann Health System close to home.  MH Pearland is currently seeking positive and engaged nurses that love working with a family oriented culture. \n•        54 total beds Med/surg unit\n•        Caring, Fun, and supportive environment with a strong focus on compassionate and quality patient care.  \n•      Non specialized units with a wide variety of patients to care for:  Cardiac (CHF, MI, Heart Cath patients), Neuro (stroke, seizures), Diabetes, Surgical (orthopedic, general) and more. \n•      24 hour hospitalist coverage\nJob Description\nMinimum Qualifications\nEducation:  Graduate of an accredited School of Professional Nursing; Bachelors of Nursing preferred\nLicenses/Certifications:\nCurrent State of Texas license or temporary/compact license to practice professional nursing\nCertified in Basic Life Support\nAdditional certifications may be required based on discipline and/or nursing unit requirements\nExperience / Knowledge / Skills:\nRN I <1 year\nRN II = 1-3 years\nRN III = 3-10 years\nRN IV = 10+ years",
        "job_location": "Pearland Hospital"
    }
]