[
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "Registered Nurse - FT Days - Telemetry - Jefferson Einstein Montgomery",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Montgomery-County-PA/Registered-Nurse---FT-Days---Telemetry---Jefferson-Einstein-Montgomery_REQ-0011298-1?q=nurse",
        "job_posting_text": "locations\nMontgomery County, PA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0011298\nJob Details\nJoin the mission of Improving Lives as a Staff Nurse at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. And our work to improve lives is never done.\nJob Description\nStaff Nurses are responsible for the following: \n Performs patient procedures within the nursing scope of practice. \nPractices safe medication administration and assesses patient responses to medication. \nParticipates in reviewing and/or implementing clinical pathways and care coordination. \n The Staff Nurse will provide professional nursing care to a group of patients within a specified time period and complete all required documentation. \n Qualifications for this position include: \n BSN Degree preferred \nState Issued RN license \nBasic Life Support (BLS) certification from the American Heart Association  \nWork Shift\nWorkday Day (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n559 W. Germantown Pike, East Norriton, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Montgomery County, PA"
    },
    {
        "company": "Advocate Aurora Health (AAH)",
        "company_url": "https://aah.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Registered Nurse (RN) Operating Room Cohort",
        "job_href": "https://aah.wd5.myworkdayjobs.com/en-US/External/job/Aurora-St-Lukes-Medical-Center---2900-W-Oklahoma-Ave/Registered-Nurse--RN--Operating-Room-Cohort_R154562?q=nurse",
        "job_posting_text": "locations\nAurora St Lukes Medical Center - 2900 W Oklahoma Ave\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR154562\nDepartment:\nStatus: \nFull time\nBenefits Eligible:\nYes\nHours Per Week:\n40\nSchedule Details/Additional Information:\nCohort to start October 6th \n7am-3:30pm; Monday-Friday will be orientation schedule;\nFuture shift to be determined upon completion of orientation\nbased on needs of department;\nFULL TIME; 80 hours a pay period;\nFuture rotating call upon successful completion of orientation\nMust meet 30 minute call requirement\nAre you looking for a teaching environment that will challenge your knowledge and skills surrounding surgical nursing in the Operating Room? You are the eyes, the ears, and the voice of the patient during one of the most vulnerable times of a person’s healthcare journey. The OR is highly interdependent, and team based. You will work closely with surgeons, residents, advanced practice clinicians, anesthesiologists, technologists and assistants to provide superior surgical outcomes. Your orientation and practice environment is rooted in the specialty standards and educational programs of the Association of Perioperative Nurses (AORN). Your extensive RN orientation includes exposure to both circulating and scrub competencies.\nPosition Requirements:\n· Graduate of an accredited school of nursing with Current WI RN license\n· Seeking an RN with minimum of one year nursing experience OR will consider Graduate Nurse with recent WI licensure \n· Must be available to start October 6th \n· Ability to work weekends, holidays, and different shifts in order to accommodate staffing\n· positions need to take call\n· Work environment includes probability of exposure to adverse, hazardous, or unpleasant conditions while caring for the sick\n· Ability to assist in evacuation of patients in the event of a fire or other disaster\n· Routinely works with potentially infectious specimens and patients\n· Ability to respond to patients in a timely manner and access all areas of the unit\n· Ability to lift up to 35 pounds without assistance. For patient lifts of over 35 pounds, or when patient is unable to assist with the lift, patient handling equipment is expected to be used, with at least one other team member, when available. Unique patient lifting/movement situations will be assessed on a case-by-case basis.\nLicensure, Registration, and/or Certification Required:\nRegistered Nurse license issued by the state in which the team member practices, and\nBasic Life Support (BLS) for Healthcare Providers certification issued by the American Heart Association (AHA).\n\nEducation Required:\nCompletion of an accredited or approved program in Nursing.\n\n\nKnowledge, Skills & Abilities Required:\nDemonstrates progression to provide holistic patient care and the ability to view clinical situations from a patient and family focus.\nDemonstrates progression to recognize situational changes that require unplanned or unanticipated interventions, and responds to situations with confidence, timeliness and flexibility.\nProficient computer skills, use of electronic mail and electronic medical records systems.\nExcellent communication (written and verbal), listening and interpersonal skills.\nDemonstrates human relation skills with the ability to develop rapport and maintain positive, professional relationships with a variety of patients, team members and physicians. Ability to take initiative and work collaboratively with others.\nDemonstrated ability to effectively make critical, independent decisions.\nExcellent organization, prioritization and problem-solving skills.\nDemonstrates time management skills with an ability to multi-task and prioritize in an environment with frequent interruptions.\nDemonstrates coordination, collaboration, delegation and team building skills.\nCertification Addendum:\nTeam members will maintain annual educational requirements for hospital based certifications (e.g. DNV, CARF or others)\n\nPhysical Requirements and Working Conditions:\nMust be able to sit, stand, walk, lift, squat, bend, reach above shoulders, and twist frequently throughout the workday.\nMust be able to:\nlift up to 50 lbs. from floor to waist.\nlift up to 20 lbs. over the head.\ncarry up to 40 lbs. a reasonable distance.\nMust be able to:\npush/pull with 30 lbs. of force.\nperform a sliding transfer of 150 lbs. with a second person present.\nPosition requires use of foot pedals on carts or machines.\nMay be exposed to chemical and hazardous waste as well as blood and body fluids and communicable disease. Therefore, protective clothing and equipment must be worn as necessary.\nMust have functional speech, vision, hearing, and touch with ability to use fine hand manipulation skills for IV insertion and other procedures/functions.\nOperates all equipment necessary to perform the job.\n\nThis job description indicates the general nature and level of work expected of the incumbent. It is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the incumbent. Incumbent may be required to perform other related duties.\nPay Range\n$37.50 - $56.25\nOur Commitment to You:\nAdvocate Health offers a comprehensive suite of Total Rewards: benefits and well-being programs, competitive compensation, generous retirement offerings, programs that invest in your career development and so much more – so you can live fully at and away from work, including:\nCompensation\nBase compensation listed within the listed pay range based on factors such as qualifications, skills, relevant experience, and/or training\nPremium pay such as shift, on call, and more based on a teammate's job\nIncentive pay for select positions\nOpportunity for annual increases based on performance\nBenefits and more\nPaid Time Off programs\nHealth and welfare benefits such as medical, dental, vision, life, and Short- and Long-Term Disability\nFlexible Spending Accounts for eligible health care and dependent care expenses\nFamily benefits such as adoption assistance and paid parental leave\nDefined contribution retirement plans with employer match and other financial wellness programs\nEducational Assistance Program\nAbout Advocate Health \nAdvocate Health is the third-largest nonprofit, integrated health system in the United States, created from the combination of Advocate Aurora Health and Atrium Health. Providing care under the names Advocate Health Care in Illinois; Atrium Health in the Carolinas, Georgia and Alabama; and Aurora Health Care in Wisconsin, Advocate Health is a national leader in clinical innovation, health outcomes, consumer experience and value-based care. Headquartered in Charlotte, North Carolina, Advocate Health services nearly 6 million patients and is engaged in hundreds of clinical trials and research studies, with Wake Forest University School of Medicine serving as the academic core of the enterprise. It is nationally recognized for its expertise in cardiology, neurosciences, oncology, pediatrics and rehabilitation, as well as organ transplants, burn treatments and specialized musculoskeletal programs. Advocate Health employs 155,000 teammates across 69 hospitals and over 1,000 care locations, and offers one of the nation’s largest graduate medical education programs with over 2,000 residents and fellows across more than 200 programs. Committed to providing equitable care for all, Advocate Health provides more than $6 billion in annual community benefits.",
        "job_location": "Aurora St Lukes Medical Center - 2900 W Oklahoma Ave"
    },
    {
        "company": "Advocate Aurora Health (AAH)",
        "company_url": "https://aah.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Specialty Coder Inpatient - REMOTE",
        "job_href": "https://aah.wd5.myworkdayjobs.com/en-US/External/job/Remote/Specialty-Coder-Inpatient---REMOTE_R151563?q=nurse",
        "job_posting_text": "locations\nRemote\nAAO Oak Brook - 2025 Windsor Dr\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR151563\nDepartment:\n10460 Enterprise Revenue Cycle - Facility Production Coding Admin\nStatus: \nFull time\nBenefits Eligible:\nYes\nHours Per Week:\n40\nSchedule Details/Additional Information:\nFirst shift\nREMOTE Opportunity\nHospital-based inpatient coding experience in an large acute care hospital or integrated health care system.\nMajor Responsibilities:\nReviews all documentation from Qualified Medical Providers to assign all significant diagnosis based on guidelines. Additionally, all documentation from nurses must be reviewed, to assign correct codes based on AHA Coding Clinic such as wound care. Coder must understand the reimbursement rules and quality outcomes so diagnoses can be clarified for statistical, research, SOI/ROM severity, best DRG outcome and as well as accurate assignment of present on admission (POA) indicators.\nCodes cases utilizing a computerized encoding software system and completes abstraction for clinical data and non-clinical data elements for community and academic hospital sites. This position is responsible for reviewing all documentation in the patient record for accurate and complete code. High dollar cases must be coded within 24 hours. High dollar cases for these coders are typically $500,000 and higher.\nMust be able to do a clear and concise query to the MD, when there is conflicting documentation. Must also be able identify and place accounts to the correct status/hold when additional documentation is required for accurate and complete coding.\nCollaborate with Clinical Documentation Specialist (CDS) team as part of the clinical documentation validation process to provide the most accurate and complete diagnosis. Work with Clinical Documentation Specialists, as part of the Clinical Documentation improvement team to validate the DRG, SOI/ROM and HCC. Forward queries created by the CDS team to the medical staff to obtain the most accurate DRG. This provides outcomes for the organization as well as accurate reimbursement and benchmarking\nCollaborates with the Coding Quality team when alerted to coding quality issues found via internal and external reviews; implement, with accuracy, coding quality recommendations.\nCollaborates with HIM operations as needed to clarify queries and documentation needs for the completion of the medical record.\nVerify abstracting of discharge disposition as this often has an impact on the DRG.\nCollaborate with quality and CDI to ascertain that charts are at the highest level possible for SOI/ROM based on documentation for critical charts such as mortality cases for benchmarking purposes based on documentation. Query for unclear or conflicting documentation on a pre-bill basis.\nMaintains a productivity rate of 100% on a monthly basis and a quality rate of 95% or higher.\nAssists in ensuring coding compliance with federal, state, and other regulatory agencies, research cases, government payors and other selected third-party payors.\n\nLicensure, Registration, and/or Certification Required:\nCoding Specialist (CCS) certification issued by the American Health Information Management Association (AHIMA), or\nHealth Information Administrator (RHIA) registration issued by the American Health Information Management Association (AHIMA), or\nHealth Information Technician (RHIT) registration issued by the American Health Information Management Association (AHIMA), or\n\nEducation Required:\nAssociate's Degree in Health Information Management or related field.\n\nExperience Required:\nTypically requires 3 to 5 years of experience in ICD-10-CM & ICD-10-PCS progressive inpatient coding experience in an integrated acute care teaching setting with proven competency in lower level inpatient records.\n\nKnowledge, Skills & Abilities Required:\nKnowledge of, but not limited to, current Official Coding Guidelines and methodologies, MS-DRGs, APR-DRGs, the ICD-10-CM/PCS coding systems and conventions.\nExtensive knowledge of medical terminology, anatomy and pathophysiology, pharmacology and ancillary test results.\nAdvanced knowledge of pharmacology indications for drug usage and related adverse reactions.\nKnowledge of coding systems and regulatory requirements of Inpatient Prospective Payment System (IPPS).\nExtensive knowledge with Quality Outcomes, Agency for Healthcare Research and Quality, including Patient Safety Indictors, Hospital Acquired Conditions, and mortality.\nProficient with encoder software and other coding applications/tools.\nStrong communication skills (interpersonal, verbal and written).\nStrong organizational and analytical thinking skills.\nProficient with Microsoft Office applications (Outlook, Word, Excel).\nSelf-motivated and demonstrated capacity to work independently without close supervision.\nAbility to quickly analyze a situation, problem solve and prioritize.\nKnowledge of external auditing programs; ex.: Recovery Audit Contractor (RAC), Office of the Inspector General (OIG), third-party payors.\nMaintains required continuing education credits and certification(s).\n\nPhysical Requirements and Working Conditions:\nExposed to a normal office environment.\nMust be able to sit majority of the workday and lift, bend, and stretch throughout the workday.\nMust be able to lift up to 15 lbs. occasionally.\nMust have functional vision.\nPosition requires repetitive use of hands; therefore, must have excellent fine manipulation skills.\nPosition requires travel to other sites; therefore, may be exposed to road and weather hazards.\nOperates all equipment necessary to perform the job.\n\nThis job description indicates the general nature and level of work expected of the incumbent. It is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the incumbent. Incumbent may be required to perform other related duties.\n#Remote\n#LI-Remote\nPay Range\n$28.05 - $42.10\nOur Commitment to You:\nAdvocate Health offers a comprehensive suite of Total Rewards: benefits and well-being programs, competitive compensation, generous retirement offerings, programs that invest in your career development and so much more – so you can live fully at and away from work, including:\nCompensation\nBase compensation listed within the listed pay range based on factors such as qualifications, skills, relevant experience, and/or training\nPremium pay such as shift, on call, and more based on a teammate's job\nIncentive pay for select positions\nOpportunity for annual increases based on performance\nBenefits and more\nPaid Time Off programs\nHealth and welfare benefits such as medical, dental, vision, life, and Short- and Long-Term Disability\nFlexible Spending Accounts for eligible health care and dependent care expenses\nFamily benefits such as adoption assistance and paid parental leave\nDefined contribution retirement plans with employer match and other financial wellness programs\nEducational Assistance Program\nAbout Advocate Health \nAdvocate Health is the third-largest nonprofit, integrated health system in the United States, created from the combination of Advocate Aurora Health and Atrium Health. Providing care under the names Advocate Health Care in Illinois; Atrium Health in the Carolinas, Georgia and Alabama; and Aurora Health Care in Wisconsin, Advocate Health is a national leader in clinical innovation, health outcomes, consumer experience and value-based care. Headquartered in Charlotte, North Carolina, Advocate Health services nearly 6 million patients and is engaged in hundreds of clinical trials and research studies, with Wake Forest University School of Medicine serving as the academic core of the enterprise. It is nationally recognized for its expertise in cardiology, neurosciences, oncology, pediatrics and rehabilitation, as well as organ transplants, burn treatments and specialized musculoskeletal programs. Advocate Health employs 155,000 teammates across 69 hospitals and over 1,000 care locations, and offers one of the nation’s largest graduate medical education programs with over 2,000 residents and fellows across more than 200 programs. Committed to providing equitable care for all, Advocate Health provides more than $6 billion in annual community benefits.",
        "job_location": "2 Locations"
    }
]