[
    {
        "company": "Intermountain Healthcare (IMH)",
        "company_url": "https://imh.wd5.myworkdayjobs.com/IntermountainCareers?q=nurse",
        "job_title": "Registered Nurse Mom Baby Postpartum",
        "job_href": "https://imh.wd5.myworkdayjobs.com/en-US/IntermountainCareers/job/Good-Samaritan-Hospital/Registered-Nurse-Mom-Baby-Postpartum_R144977?q=nurse",
        "job_posting_text": "locations\nGood Samaritan Hospital\ntime type\nFull time\nposted on\nPosted Today\ntime left to apply\nEnd Date: July 25, 2025 (18 days left to apply)\njob requisition id\nR144977\nJob Description:\nThe Registered Nurse (RN) is a professional caregiver who assumes responsibility and accountability for assessing, planning, implementing, and evaluating the care of patients. The staff RN utilizes the nursing process by use of technology, therapeutic intervention, evidence-based practice and coordination of care with other health team members.\nEssential Functions\nAssess: Performs appropriate assessment of physical, social, and psychological status (including cognitive, communicative, and developmental skills as appropriate). Seeks and evaluates information acquired from other members of interdisciplinary team: patient, family, physician, non-nursing disciplines, support staff, others.\nPlan: Uses assessment information and critical thinking skills to collaboratively develop individualized plan of care. Actively seeks patient, family, team, and physician involvement to develop plan of care including needed education. Collaboratively plans and prepares patients for further support needs once the current episode of care outcomes are met (i.e., teaching, referrals, and follow-up).\nImplement: Directs the interdisciplinary care team via delegation, coordination, and collaboration as appropriate. Provides or delegates care consistent with plan of care, guidelines of care and professional licensure provisions. Demonstrates the ability to set priorities and to coordinate and organize patient care delivery through effectively managing time, supplies, and resources.\nEvaluate: Evaluates patient response to interventions through review of achievement of goals, clinical outcomes, patient, and family satisfaction. Revises plan of care as indicated and reassesses changes as appropriate.\nProfessionalism: Promotes nursing profession and participate in development of others.\nIntegrates legal and ethical standards into practice, complies with regulatory standards, practices within scope of licensure, provides accurate & timely documentation, and understands legal implications of care delivery.\nSkills\nPatient Care Delivery\nNursing Fundamentals\nInterdisciplinary Teams\nDocumentations\nProfessional Etiquette\nAccountability\nPatient Care Coordination\nCommunication\nPatient Evaluation\nCritical Thinking\nPhysical Requirements:\nMinimum Qualifications\nCurrent license to practice as a Registered Nurse in state of practice. Valid compact licenses must be transferred to the state of practice within 60 days of the start of employment.\nRNs with less than 12 months of experience must obtain their Bachelor of Science in Nursing (BSN) within four (4) years of their hire date.\nBasic Life Support Certification (BLS) for healthcare providers.\nPreferred Qualifications \nBachelor's degree in nursing (BSN). Education must be obtained from an accredited institution. Degree will be verified.\nPhysical Requirements\nOngoing need for employee to see and read information, labels, assess patient needs, operate monitors, identify equipment and supplies.\nFrequent interactions with patient care providers, patients, and visitors that require employee to verbally communicate as well as hear and understand spoken information, alarms, needs, and issues quickly and accurately, particularly during emergency situations.\nManual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use and typing for documenting patient care, accessing needed information, medication preparation, etc.\nExpected to lift and utilize full range of movement to transfer patients. Will also bend to retrieve, lift, and carry supplies and equipment. Typically includes items of varying weights, up to and including heavy items.\nNeed to walk and assist with transporting/ambulating patients and obtaining and distributing supplies and equipment. This includes pushing/pulling gurneys and portable equipment, including heavy items. Often required to navigate crowded and busy rooms (full of equipment, power cords on the floor, etc.)\nMay be expected to stand in a stationary position for an extended period of time.\nFor roles requiring driving: Expected to drive a vehicle which requires sitting, seeing and reading signs, traffic signals, and other vehicles.\nLocation:\nGood Samaritan Hospital\nWork City:\nLafayette\nWork State:\nColorado\nScheduled Weekly Hours:\n36\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience. \n$37.17 - $56.17\nWe care about your well-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged. \nLearn more about our comprehensive benefits package here.\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\nAt Intermountain Health, we use the artificial intelligence (\"AI\") platform, HiredScore to improve your job application experience. HiredScore helps match your skills and experiences to the best jobs for you. While HiredScore assists in reviewing applications, all final decisions are made by Intermountain personnel to ensure fairness. We protect your privacy and follow strict data protection rules. Your information is safe and used only for recruitment. Thank you for considering a career with us and experiencing our AI-enhanced recruitment process.\nAll positions subject to close without notice.",
        "job_location": "Good Samaritan Hospital"
    },
    {
        "company": "Intermountain Healthcare (IMH)",
        "company_url": "https://imh.wd5.myworkdayjobs.com/IntermountainCareers?q=nurse",
        "job_title": "Cardiothoracic (CV) Registered Nurse Care Coordinator",
        "job_href": "https://imh.wd5.myworkdayjobs.com/en-US/IntermountainCareers/job/Heart-and-Vascular---Denver/Cardiothoracic--CV---Registered-Nurse-Care-Coordinator_R144384?q=nurse",
        "job_posting_text": "locations\nHeart and Vascular - Denver\ntime type\nFull time\nposted on\nPosted Today\ntime left to apply\nEnd Date: July 25, 2025 (18 days left to apply)\njob requisition id\nR144384\nJob Description:\nThe Nurse Care Manager works collaboratively with physicians and other members of the health care team to improve the health of patients with chronic conditions or complex needs. This position educates patients and families to help them manage their health care needs. The incumbent facilitates communication, coordinates services, addresses barriers, and promotes optimal allocation of resources while balancing clinical quality and cost management.\nJob Specifics: Schedule shift is 4 - 10s per week \nScope\n\nAs an RN Care Coordinator, you need to know how to:\nPerform comprehensive assessment of patients health needs, including health status and behaviors, level of function, psychosocial situation, and available support systems and determines potential needs.\nEstablish care plans in collaboration with the primary care physician and the patient care team.\nProvide health education.\nIdentify patients at risk for proactive intervention.\nPull and manipulate data to identify risk patients and present information to the care team.\nRefer patients to a variety of resources including, but not limited to: nutrition, social work, rehabilitation, behavioral specialist, diabetes education, Healthy Living Workshop, etc.\nContact patients who utilize ED or have been hospitalized after discharge to determine the reason for the ED visit or hospitalization and work with patient to develop a plan to avoid those facilities.\nCoordinate care for complex cases or those patients seeing multiple specialists.\nMaintain up-to-date and accurate documentation of patient assessment and plan provided to the patient to ensure the effective integration of information for use by the health care team to ensure on-going and continued quality of care, in accordance with evidence-based practice. Analyze patient care trends and actively seek out and collaborate with the care team to improve overall quality and efficiency of care.\nUse registry data to identify problems or gaps in services and initiate intervention.\nDemonstrate critical thinking for problem solving and prioritization.\nParticipate and lead patient care conferences.\nManage patient panel with physician office staff to identify appropriate patients and measure outcomes.\nCollaborate with physicians and office staff.\nPro-actively advocate for patient care issues to ensure that overall quality and type of care is sensitive to each specific patient/familys needs.\nCollaborate with payers and outside agencies to promote a patient centered delivery concept.\nParticipate in committees and activities related to the development of Medical Home, Accountable Care Organization (ACO), and other insurance carriers.\n\n\nMinimum Qualifications\n\n- Associates Degree in Nursing (ADN / ASN)- Current RN license in state of practice- Minimum of two (2) years of clinical experience in an outpatient setting or a minimum of two (2) years of experience coaching individuals with complex and/or chronic conditions\nPreferred:\nBachelors Degree (BS/BA/BSN)- Prior experience in care coordination in a community setting or primary care practice- Program development, operations management, and/or supervisory experience\nCardiovascular experience acute inpatient or in a clinic.\n\n Physical Requirements:\nOngoing need for employee to see and read information, labels, assess patient needs, operate monitors, identify equipment and supplies.- and -Frequent interactions with patient care providers, patients, and visitors that require employee to verbally communicate as well as hear and understand spoken information, alarms, needs, and issues quickly and accurately, particularly during emergency situations.- and -Manual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use and typing for documenting patient care, accessing needed information, medication preparation, etc.- and -Expected to lift and utilize full range of movement to transfer patients. Will also bend to retrieve, lift, and carry supplies and equipment. Typically includes items of varying weights, up to and including heavy items.- and -Need to walk and assist with transporting/ambulating patients and obtaining and distributing supplies and equipment. This includes pushing/pulling gurneys and portable equipment, including heavy items. Often required to navigate crowded and busy rooms (full of equipment, power cords on the floor, etc).- and -May be expected to stand in a stationary position for an extended period of time.\nLocation:\nHeart and Vascular - Denver\nWork City:\nDenver\nWork State:\nColorado\nScheduled Weekly Hours:\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience. \n$34.53 - $52.25\nWe care about your well-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged. \nLearn more about our comprehensive benefits package here.\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\nAt Intermountain Health, we use the artificial intelligence (\"AI\") platform, HiredScore to improve your job application experience. HiredScore helps match your skills and experiences to the best jobs for you. While HiredScore assists in reviewing applications, all final decisions are made by Intermountain personnel to ensure fairness. We protect your privacy and follow strict data protection rules. Your information is safe and used only for recruitment. Thank you for considering a career with us and experiencing our AI-enhanced recruitment process.\nAll positions subject to close without notice.",
        "job_location": "Heart and Vascular - Denver"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "RN SICU (FT Days) - Jefferson Einstein",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Philadelphia-PA/RN-SICU--FT-Days----Jefferson-Einstein_REQ-0012444?q=nurse",
        "job_posting_text": "locations\nPhiladelphia, PA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0012444\nJob Details\nWith a commitment to patient- and family-centered care, the professional nurse uses the nursing process in ways that values the uniqueness of each individual and addresses the physical, psychological, emotional, and social needs of the diversity of patients served by Jefferson Health. Develops nursing plans of care with the patient and their designated care partner(s) to effectively address the individualized needs and priorities of patients and are consistent with their cultural beliefs and values.\nJob Description\nEssential Functions:\n· Interacts with co-workers, patients, their family/designated care partner(s), and other staff consistent with the values of Jefferson.\n· Integrates Evidence-Based Practice, clinical expertise, patients, their family/designated care partner(s) preferences and cultural beliefs and values for delivery of optimal healthcare.\n· Partners with patients, their family/designated care partner(s)) in identifying learning needs and priorities and provides education in ways that are useful, understandable, and affirming.\n· Minimizes risk of harm to patients and others by following established nursing practices and protocols and individual performance\n· Uses information technology to communicate, manage knowledge, mitigate error, and support ethical decision making.\n· Uses data to monitor the outcomes of care processes and uses improvement methods to design and test changes to continuously improve the quality and safety of patient care.\n· Functions effectively within nursing and inter-professional teams, fostering open communication, mutual respect, and shared decision-making to achieve quality patient care.\n· Recognizes the patients, their family/designated care partner(s) in providing safe, compassionate and coordinated care based on respect for patient's personal preferences, priorities, needs, and cultural beliefs and values.\n· Creates an environment of belonging and inclusion, demonstrating skills in problem solving and conflict resolution.\n· Demonstrates a commitment to learning and seeks opportunities for continued professional growth and development and acts in primary preceptor role to appropriate staff members\n· Actively participates in hospital- and practice setting-based committees, including safety and quality improvement.\n· Demonstrates willingness to give and receive feedback and integrates appropriate changes into practice.\nQualification:\n- BSN Required\n- Previous experience as an RN in an acute care setting strongly preferred\nWork Shift\nWorkday Day (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n5501 Old York Road, Philadelphia, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Philadelphia, PA"
    }
]