[
    {
        "company": "Huntington Hospital",
        "company_url": "https://huntingtonhospital.wd5.myworkdayjobs.com/HuntingtonHospitalCareers?q=nurse",
        "job_title": "Nursing Unit Secretary PT, Evenings",
        "job_href": "https://huntingtonhospital.wd5.myworkdayjobs.com/en-US/HuntingtonHospitalCareers/job/Huntington-Hospital---Pasadena/Nursing-Unit-Secretary-PT--Evenings_R-29584?q=nurse",
        "job_posting_text": "locations\nHuntington Hospital - Pasadena\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR-29584\n** Internal Workers – Please log into your Workday account to apply **\nHuntington Hospital Employee Login\nCompensation Range:\nAnticipated compensation range of $24.00 - $25.80 / Hour depending on qualifications and experience.\nDepartment:\n701000 Emergency Services\nExpectations:\nResponsible for performing clerical and non-clinical patient duties on inpatient and outpatient units.\nThis position may require flexibility of hours.\n\nEDUCATION:\nHigh School Diploma or GED. Equivalency or one year of work related experience.\n\nEXPERIENCE/TRAINING:\nPreferred - Two years experience as a unit secretary in applicable patient care area.\nPreferred - Evidence of having participated in Performance Improvement Models i.e. conferences,  meetings, seminars, councils. \nBasic computer skills/experience with computerized documentation systems preferred.\nKnowledge/experience with use of medical terminology.\nMicrosoft Office skills or equivalent.\n\nSKILLS:\nMust be willing and able to work in a face paced, frequently changing environment. \nMust be willing and able to multi-task effectively to accomplish work assignments. \nMust be able and willing to take direction from a variety of staff members – sometimes with conflicting directions and deadlines.\nWorker Type:\nRegular\nPart time\nShift:\nEvenings",
        "job_location": "Huntington Hospital - Pasadena"
    },
    {
        "company": "Intermountain Healthcare (IMH)",
        "company_url": "https://imh.wd5.myworkdayjobs.com/IntermountainCareers?q=nurse",
        "job_title": "Cardiovascular Nursing Director",
        "job_href": "https://imh.wd5.myworkdayjobs.com/en-US/IntermountainCareers/job/Intermountain-Health-Intermountain-Medical-Center/Cardiovascular-Nursing-Director_R144898?q=nurse",
        "job_posting_text": "locations\nIntermountain Health Intermountain Medical Center\ntime type\nFull time\nposted on\nPosted Today\ntime left to apply\nEnd Date: July 14, 2025 (8 days left to apply)\njob requisition id\nR144898\nJob Description:\nThis position provides leadership and operational direction to a designated service line or group of departments at a facility. It involves working with the Chief Nursing Officer and other management to ensure optimal patient care, financial goals, and leadership development. The role has regional accountability or responsibility for multiple departments and typically reports to the Chief Nursing Officer. Job duties are distributed as follows: 20% Tactical (staffing, equipment, employee relations), 50% Operational (budget management, supply acquisition, process improvement, performance evaluations), and 30% Strategic (developing goals, holding employees accountable).\nEssential Functions\nChampions the use of available resources to ensure nursing care is efficient, effective, safe, and delivered with compassion, in line with current practice standards.\nFacilitates collaborative decision-making and upholds professional independence by contributing departmental perspectives to executive decisions and ensuring staff are updated on activities at the executive level.\nAssists with development, implementation and management of annual capital/operating and personnel (FTE) budget for unit. Provides resources effectively for department managers to meet financial goals of department.\nModels and fosters an environment of professionalism and employee engagement on the unit.\nEnsures competent and sufficient number of staff to meet patient care needs, which includes hiring, orientation, retention, and employee satisfaction.\nAccountable for the implementation of clinical program protocols, and that ongoing monitoring and process improvement occurs to assure goals are achieved.\nCollaborates with medical director and system colleagues in the development and implementation of clinical program goals.\nEvaluates staff competency through use of performance reviews and peer reviews.\nCoordinates performance and compliance with patient safety initiatives, federal, state and other regulatory bodies such as Joint Commission, OSHA, CMS, DOPL, and other unit specific accrediting and certifying bodies.\nFacilitates use of resources by nursing staff such as nurse practitioners, other expanded role RNs, and other specialty roles.\nServes as an exemplary figure for employees within all facets of providing patient care.\nMonitors and improves patient satisfaction utilizing available service metrics and national benchmarks to develop and implement action plans to achieve desired outcomes.\nPartners with physicians at the unit level to achieve clinical, operational, and service goals.\nSupports staff participation in outside community organizations such as volunteer health clinics, health fairs and advisory boards for not-for-profit organizations.\nSkills\nLeadership\nCommunication\nProblem-solving\nFinancial acumen\nClinical knowledge\nResource management\nPatient safety\nMentorship\nCommunity outreach\nMinimum Qualifications\nBachelor’s degree in nursing (BSN) from an accredited institution (degree will be verified).  \nCurrent Nursing License to practice as a Registered Nurse in state of practice.  Valid compact licenses must be transferred to the state of practice within 60 days of the start of employment.\nBasic Life Support (BLS) certification for Healthcare Providers.\nLeadership/supervisory experience.\n3 years of management experience and 2 years of clinical experience.\nPreferred Qualifications\nMaster's degree from an accredited institution (degree will be verified) must be obtained within 4 years of hire.\nExperience in the area of oversight\nSpecialty Certification\nPhysical Requirements:\nPhysical Requirements\nOngoing need for employee to see and read information, documents, monitors, identify equipment and supplies, and be able to assess customer needs.\nFrequent interactions with providers, colleagues, customers, patients/clients, and visitors that require employee to verbally communicate as well as hear and understand spoken information, needs, and issues quickly and accurately.\nManual dexterity of hands and fingers to manipulate complex and delicate equipment with precision and accuracy. This includes frequent computer use for typing, accessing needed information, etc.\nMay have the same physical requirements as those of clinical or patient care jobs, when the leader takes clinical shifts.\nFor roles requiring driving: Expected to drive a vehicle which requires sitting, seeing and reading signs, traffic signals, and other vehicles.\nWith this position, you are eligible to participate in the Annual Pay for Performance (AP4P) Plan. This plan enables Intermountain Health to provide leaders with an additional performance compensation opportunity. The AP4P award opportunities are calculated as a percentage of your base salary. Awards are paid out based on attainment of selected Board-approved goals.\nLocation:\nIntermountain Health Intermountain Medical Center\nWork City:\nMurray\nWork State:\nUtah\nScheduled Weekly Hours:\n40\nThe hourly range for this position is listed below. Actual hourly rate dependent upon experience. \n$58.62 - $90.48\nWe care about your well-being – mind, body, and spirit – which is why we provide our caregivers a generous benefits package that covers a wide range of programs to foster a sustainable culture of wellness that encompasses living healthy, happy, secure, connected, and engaged. \nLearn more about our comprehensive benefits package here.\nIntermountain Health is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\nAt Intermountain Health, we use the artificial intelligence (\"AI\") platform, HiredScore to improve your job application experience. HiredScore helps match your skills and experiences to the best jobs for you. While HiredScore assists in reviewing applications, all final decisions are made by Intermountain personnel to ensure fairness. We protect your privacy and follow strict data protection rules. Your information is safe and used only for recruitment. Thank you for considering a career with us and experiencing our AI-enhanced recruitment process.\nAll positions subject to close without notice.",
        "job_location": "Intermountain Health Intermountain Medical Center"
    },
    {
        "company": "Memorial Hermann Health System",
        "company_url": "https://memorialhermann.wd5.myworkdayjobs.com/external?q=nurse",
        "job_title": "Acute Care Nurse Practitioner or PA, - SW Cardiology",
        "job_href": "https://memorialhermann.wd5.myworkdayjobs.com/en-US/external/job/Southwest-Medical-Plaza-2/Advanced-Practice-Provider--Specialty_100145370-1?q=nurse",
        "job_posting_text": "locations\nSouthwest Medical Plaza 2\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\n100145370\nAt Memorial Hermann, we pursue a common goal of delivering high quality, efficient care while creating exceptional experiences for every member of our community. When we say every member of our community, that includes our employees. We know that when our employees feel cared for, heard and valued, they are inspired to create moments that exceed expectations, while prioritizing safety, compassion, personalization and efficiency. If you want to advance your career and contribute to our vision of creating healthier communities, now and for generations to come, we want you to be a part of our team.\nJob Summary\nResponsible for providing comprehensive patient care congruent with role and approved population foci (Family/Individual across lifespan, Adult/Gerontology, Neonatal, Pediatrics, Women’s Health/Gender Related, Psychiatric Mental Health) through systemic assessment, diagnosis, treatment, management, and follow up affecting direct patient care.\nJob Description\nMinimum Qualifications\nNurse Practitioner / Advanced Practice Nurse\nEducation: Graduate of a Nurse Practitioner program approved by the State of Texas. Masters required. May encompass the following specialties:  CRNA, CNM, CNS, CNP. May encompass the following specialties:  CRNA, CNM, CNS, CNP\nLicenses/Certifications:\nLicensed to practice professional nursing by the State of Texas\nLicensure by the State of Texas APRN and eligibility for full prescriptive authority by the State of Texas\nCertified by a recognized national certification by the State Board of Texas in area of population foci and/or additional specialty recognition beyond the APRN\nEligibility for DEA licensure\nBasic Cardiac Life Certification  or Advanced Cardiac Life Certification\nPhysician Assistant\nEducation: Graduate of a nationally accredited Physician Assistant program;  Masters strongly preferred\nLicenses/Certifications:\nCertified by the National Commission on Certification of Physician Assistants, Inc.\nLicensed by the Texas State Board of Physician Assistant Examiners\nEligibility for DEA licensure\nBasic Cardiac Life Certification  or Advanced Cardiac Life Certification)\nExperience / Knowledge / Skills:\nTwo (2) years clinical experience preferred in area of intended practice\nFirst Assist and/or EVD experience preferred\nPrincipal Accountabilities\nProvides health promotion and the assessment, diagnosis, and management of patient problems which includes the use and prescription of pharmacologic and non-pharmacologic intervention, assessment, triage, and therapeutic management of patient/family needs throughout the disease process and across the health wellness-illness continuum as an integral part of an interdisciplinary team, according to the age/needs of the patient population served.\nFor prescriptive authority, APRN or PA acts under the delegation of a supervising physician, maintaining an active Prescriptive Authority agreement in accordance with regulations and policy.\nPractices within approved protocols, guidelines, and clinical pathways and evidence based medicine.\nTransitions between inpatient/outpatient.\nDirects and evaluates throughput; delegates or provides backup assistance including triage.\nAbility to float, round to multiple facilities and/or take call (first call).\nExternal Ventricular Drain (EVD) Insertion (Mischer Neurosciences only).\nProvides accurate billing, coding and documentation.\nCompletes medical records and submit charges in a timely manner.\nResponsible for overall unit performance in collaboration with physicians or other providers.\nFirst Assist physicians in performing surgical procedures by providing support as needed.\nObtains medical histories; performs physical examinations/ reviews/orders/interprets diagnostic tests and radiographic results; formulates and manages patient treatment plan and outcomes; provides interventions and performs procedures within legal cope and authority that the APRN or PA is approved, delegated to and credentialed to perform including but not limited to incision and drainage, pelvic exams, lesion removal/destruction, suturing, and casting/splinting.\nCollaborates in the development and evaluation of patient care. Updates clinical guidelines/protocols/pathways; works autonomously and accepts accountability for outcomes; signs orders in accordance with institution and state board requirements; collaborates in research and teaching projects and applies research to practice. \nUses interpersonal and verbal communication skills to educate patient/family on care resources; participates in process improvement and multidisciplinary clinical outcome improvement activities utilizing advanced nursing expertise.\nEnsures safe care to patients, staff and visitors; adheres to all Memorial Hermann policies, procedures, and standards within budgetary specifications including time management, supply management, productivity and quality of service.\nPromotes individual professional growth and development by meeting requirements for mandatory/continuing education and skills competency; supports department-based goals which contribute to the success of the organization; serves as preceptor, mentor and resource to less experienced staff.\nDemonstrates commitment to caring for every member of our community by creating compassionate and personalized experiences. Models Memorial Hermann’s service standards by providing safe, caring, personalized and efficient experiences to patients and colleagues.\nOther duties as assigned.",
        "job_location": "Southwest Medical Plaza 2"
    },
    {
        "company": "Centene Corporation",
        "company_url": "https://centene.wd5.myworkdayjobs.com/centene_external?q=nurse",
        "job_title": "Utilization Review Clinician - Behavioral Health",
        "job_href": "https://centene.wd5.myworkdayjobs.com/en-US/centene_external/job/Remote-TX/Utilization-Review-Clinician---Behavioral-Health_1576127-1?q=nurse",
        "job_posting_text": "locations\nRemote-TX\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\n1576127\nYou could be the one who changes everything for our 28 million members as a clinical professional on our Medical Management/Health Services team. Centene is a diversified, national organization offering competitive benefits including a fresh perspective on workplace flexibility.\n Required Work Schedule: Wednesday - Saturday (Set Schedule)\nNOTE: Position requires working EVERY Saturday and rotating holidays\nFull-time Flexible Hours: 4 days, 10 hours shifts (40 hrs per week)\nMust be able to work Central Time Zone hours\nNOTE: Must be fully licensed for the state of Texas via the Texas BHEC if you hold a LPC, LCSW, or LMFT. Registered Nurse can hold Texas State Licensure and/or Compact State Licensure.\nPosition Purpose: Performs a clinical review and assesses care related to mental health and substance abuse. Monitors and determines if level of care and services related to mental health and substance abuse are medically appropriate.\nEvaluates member’s treatment for mental health and substance abuse before, during, and after services to ensure level of care and services are medically appropriate\nPerforms prior authorization reviews related to mental health and substance abuse to determine medical appropriateness in accordance with regulatory guidelines and criteria\nPerforms concurrent review of behavioral health (BH) inpatient to determine overall health of member, treatment needs, and discharge planning\nAnalyzes BH member data to improve quality and appropriate utilization of services\nProvides education to providers members and their families regrading BH utilization process\nInteracts with BH healthcare providers as appropriate to discuss level of care and/or services\nEngages with medical directors and leadership to improve the quality and efficiency of care\nFormulates and presents cases in staffing and integrated rounds\nPerforms other duties as assigned\nComplies with all policies and standards\nEducation/Experience: Requires Graduate of an Accredited School Nursing or Bachelor's degree and 2 – 4 years of related experience.\n Requires Graduate of an Accredited School Nursing or Bachelor's degree and 2 – 4 years of related behavioral health or substance abuse or ASAM experience. OR\nMaster’s degree for behavioral health clinicians is required\nMaster's degree AND 2 - 4 years of related behavioral health and/or substance abuse addiction disorders experience is preferred.\nClinical knowledge and ability to review and/or assess treatment plans related to mental health and substance abuse is preferred.\nKnowledge of mental health and substance abuse utilization review process is preferred.\nExperience working with providers and healthcare teams to review care services related to mental health and substance abuse is preferred.\nUtilization Review/ Utilization management with behavioral health cases\nPrecertification, Concurrent Review, Discharge reviews for behavioral health\nDirect in patient Behavioral Health and SUD inpatient hospital experience\nManaged care knowledge is preferred\nWorking knowledge and experience with the ASAM Criteria and levels of care for Addiction Treatment is preferred\nDirect BH/SUD inpatient intake assessments experience is preferred\nDirect work experience in In-Patient Behavioral Health Units, Partial Hospitalization, or Residential Treatment is required\nLicense to practice independently, and/or have obtained the state required licensure as outlined by the applicable state required.\n\nLicense/Certification:\nLCSW- License Clinical Social Worker required or\nLMHC-Licensed Mental Health Counselor required or\nLPC-Licensed Professional Counselor required or\nLicensed Marital and Family Therapist (LMFT) required or\nLicensed Mental Health Professional (LMHP) required or\nRN - Registered Nurse - State Licensure and/or Compact State Licensure required\nPay Range: $26.50 - $47.59 per hour\nCentene offers a comprehensive benefits package including: competitive pay, health insurance, 401K and stock purchase plans, tuition reimbursement, paid time off plus holidays, and a flexible approach to work with remote, hybrid, field or office work schedules.  Actual pay will be adjusted based on an individual's skills, experience, education, and other job-related factors permitted by law, including full-time or part-time status.  Total compensation may also include additional forms of incentives.  Benefits may be subject to program eligibility.\nCentene is an equal opportunity employer that is committed to diversity, and values the ways in which we are different. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other characteristic protected by applicable law.\n\nQualified applicants with arrest or conviction records will be considered in accordance with the LA County Ordinance and the California Fair Chance Act",
        "job_location": "Remote-TX"
    }
]