[
    {
        "company": "Huntington Hospital",
        "company_url": "https://huntingtonhospital.wd5.myworkdayjobs.com/HuntingtonHospitalCareers?q=nurse",
        "job_title": "Registered Nurse 12HR Nights, Psychiatric - ICU",
        "job_href": "https://huntingtonhospital.wd5.myworkdayjobs.com/en-US/HuntingtonHospitalCareers/job/Huntington-Hospital---Pasadena/Registered-Nurse-12HR_R-29597?q=nurse",
        "job_posting_text": "locations\nHuntington Hospital - Pasadena\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-29597\n** Internal Workers – Please log into your Workday account to apply **\nHuntington Hospital Employee Login\nCompensation Range:\nAnticipated compensation range of $47.88 - $71.23 / Hour depending on qualifications and experience.\n*12 hour shifts at Huntington Health are overtime-based (not a straight time rate for all 12 hours). Therefore, employees who work a full 12-hour shift will be paid their base rate for 8 hours AND overtime (1.5) for hours up to 12.\nDepartment:\n634001 Psychiatric - ICU\nExpectations:\nResponsible for coordination of care to meet identified needs of the patient/family. Supervises the management of patient care utilizing critical thinking and nursing process, discharge planning, resource identification, linking and scheduling patients with required services, monitoring care delivery, advocating for the patient, care planning and evaluating outcomes. Coordinates patient care across the health care continuum, and assists other team members with meeting individual patient needs.\nThis position may require flexibility of hours.\n\nEDUCATION:\nBachelor’s degree (BSN) required.   Associate Degree in Nursing (ADN) will be considered if enrolled in a BSN program with degree completion within 2 years of date of hire or date of transfer to an RN position. Diploma or transcripts on highest degree earned required.\n\nEXPERIENCE/TRAINING:\nMinimum 1 year of current experience in acute care area of expertise/equivalent service area, 2 years preferred.\nBasic computer skills/experience with computerized documentation systems required.\n\nLICENSES/CERTIFICATIONS:\nRequired:\nCurrent unrestricted Registered Nurse (RN) license issued by California Board of Registered Nursing (BRN)\nCurrent Basic Life Support Provider (BLS) issued by American Heart Association\n\nPreferred:\nCurrent unrestricted Registered Nurse-Board Certified (RN-BC)\n\nSKILLS:\n-Ensures all patients' rights are intact. Reports all violations and all patient complaints to Psychiatric Unit Shift Supervisor\n-Provides therapeutic structure and assist staff therapist in group settings.\n-Provides patient education.\n-Continually updates knowledge base in terms of the special needs of the various patient populations served.\n-Assists in planning and providing care to meet the developmental needs of the patient populations.\n-Provides supervision to every team member on the unit/shift (PCA, LVN, LPT, Sitter)\n-Enforces all safety policies and procedures carried out by team members.\n-Follows all applicable guidelines and policies during events such as Code Gray, Seclusion and Restraints, and other Codes.\n-Cross trained and competent to work on any DMC inpatient unit.\nWorker Type:\nRegular\nFull time\nShift:\nNights",
        "job_location": "Huntington Hospital - Pasadena"
    },
    {
        "company": "Stanford Health Care",
        "company_url": "https://stanfordhealthcare.wd5.myworkdayjobs.com/SHC_Tri-Valley_External_Careers?q=nurse",
        "job_title": "Physical Therapist Wound Care - Full Time - Days",
        "job_href": "https://stanfordhealthcare.wd5.myworkdayjobs.com/en-US/SHC_Tri-Valley_External_Careers/job/5555-W-Las-Positas-Blvd---PLEASANTON/Physical-Therapist-Wound-Care---Full-Time---Days_R2548804?q=nurse",
        "job_posting_text": "locations\n5555 W. Las Positas Blvd. - PLEASANTON\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR2548804\nIf you're ready to be part of our legacy of hope and innovation, we encourage you to take the first step and explore our current job openings. Your best is waiting to be discovered. \n Day - 08 Hour (United States of America)\nJob Summary:\nThe Wound Care Physical Therapist is responsible for providing MIST Therapy, patient care, and education to acute and chronic wounds, urinary incontinence and pressure injuries.\nEssential Functions:\nThe essential functions listed below are general examples and not a description of comprehensive duties.\nSpecific duties and responsibilities may vary depending on department or program needs without changing the nature or scope of this position or level of responsibility. May be asked to perform other duties as assigned.\nAssess patient s pertinent prior medical histories, skin integrity problems, acute and chronic wounds to develop an appropriate plan of care for each patient.\nProvide Ultrasound MIST Therapy to patients identified to benefit from the treatment to enhance wound healing.\nEducate patients and families on wound and problems with skin integrity etiology, systematic factors which they can impact, and self-care where practical.\nProvides real-time education to all staff members to improve their wound care, early mobility and pressure injury prevention skills.\nConsults with physicians, nurses, case managers, pharmacists and therapists to provide coordinated care specific to the patient.\nDocuments clearly the plan of care, education, specific steps in care, including products and how they are to be used.\nParticipate in 2 PI Surveys annually.\nWilling to provide mentorship on future physical therapy students on wound care and pressure injury prevention management.\nEmployee must perform all duties and responsibilities in accordance with the C-I-CARE Standards of the hospital. C-I-CARE is the foundation of Stanford Healthcare – Tri-Valley’s patient-experience and represents a framework for patient-centered interactions.\nJob Qualifications:\nEducation: \nGraduate of an accredited Physical Therapy Program, Masters or Doctorate degree preferred.\nCompletion of Wound Care Education program or has successfully completed experiential program and certification through an accredited institution (e.g. NAWCO, APTA Specialist Certification Program) prior or within the first year of hire.\nExperience:\nPreferred minimum of 2 years full time or 4 years part time years of direct wound care bedside experience, experience with wound debridement preferred.\nProof of continuing education on wound care in the last license renewal or active participation in current facility’s wound care or pressure injury prevention program.\nLicense/Certification:\nCurrent permanent/unrestricted license to practice physical therapy in the United States or any of its possessions or territories.\nCurrent CA PT license.\nCurrent American Heart Association BLS Certification.\nKnowledge, Skills, and Abilities:\nMaintains high level of competence in wound care specialization.\nPrevious documentation experience within the EPIC electronic health record environment strongly preferred.\nStrong communication skills – Ability to read, write and understand the English language.\nStrong attention to detail.\nAbility to problem solve and adapt to a changing environment.\nAbility to use information and keep abreast of developments in technology to communicate, manage knowledge, mitigate error, and support decision-making in patient care.\nAbility to work as a valued team member, but also autonomously.\nAbility to positively influence others to meet patient needs and achieve shared goals.\nAbility to effectively prioritize to provide quality and valued patient care.\nKnowledge of principles, practices and current trends in health care and hospital system organization and administration sufficient to provide clinical judgement, leadership, coordination and operational direction for assigned areas of responsibilities.\nPhysical Demand and Working Conditions:\nThe physical requirements and working conditions in which the job is typically performed are available from Occupational Health Department. Reasonable accommodations will be made to enable individuals with disabilities to perform the essential functions of the job.\nEqual Opportunity Employer:\nEqual Opportunity Employer Stanford Health Care – Tri-Valley (SHC-TV) strongly values diversity and is committed to equal opportunity and non-discrimination in all of it’s policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements.\nEqual Opportunity Employer Stanford Health Care (SHC) strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements.\nBase Pay Scale: Generally starting at $47.71 - $64.96 per hour\nThe salary of the finalist selected for this role will be set based on a variety of factors, including but not limited to, internal equity, experience, education, specialty and training. This pay scale is not a promise of a particular wage.",
        "job_location": "5555 W. Las Positas Blvd. - PLEASANTON"
    },
    {
        "company": "Roswell Park Comprehensive Cancer Center",
        "company_url": "https://roswellpark.wd5.myworkdayjobs.com/ExternalCareers?q=nurse",
        "job_title": "Nurse II - Perioperative Care Unit",
        "job_href": "https://roswellpark.wd5.myworkdayjobs.com/en-US/ExternalCareers/job/Hospital/Nurse-II---Perioperative-Care-Unit_R-19623?q=nurse",
        "job_posting_text": "locations\nHospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-19623\nTitle: \nNurse II - Perioperative Care Unit\nJob Type:\nRegular\nCompany:\nRoswell Park Comprehensive Cancer Center\nDepartment: \nPerioperative Care Unit\nTime Type: \nFull time\nWeekly Hours: \n37.5\nFTE:\n0.9375\nShift: \nSecond Shift (United States of America)\nSummary: \nPlans, provides and supervises nursing interventions for individuals with cancer and cancer-related health care problems; diagnoses and treats human responses to actual or potential health problems through such services as patient care, health teaching, and health counseling; provides interventions supportive to or restorative of life and well-being; executes medical regimens prescribed by a physician, dentist or other licensed health care provider authorized by the State Education Commissioner’s regulations; supervises Nurse I’s, Licensed Practical Nurses, Hospital Clinical Assistants and Clinical Support Assistants; performs administrative tasks with assigned area of responsibility; enhances professional growth and development through participation in educational programs, current literature, inservice meetings and workshops.\nQualifications:\nRequired Education and Experience\n\nLicense Requirement\nLicense to practice as a Registered Nurse in the State of New York.\n\nEducation and Experience\n1. Graduation from an accredited school of nursing and the equivalent of one (1) year of full-time oncology nursing experience; or\n2. Graduation from an accredited school of nursing and the equivalent of one (1) year of full-time critical care experience; or\n3. Graduation from an accredited school of nursing and the equivalent of two (2) years of full-time medical-surgical experience in an acute care setting; or\n4. Graduation from an accredited school of nursing, the equivalent of one (1) year of full-time medical-surgical experience in an acute care setting and completion of Roswell Park nursing orientation with the ability to function independently at a satisfactory level for three (3) months (full-time) as a Nurse I at Roswell Park.\n\nNOTE:\n1. Incumbents will serve a one (1) year full-time probationary period as a Nurse II.\n2. Required degrees must have been granted by an accredited school, college or university or one recognized by Roswell Park Comprehensive Cancer Center as following acceptable educational practices.\nPreferred Qualifications\nPreferred qualifications include at least one year of critical care nursing experience, along with prior perioperative experience. Candidates should hold current Advanced Cardiac Life Support (ACLS) and Pediatric Advanced Life Support (PALS) certifications, demonstrating the ability to respond effectively in high-acuity and emergency situations across patient populations.\nEqual Employment Opportunity Statement\nRoswell Park Cancer Institute Corporation (RPCIC) and Health Research Inc. (HRI) Roswell Park Division believe that all persons are entitled to equal employment opportunities, and we do not discriminate against our employees, applicants or job seekers because of their race, color, religion, sex, sexual orientation, gender identity or expression, national origin, creed, age, disability, pregnancy-related condition, military or veteran status, marital or familial status, domestic violence victim status, citizenship status, genetic information, individual’s relationship or association with a member of a protected category or any other protected group status as defined by law.\nReasonable Accommodation Request\nRPCIC and HRI are committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the employment process, please email HR-PayAndBenefits@RoswellPark.org and let us know the nature of your request and your contact information.\nOur Core Values\nRPCIC and HRI are committed to providing an environment where patients, families, employees and community are treated with courtesy and respect. We support an inclusive environment that nurtures the talents, skills and abilities of each individual to embody and reflect our core values: Innovation, Integrity, Teamwork, Commitment, Compassion and Respect.\nHistorical Compensation Information Statement \nPursuant to Executive Order 161, no State entity, as defined by the Executive Order, is permitted to ask, or mandate, in any form, that an applicant for employment provide his or her current compensation, or any prior compensation history, until such time as the applicant is extended a conditional offer of employment with compensation. If such information has been requested from you before such time, please contact the Governor’s Office of Employee Relations at (518) 474-6988 or via email at info@goer.ny.gov.",
        "job_location": "Hospital"
    },
    {
        "company": "Roswell Park Comprehensive Cancer Center",
        "company_url": "https://roswellpark.wd5.myworkdayjobs.com/ExternalCareers?q=nurse",
        "job_title": "Nurse II [RP-N]",
        "job_href": "https://roswellpark.wd5.myworkdayjobs.com/en-US/ExternalCareers/job/Hospital/Nurse-II--RP-N-_R-19021?q=nurse",
        "job_posting_text": "locations\nHospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-19021\nTitle: \nNurse II [RP-N]\nJob Type:\nRegular\nCompany:\nRoswell Park Comprehensive Cancer Center\nDepartment: \nOperating Room\nTime Type: \nFull time\nWeekly Hours: \n37.5\nFTE:\n0.9375\nShift: \nSecond Shift (United States of America)\nSummary: \nQualifications:\nRequired Education and Experience\n\nLicense Requirement\nLicense to practice as a Registered Nurse in the State of New York.\n\nEducation and Experience\n1. Graduation from an accredited school of nursing and the equivalent of one (1) year of full-time oncology nursing experience; or\n2. Graduation from an accredited school of nursing and the equivalent of one (1) year of full-time critical care experience; or\n3. Graduation from an accredited school of nursing and the equivalent of two (2) years of full-time medical-surgical experience in an acute care setting; or\n4. Graduation from an accredited school of nursing, the equivalent of one (1) year of full-time medical-surgical experience in an acute care setting and completion of Roswell Park nursing orientation with the ability to function independently at a satisfactory level for three (3) months (full-time) as a Nurse I at Roswell Park.\n\nNOTE:\n1. Incumbents will serve a one (1) year full-time probationary period as a Nurse II.\n2. Required degrees must have been granted by an accredited school, college or university or one recognized by Roswell Park Comprehensive Cancer Center as following acceptable educational practices.\nEqual Employment Opportunity Statement\nRoswell Park Cancer Institute Corporation (RPCIC) and Health Research Inc. (HRI) Roswell Park Division believe that all persons are entitled to equal employment opportunities, and we do not discriminate against our employees, applicants or job seekers because of their race, color, religion, sex, sexual orientation, gender identity or expression, national origin, creed, age, disability, pregnancy-related condition, military or veteran status, marital or familial status, domestic violence victim status, citizenship status, genetic information, individual’s relationship or association with a member of a protected category or any other protected group status as defined by law.\nReasonable Accommodation Request\nRPCIC and HRI are committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the employment process, please email HR-PayAndBenefits@RoswellPark.org and let us know the nature of your request and your contact information.\nOur Core Values\nRPCIC and HRI are committed to providing an environment where patients, families, employees and community are treated with courtesy and respect. We support an inclusive environment that nurtures the talents, skills and abilities of each individual to embody and reflect our core values: Innovation, Integrity, Teamwork, Commitment, Compassion and Respect.\nHistorical Compensation Information Statement \nPursuant to Executive Order 161, no State entity, as defined by the Executive Order, is permitted to ask, or mandate, in any form, that an applicant for employment provide his or her current compensation, or any prior compensation history, until such time as the applicant is extended a conditional offer of employment with compensation. If such information has been requested from you before such time, please contact the Governor’s Office of Employee Relations at (518) 474-6988 or via email at info@goer.ny.gov.",
        "job_location": "Hospital"
    },
    {
        "company": "Methodist Le Bonheur Healthcare",
        "company_url": "https://methodisthealth.wd5.myworkdayjobs.com/MLH?q=nurse",
        "job_title": "Registered Nurse (RN) - Med/Surg/Ortho - 3rd Floor - FT - Nights (@)",
        "job_href": "https://methodisthealth.wd5.myworkdayjobs.com/en-US/MLH/job/Methodist-North-Hospital/RN---Med-Surg---North---Full-Time---Nights_R-6132?q=nurse",
        "job_posting_text": "locations\nMethodist North Hospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-6132\nIf you are looking to make an impact on a meaningful scale, come join us as we embrace the Power of One!\n We strive to be an employer of choice and establish a reputation for being a talent rich organization where Associates can grow their career caring for others. For over a century, we’ve served the health care needs of the people of Memphis and the Mid-South.\n Methodist North - Med Surg Registered Nurse (RN)\nAddress: 3960 New Covington Pike; Memphis, TN 38128\nFull Time Nights : Three 12 Hour Night Shifts, 7pm - 7am\n\n Working at MLH means carrying the mission forward of caring for our community and impacting the lives of patients in every way through compassion, a deliberate focus on service expectations and a consistent thriving for excellence.\n\nA Brief Overview\nResponsible for delivering and coordinating nursing care for patients within a multidisciplinary team, utilizing the nursing process to ensure comprehensive, high-quality care. Provides compassionate, patient-centered care while supporting patients and families through emotional challenges and crises. Prioritizes patient safety and strives for optimal care outcomes through evidence-based practice. Educates and advocates for both patients and their families, empowering them with the knowledge and resources needed for treatment and self-care. Demonstrates professionalism and upholds the MLH Mission, Vision, and Values, serving as a role model for excellence in nursing practice.\n\nWhat you will do\nConducts comprehensive nursing assessments to determine appropriate interventions and develop individualized care plans.\nProvides patient and family education on care plans, medications, and self-care strategies.\nDevelops, implements, and adjusts personalized patient care plans based on ongoing clinical assessments.\nAdministers medications safely, following best practices in medication management.\nCollaborates with interdisciplinary teams to ensure coordinated, high-quality patient care.\n\nEducation Qualifications\nPost-Graduate Certificate or Diploma Nursing - RN\nPreferred: Bachelor's Degree Nursing - RN\nExperience Qualifications\nMinimum of 6 months RN experience\nPreferred: Greater than 1 year experience in similar clinical setting\nSkills and Abilities\nComprehensive understanding of patient care, including the ability to conduct thorough assessments using the nursing process.\nStrong knowledge of the Nurse Practice Act and the scope of practice for a Registered Nurse.\nAbility to process complex clinical information using critical thinking to develop, implement, and support individualized care plans.\nAbility to effectively delegate tasks to team members, ensuring a collaborative, team-based approach to delivering high-quality patient care.\nFamiliarity with healthcare technology that enhances patient safety and care efficiency (e.g., bar code scanning, electronic health records).\nLicenses and Certifications\nBASIC LIFE SUPPORT - American Heart Association\nRegistered Nurse Tennessee - Tennessee Board of Nursing\nPreferred: Certification in clinical specialty\nSupervision Provided by this Position\nThe Registered Nurse directs and delegates all patient care activities on nursing units.\nPhysical Demands\nThe physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion.\nMust have good balance and coordination.\nThe physical requirements of this position are: medium work - exerting up to 50 lbs. of force occasionally and/or up to 25 lbs. of force frequently.\nThe Associate is required to have close visual acuity including color, depth perception, and field of vision to perform an activity, such as assessing patients, preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading.\nFrequent invasive and non-invasive patient contact.\nExposure to patient body fluids as well as exposure to hazardous or poisonous materials.\nAbility to react quickly to emergency situations.\nOur Associates are passionate about what they do, the service they provide and the patients they serve. We value family, team and a Power of One culture that requires commitment to the highest standards of care and unity.\n\nBoasting one of the South's largest medical centers, Memphis blends a friendly community, a thriving and growing downtown, and a low cost of living. We see each day as a new opportunity to make a difference in the lives of the people in our community.",
        "job_location": "Methodist North Hospital"
    },
    {
        "company": "Methodist Le Bonheur Healthcare",
        "company_url": "https://methodisthealth.wd5.myworkdayjobs.com/MLH?q=nurse",
        "job_title": "Registered Nurse (RN) - OR - FT - 9a - 930p - University (@)",
        "job_href": "https://methodisthealth.wd5.myworkdayjobs.com/en-US/MLH/job/Methodist-University-Hospital/RN---University-CV-OR---10-hr-Days_R-6332?q=nurse",
        "job_posting_text": "locations\nMethodist University Hospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-6332\nIf you are looking to make an impact on a meaningful scale, come join us as we embrace the Power of One!\n We strive to be an employer of choice and establish a reputation for being a talent rich organization where Associates can grow their career caring for others. For over a century, we’ve served the health care needs of the people of Memphis and the Mid-South.\n Responsible for the nursing care of patients requiring specialized judgment and skill. This judgment and skill is based on knowledge of the natural, behavioral and nursing sciences and humanities as the basis for application of the nursing process in wellness and illness care.\nModels appropriate behavior as exemplified in MLH Mission, Vision and Values.\n\n Working at MLH means carrying the mission forward of caring for our community and impacting the lives of patients in every way through compassion, a deliberate focus on service expectations and a consistent thriving for excellence.\n\nA Brief Overview\nResponsible for delivering and coordinating nursing care for patients within a multidisciplinary team, utilizing the nursing process to ensure comprehensive, high-quality care. Provides compassionate, patient-centered care while supporting patients and families through emotional challenges and crises. Prioritizes patient safety and strives for optimal care outcomes through evidence-based practice. Educates and advocates for both patients and their families, empowering them with the knowledge and resources needed for treatment and self-care. Demonstrates professionalism and upholds the MLH Mission, Vision, and Values, serving as a role model for excellence in nursing practice.\n\nWhat you will do\nConducts comprehensive nursing assessments to determine appropriate interventions and develop individualized care plans.\nProvides patient and family education on care plans, medications, and self-care strategies.\nDevelops, implements, and adjusts personalized patient care plans based on ongoing clinical assessments.\nAdministers medications safely, following best practices in medication management.\nCollaborates with interdisciplinary teams to ensure coordinated, high-quality patient care.\n\nEducation Qualifications\nPost-Graduate Certificate or Diploma Nursing - RN\nPreferred: Bachelor's Degree Nursing - RN\nExperience Qualifications\nMinimum of 6 months RN experience\nPreferred: Greater than 1 year experience in similar clinical setting\nSkills and Abilities\nComprehensive understanding of patient care, including the ability to conduct thorough assessments using the nursing process.\nStrong knowledge of the Nurse Practice Act and the scope of practice for a Registered Nurse.\nAbility to process complex clinical information using critical thinking to develop, implement, and support individualized care plans.\nAbility to effectively delegate tasks to team members, ensuring a collaborative, team-based approach to delivering high-quality patient care.\nFamiliarity with healthcare technology that enhances patient safety and care efficiency (e.g., bar code scanning, electronic health records).\nLicenses and Certifications\nBASIC LIFE SUPPORT - American Heart Association\nRegistered Nurse Tennessee - Tennessee Board of Nursing\nPreferred: Certification in clinical specialty\nSupervision Provided by this Position\nThe Registered Nurse directs and delegates all patient care activities on nursing units.\nPhysical Demands\nThe physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion.\nMust have good balance and coordination.\nThe physical requirements of this position are: medium work - exerting up to 50 lbs. of force occasionally and/or up to 25 lbs. of force frequently.\nThe Associate is required to have close visual acuity including color, depth perception, and field of vision to perform an activity, such as assessing patients, preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading.\nFrequent invasive and non-invasive patient contact.\nExposure to patient body fluids as well as exposure to hazardous or poisonous materials.\nAbility to react quickly to emergency situations.\nOur Associates are passionate about what they do, the service they provide and the patients they serve. We value family, team and a Power of One culture that requires commitment to the highest standards of care and unity.\n\nBoasting one of the South's largest medical centers, Memphis blends a friendly community, a thriving and growing downtown, and a low cost of living. We see each day as a new opportunity to make a difference in the lives of the people in our community.",
        "job_location": "Methodist University Hospital"
    },
    {
        "company": "Methodist Le Bonheur Healthcare",
        "company_url": "https://methodisthealth.wd5.myworkdayjobs.com/MLH?q=nurse",
        "job_title": "Registered Nurse (RN) - Dialysis - Nights (@)",
        "job_href": "https://methodisthealth.wd5.myworkdayjobs.com/en-US/MLH/job/Methodist-University-Hospital/Registered-Nurse--RN----Dialysis---Nights_R-7421?q=nurse",
        "job_posting_text": "remote type\nOn Campus\nlocations\nMethodist University Hospital\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-7421\nIf you are looking to make an impact on a meaningful scale, come join us as we embrace the Power of One!\n We strive to be an employer of choice and establish a reputation for being a talent rich organization where Associates can grow their career caring for others. For over a century, we’ve served the health care needs of the people of Memphis and the Mid-South.\n Responsible for the nursing care of dialysis patients requiring specialized judgment and skill. This judgment and skill is based on knowledge of the natural, behavioral and nursing sciences and humanities as the basis for application of the nursing process in diabetic care. Models appropriate behavior as exemplified in MLH Mission, Vision and Values.\n\n Working at MLH means carrying the mission forward of caring for our community and impacting the lives of patients in every way through compassion, a deliberate focus on service expectations and a consistent thriving for excellence.\n\nA Brief Overview\nResponsible for the nursing care of dialysis patients requiring specialized judgment and skill. This judgment and skill is based on knowledge of the natural, behavioral and nursing sciences and humanities as the basis for application of the nursing process in diabetic care. Models appropriate behavior as exemplified in MLH Mission, Vision and Values. \n\nWhat you will do\nProvides Practice Excellence through specialized nursing assessment, care, evaluation and education to patients and families in accordance with established policies and procedures.\nPromotes evidence based practice by using research to develop, implement and evaluate process standards, such as plans of care, protocols and guidelines.\nProvides Leadership Excellence in clinical practice area.\nDemonstrates a commitment to Learning Excellence through professional development and clinical expertise.\nDemonstrates Role Clarity through professional competence, expertise, and knowledge, and supports the nursing profession through role modeling and fostering an environment of growth and learning.\nPromotes Cultural Excellence with recognition and appreciation for cultural, ethnic, and generational diversity.\n\nEducation/Formal Training Requirements\nAssociate's Degree Nursing- RN \nBachelor's Degree Nursing- RN \n\nWork Experience Requirements\n1-3 years Registered Nurse \n\nLicenses and Certifications Requirements\nBASIC LIFE SUPPORT - American Heart Association  \nRegistered Nurse Arkansas - Arkansas State Board of Nursing  \nRegistered Nurse Tennessee - Tennessee Board of Nursing  \nRegistered Nurse Arkansas - Arkansas State Board of Nursing  \n\nKnowledge, Skills and Abilities\nAnalytical skills necessary to assess complex patient conditions effectively and to develop comprehensive plans of care.\nSynthesizes multiple sources of information to assist in the resolution of human responses to complex problems.\nSkill and proficiency in applying highly technical principles, concepts and techniques, which are central to the nursing profession.\nOther certifications may be required depending on assigned nursing unit.\n\nSupervision Provided by this Position\nThe Registered Nurse directs and delegates all patient care activities on nursing units.\n\nPhysical Demands\nThe physical activities of this position may include climbing, pushing, standing, hearing, walking, reaching, grasping, kneeling, stooping, and repetitive motion. \nMust have good balance and coordination. \nThe physical requirements of this position are: medium work - exerting up to 50 lbs. of force occasionally and/or up to 25 lbs. of force frequently. \nThe Associate is required to have close visual acuity including color, depth perception, and field of vision to perform an activity, such as assessing patients, preparing and analyzing data and figures; transcribing; viewing a computer terminal; or extensive reading. \nFrequent invasive and non-invasive patient contact. \nExposure to patient body fluids as well as exposure to hazardous or poisonous materials. \nAbility to react quickly to emergency situations. \n\nOur Associates are passionate about what they do, the service they provide and the patients they serve.  We value family, team and a Power of One culture that requires commitment to the highest standards of care and unity.\n\nBoasting one of the South's largest medical centers, Memphis blends a friendly community, a thriving and growing downtown, and a low cost of living. We see each day as a new opportunity to make a difference in the lives of the people in our community.",
        "job_location": "Methodist University Hospital"
    },
    {
        "company": "Advocate Aurora Health (AAH)",
        "company_url": "https://aah.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Registered Nurse (RN) - Cardiac - St. Luke's",
        "job_href": "https://aah.wd5.myworkdayjobs.com/en-US/External/job/Aurora-St-Lukes-Medical-Center---2900-W-Oklahoma-Ave/Registered-Nurse--RN----Cardiac---St-Luke-s_R167452?q=nurse",
        "job_posting_text": "locations\nAurora St Lukes Medical Center - 2900 W Oklahoma Ave\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR167452\nDepartment:\nStatus: \nFull time\nBenefits Eligible:\nYes\nHours Per Week:\n36\nSchedule Details/Additional Information:\nNights, ,1900-0730 Every 3rd weekend rotation, 50% holidays/year\nOur Cardiac Angioplasty unit is seeking a dynamic newly licensed or tenured nurse to join our team of nursing excellence. Join Aurora St. Luke's is a 6 TIMES Magnet designated Medical Center.\n\nPerks of joining 10S Cardiac Angioplasty \n$10,000 Sign-on Bonus!\nUp to $20,000 Loan Support Program!\nUp to $7,200 Education Assistance\nNurse Residency Program for Newly Licensed RNs\nNursing Certification fee paid through ANCC’s Success Pays Program\nComprehensive and progressive 12 weeks orientation\nMentor/Mentee Program available for all nurses\nContinuing Education Credits\nRobust Nursing Shared Governance\nGenerous Benefits package\n10 S is a 24 bed a fast paced high acuity unit that specializes on pre and post interventional cardiology patients. 10S also serves a large volume of chest pain/STEMI patients, heart failure patients, and pre-op open heart surgery/TAVR patients.  If interested in the newest technology and breakthrough medical procedures in cardiac care this is a place for you. If you are a nurse who thrives in high paced environments this is a unit for you! \nAdvocate Aurora Health provides a leading-edge residency program with your future in mind. The New Graduate Nurse Residency Program is evidence-based and support the professional development, confidence, and overall well-being of the nurse resident as they transition from academia to the practice setting. \nNight Shift Differential $5/hr\nWeekend Differential $2/hr\n\nMajor Responsibilities:\nUses the nursing process to assess the needs of the patient, plan and implement individualized interventions and evaluate the effectiveness of the plan of care. Includes the patient and family in planning and implementing care and develops and maintains a therapeutic relationship throughout the healthcare continuum.\nAnticipates and recognizes significant changes in the patient’s condition, status, and need for care. Provides ongoing assessment of the patient and takes appropriate actions when changes occur. Anticipates and alters the plan of care as needed, mobilizes appropriate resources, and collaborates with other health care team members to coordinate patient centered care.\nImplements strategies to reduce patient risk and increase patient safety. Assesses patient and family readiness to learn and individualizes the approach as necessary. Works collaboratively to develop strategies to meet the learning needs of the patient and family.\nActively coordinates the discharge plan utilizing an interdisciplinary approach. Applies evidence-based practice to deliver patient care. Consistently incorporates nursing and regulatory standards of care into practice.\nProvides ongoing evaluation of patient, team, and unit outcomes and is empowered to take appropriate action when changes are needed. Supports shared governance activities and initiatives to improve processes and patient outcomes.\nDemonstrates effective communication, feedback, and conflict resolution skills. Promotes collaboration among healthcare team members. Assumes a leadership role in the care team and delegates appropriately to unlicensed personnel.\nPromotes a culture of safety through identifying threats to patient safety and intervening to prevent patient harm. Reports patient safety events and near misses in a timely manner. Seeks to identify potential safety issues and assists in the implementation of corrective actions.\nApplies ethical decision making, demonstrates respect and understanding for peers, and other clinical disciplines. Participates as an effective member of the patient care team to formulate an integrated, unbiased, individualized approach to care.\nParticipates in quality/process improvement initiatives to improve the functions of the department and the patient care experience.\nParticipates in professional activities which contribute to personal professional development and the development of others. Seeks opportunities to be taught, coached, and mentored. Attends required meetings/educational programs and completes annual competencies in a timely manner.\nMust be able to demonstrate knowledge and skills necessary to provide care appropriate to the age of the patients served. Must demonstrate knowledge of the principles of growth and development over the life span and possess the ability to assess data reflective of the patient's status and interpret the appropriate information needed to identify each patient's requirements relative to his/her age-specific needs, and to provide the care needed as described in the department's policies and procedures. Age-specific information is developed further in the departmental job standards.\n\nLicensure, Registration, and/or Certification Required:\nRegistered Nurse license issued by the state in which the team member practices, and\nBasic Life Support (BLS) for Healthcare Providers certification issued by the American Heart Association (AHA).\n\nEducation Required:\nCompletion of an accredited or approved program in Nursing.\n\nExperience Required:\nNew Grads Welcome\n\nKnowledge, Skills & Abilities Required:\nDemonstrates progression to provide holistic patient care and the ability to view clinical situations from a patient and family focus.\nDemonstrates progression to recognize situational changes that require unplanned or unanticipated interventions, and responds to situations with confidence, timeliness and flexibility.\nProficient computer skills, use of electronic mail and electronic medical records systems.\nExcellent communication (written and verbal), listening and interpersonal skills.\nDemonstrates human relation skills with the ability to develop rapport and maintain positive, professional relationships with a variety of patients, team members and physicians. Ability to take initiative and work collaboratively with others.\nDemonstrated ability to effectively make critical, independent decisions.\nExcellent organization, prioritization and problem-solving skills.\nDemonstrates time management skills with an ability to multi-task and prioritize in an environment with frequent interruptions.\nDemonstrates coordination, collaboration, delegation and team building skills.\nCertification Addendum:\nTeam members will maintain annual educational requirements for hospital based certifications (e.g. DNV, CARF or others)\n\nPhysical Requirements and Working Conditions:\nMust be able to sit, stand, walk, lift, squat, bend, reach above shoulders, and twist frequently throughout the workday.\nMust be able to:\nlift up to 50 lbs. from floor to waist.\nlift up to 20 lbs. over the head.\ncarry up to 40 lbs. a reasonable distance.\nMust be able to:\npush/pull with 30 lbs. of force.\nperform a sliding transfer of 150 lbs. with a second person present.\nPosition requires use of foot pedals on carts or machines.\nMay be exposed to chemical and hazardous waste as well as blood and body fluids and communicable disease. Therefore, protective clothing and equipment must be worn as necessary.\nMust have functional speech, vision, hearing, and touch with ability to use fine hand manipulation skills for IV insertion and other procedures/functions.\nOperates all equipment necessary to perform the job.\n\nThis job description indicates the general nature and level of work expected of the incumbent. It is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the incumbent. Incumbent may be required to perform other related duties.\n#AuroraGMKERN\nMilitary friendly organization\n\n Pay Range\n$37.50 - $56.25\nOur Commitment to You:\nAdvocate Health offers a comprehensive suite of Total Rewards: benefits and well-being programs, competitive compensation, generous retirement offerings, programs that invest in your career development and so much more – so you can live fully at and away from work, including:\nCompensation\nBase compensation listed within the listed pay range based on factors such as qualifications, skills, relevant experience, and/or training\nPremium pay such as shift, on call, and more based on a teammate's job\nIncentive pay for select positions\nOpportunity for annual increases based on performance\nBenefits and more\nPaid Time Off programs\nHealth and welfare benefits such as medical, dental, vision, life, and Short- and Long-Term Disability\nFlexible Spending Accounts for eligible health care and dependent care expenses\nFamily benefits such as adoption assistance and paid parental leave\nDefined contribution retirement plans with employer match and other financial wellness programs\nEducational Assistance Program\nAbout Advocate Health \nAdvocate Health is the third-largest nonprofit, integrated health system in the United States, created from the combination of Advocate Aurora Health and Atrium Health. Providing care under the names Advocate Health Care in Illinois; Atrium Health in the Carolinas, Georgia and Alabama; and Aurora Health Care in Wisconsin, Advocate Health is a national leader in clinical innovation, health outcomes, consumer experience and value-based care. Headquartered in Charlotte, North Carolina, Advocate Health services nearly 6 million patients and is engaged in hundreds of clinical trials and research studies, with Wake Forest University School of Medicine serving as the academic core of the enterprise. It is nationally recognized for its expertise in cardiology, neurosciences, oncology, pediatrics and rehabilitation, as well as organ transplants, burn treatments and specialized musculoskeletal programs. Advocate Health employs 155,000 teammates across 69 hospitals and over 1,000 care locations, and offers one of the nation’s largest graduate medical education programs with over 2,000 residents and fellows across more than 200 programs. Committed to providing equitable care for all, Advocate Health provides more than $6 billion in annual community benefits.",
        "job_location": "Aurora St Lukes Medical Center - 2900 W Oklahoma Ave"
    },
    {
        "company": "Advocate Aurora Health (AAH)",
        "company_url": "https://aah.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Registered Nurse (RN) - Emergency Department - Southshore",
        "job_href": "https://aah.wd5.myworkdayjobs.com/en-US/External/job/Aurora-St-Lukes-South-Shore---5900-S-Lake-Dr/Registered-Nurse---RN----Emergency-Department---Southshore_R167451?q=nurse",
        "job_posting_text": "locations\nAurora St Lukes South Shore - 5900 S Lake Dr\nposted on\nPosted Today\njob requisition id\nR167451\nDepartment:\nStatus: \nBenefits Eligible:\nYes\nHours Per Week:\n36\nSchedule Details/Additional Information:\nFull time, 2nd shift, 1500-0330, Every 3rd weekend rotation, 50% holiday requirement\nThe amazing team at Southshore’s Community Hospital is an experienced group of caregivers who treat patients with various emergent and critical care needs. This Level IV trauma unit welcomes experienced and strong communicators who are skilled and engaged to provide a compassionate level of patient centered care with collaboration and a commitment to delivery high quality, exceptional care. This high volume, fast-paced unit is needing dynamic teammates like you! \nWhat we offer: \n·Up to $10,000 sign on bonus for eligible RN's \n·Student Loan Forgiveness up to $20,000 \n·Tuition Reimbursement up to $7,200 \n·Referral Bonus up to $5,000 \n·Career Advancement \nWhy choose Advocate Aurora Health: \nPrimary Stroke Center \nAccredited Geriatric Emergency Department \nModern Healthcare - Top Organization for Diversity \nSeramount - Best organization for Multicultural Women \nAORN Go Clear Award - Gold Level - Surgical Smoke-Free Recognition Program \nActive Professional Governance \nPrimary Stroke Center \nAccredited Geriatric Emergency Department \nModern Healthcare - Top Organization for Diversity \nSeramount - Best organization for Multicultural Women \nAORN Go Clear Award - Gold Level - Surgical Smoke-Free Recognition Program \nForbes 2024 Best-In-State Employer \n1+ year acute RN experienced required\nMajor Responsibilities:\nUses the nursing process to assess the needs of the patient, plan and implement individualized interventions and evaluate the effectiveness of the plan of care. Includes the patient and family in planning and implementing care and develops and maintains a therapeutic relationship throughout the healthcare continuum.\nAnticipates and recognizes significant changes in the patient’s condition, status, and need for care. Provides ongoing assessment of the patient and takes appropriate actions when changes occur. Anticipates and alters the plan of care as needed, mobilizes appropriate resources, and collaborates with other health care team members to coordinate patient centered care.\nImplements strategies to reduce patient risk and increase patient safety. Assesses patient and family readiness to learn and individualizes the approach as necessary. Works collaboratively to develop strategies to meet the learning needs of the patient and family.\nActively coordinates the discharge plan utilizing an interdisciplinary approach. Applies evidence-based practice to deliver patient care. Consistently incorporates nursing and regulatory standards of care into practice.\nProvides ongoing evaluation of patient, team, and unit outcomes and is empowered to take appropriate action when changes are needed. Supports shared governance activities and initiatives to improve processes and patient outcomes.\nDemonstrates effective communication, feedback, and conflict resolution skills. Promotes collaboration among healthcare team members. Assumes a leadership role in the care team and delegates appropriately to unlicensed personnel.\nPromotes a culture of safety through identifying threats to patient safety and intervening to prevent patient harm. Reports patient safety events and near misses in a timely manner. Seeks to identify potential safety issues and assists in the implementation of corrective actions.\nApplies ethical decision making, demonstrates respect and understanding for peers, and other clinical disciplines. Participates as an effective member of the patient care team to formulate an integrated, unbiased, individualized approach to care.\nParticipates in quality/process improvement initiatives to improve the functions of the department and the patient care experience.\nParticipates in professional activities which contribute to personal professional development and the development of others. Seeks opportunities to be taught, coached, and mentored. Attends required meetings/educational programs and completes annual competencies in a timely manner.\nMust be able to demonstrate knowledge and skills necessary to provide care appropriate to the age of the patients served. Must demonstrate knowledge of the principles of growth and development over the life span and possess the ability to assess data reflective of the patient's status and interpret the appropriate information needed to identify each patient's requirements relative to his/her age-specific needs, and to provide the care needed as described in the department's policies and procedures. Age-specific information is developed further in the departmental job standards.\n\nLicensure, Registration, and/or Certification Required:\nRegistered Nurse license issued by the state in which the team member practices, and\nBasic Life Support (BLS) for Healthcare Providers certification issued by the American Heart Association (AHA).\n\nEducation Required:\nCompletion of an accredited or approved program in Nursing.\n\nExperience Required:\nMinimum 1 year of experience in clinical nursing required - Would consider a newly licensed RN with EMT, Paramedic, ED externship experience \n\nKnowledge, Skills & Abilities Required:\nDemonstrates progression to provide holistic patient care and the ability to view clinical situations from a patient and family focus.\nDemonstrates progression to recognize situational changes that require unplanned or unanticipated interventions, and responds to situations with confidence, timeliness and flexibility.\nProficient computer skills, use of electronic mail and electronic medical records systems.\nExcellent communication (written and verbal), listening and interpersonal skills.\nDemonstrates human relation skills with the ability to develop rapport and maintain positive, professional relationships with a variety of patients, team members and physicians. Ability to take initiative and work collaboratively with others.\nDemonstrated ability to effectively make critical, independent decisions.\nExcellent organization, prioritization and problem-solving skills.\nDemonstrates time management skills with an ability to multi-task and prioritize in an environment with frequent interruptions.\nDemonstrates coordination, collaboration, delegation and team building skills.\nCertification Addendum:\nTeam members will maintain annual educational requirements for hospital based certifications (e.g. DNV, CARF or others)\n\nPhysical Requirements and Working Conditions:\nMust be able to sit, stand, walk, lift, squat, bend, reach above shoulders, and twist frequently throughout the workday.\nMust be able to:\nlift up to 50 lbs. from floor to waist.\nlift up to 20 lbs. over the head.\ncarry up to 40 lbs. a reasonable distance.\nMust be able to:\npush/pull with 30 lbs. of force.\nperform a sliding transfer of 150 lbs. with a second person present.\nPosition requires use of foot pedals on carts or machines.\nMay be exposed to chemical and hazardous waste as well as blood and body fluids and communicable disease. Therefore, protective clothing and equipment must be worn as necessary.\nMust have functional speech, vision, hearing, and touch with ability to use fine hand manipulation skills for IV insertion and other procedures/functions.\nOperates all equipment necessary to perform the job.\n\nThis job description indicates the general nature and level of work expected of the incumbent. It is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the incumbent. Incumbent may be required to perform other related duties.\nPay Range\n$37.50 - $56.25\nOur Commitment to You:\nAdvocate Health offers a comprehensive suite of Total Rewards: benefits and well-being programs, competitive compensation, generous retirement offerings, programs that invest in your career development and so much more – so you can live fully at and away from work, including:\nCompensation\nBase compensation listed within the listed pay range based on factors such as qualifications, skills, relevant experience, and/or training\nPremium pay such as shift, on call, and more based on a teammate's job\nIncentive pay for select positions\nOpportunity for annual increases based on performance\nBenefits and more\nPaid Time Off programs\nHealth and welfare benefits such as medical, dental, vision, life, and Short- and Long-Term Disability\nFlexible Spending Accounts for eligible health care and dependent care expenses\nFamily benefits such as adoption assistance and paid parental leave\nDefined contribution retirement plans with employer match and other financial wellness programs\nEducational Assistance Program\nAbout Advocate Health \nAdvocate Health is the third-largest nonprofit, integrated health system in the United States, created from the combination of Advocate Aurora Health and Atrium Health. Providing care under the names Advocate Health Care in Illinois; Atrium Health in the Carolinas, Georgia and Alabama; and Aurora Health Care in Wisconsin, Advocate Health is a national leader in clinical innovation, health outcomes, consumer experience and value-based care. Headquartered in Charlotte, North Carolina, Advocate Health services nearly 6 million patients and is engaged in hundreds of clinical trials and research studies, with Wake Forest University School of Medicine serving as the academic core of the enterprise. It is nationally recognized for its expertise in cardiology, neurosciences, oncology, pediatrics and rehabilitation, as well as organ transplants, burn treatments and specialized musculoskeletal programs. Advocate Health employs 155,000 teammates across 69 hospitals and over 1,000 care locations, and offers one of the nation’s largest graduate medical education programs with over 2,000 residents and fellows across more than 200 programs. Committed to providing equitable care for all, Advocate Health provides more than $6 billion in annual community benefits.",
        "job_location": "Aurora St Lukes South Shore - 5900 S Lake Dr"
    },
    {
        "company": "Advocate Aurora Health (AAH)",
        "company_url": "https://aah.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Registered Nurse (RN) - Emergency Department - Southshore",
        "job_href": "https://aah.wd5.myworkdayjobs.com/en-US/External/job/Aurora-St-Lukes-South-Shore---5900-S-Lake-Dr/Registered-Nurse---RN----Emergency-Department---Southshore_R167450?q=nurse",
        "job_posting_text": "locations\nAurora St Lukes South Shore - 5900 S Lake Dr\nposted on\nPosted Today\njob requisition id\nR167450\nDepartment:\nStatus: \nBenefits Eligible:\nYes\nHours Per Week:\n36\nSchedule Details/Additional Information:\nFull time, Four 8 hr shifts 1900-0330, Every 3rd weekend rotation, 50% holiday requirement\nThe amazing team at Southshore’s Community Hospital is an experienced group of caregivers who treat patients with various emergent and critical care needs. This Level IV trauma unit welcomes experienced and strong communicators who are skilled and engaged to provide a compassionate level of patient centered care with collaboration and a commitment to delivery high quality, exceptional care. This high volume, fast-paced unit is needing dynamic teammates like you! \nWhat we offer: \n·Up to $10,000 sign on bonus for eligible RN's \n·Student Loan Forgiveness up to $20,000 \n·Tuition Reimbursement up to $7,200 \n·Referral Bonus up to $5,000 \n·Career Advancement \nWhy choose Advocate Aurora Health: \nPrimary Stroke Center \nAccredited Geriatric Emergency Department \nModern Healthcare - Top Organization for Diversity \nSeramount - Best organization for Multicultural Women \nAORN Go Clear Award - Gold Level - Surgical Smoke-Free Recognition Program \nActive Professional Governance \nPrimary Stroke Center \nAccredited Geriatric Emergency Department \nModern Healthcare - Top Organization for Diversity \nSeramount - Best organization for Multicultural Women \nAORN Go Clear Award - Gold Level - Surgical Smoke-Free Recognition Program \nForbes 2024 Best-In-State Employer \n1+ year acute RN experienced required\nMajor Responsibilities:\nUses the nursing process to assess the needs of the patient, plan and implement individualized interventions and evaluate the effectiveness of the plan of care. Includes the patient and family in planning and implementing care and develops and maintains a therapeutic relationship throughout the healthcare continuum.\nAnticipates and recognizes significant changes in the patient’s condition, status, and need for care. Provides ongoing assessment of the patient and takes appropriate actions when changes occur. Anticipates and alters the plan of care as needed, mobilizes appropriate resources, and collaborates with other health care team members to coordinate patient centered care.\nImplements strategies to reduce patient risk and increase patient safety. Assesses patient and family readiness to learn and individualizes the approach as necessary. Works collaboratively to develop strategies to meet the learning needs of the patient and family.\nActively coordinates the discharge plan utilizing an interdisciplinary approach. Applies evidence-based practice to deliver patient care. Consistently incorporates nursing and regulatory standards of care into practice.\nProvides ongoing evaluation of patient, team, and unit outcomes and is empowered to take appropriate action when changes are needed. Supports shared governance activities and initiatives to improve processes and patient outcomes.\nDemonstrates effective communication, feedback, and conflict resolution skills. Promotes collaboration among healthcare team members. Assumes a leadership role in the care team and delegates appropriately to unlicensed personnel.\nPromotes a culture of safety through identifying threats to patient safety and intervening to prevent patient harm. Reports patient safety events and near misses in a timely manner. Seeks to identify potential safety issues and assists in the implementation of corrective actions.\nApplies ethical decision making, demonstrates respect and understanding for peers, and other clinical disciplines. Participates as an effective member of the patient care team to formulate an integrated, unbiased, individualized approach to care.\nParticipates in quality/process improvement initiatives to improve the functions of the department and the patient care experience.\nParticipates in professional activities which contribute to personal professional development and the development of others. Seeks opportunities to be taught, coached, and mentored. Attends required meetings/educational programs and completes annual competencies in a timely manner.\nMust be able to demonstrate knowledge and skills necessary to provide care appropriate to the age of the patients served. Must demonstrate knowledge of the principles of growth and development over the life span and possess the ability to assess data reflective of the patient's status and interpret the appropriate information needed to identify each patient's requirements relative to his/her age-specific needs, and to provide the care needed as described in the department's policies and procedures. Age-specific information is developed further in the departmental job standards.\n\nLicensure, Registration, and/or Certification Required:\nRegistered Nurse license issued by the state in which the team member practices, and\nBasic Life Support (BLS) for Healthcare Providers certification issued by the American Heart Association (AHA).\n\nEducation Required:\nCompletion of an accredited or approved program in Nursing.\n\nExperience Required:\nMinimum 1 year of experience in clinical nursing required - Would consider a newly licensed RN with EMT, Paramedic, ED externship experience \n\nKnowledge, Skills & Abilities Required:\nDemonstrates progression to provide holistic patient care and the ability to view clinical situations from a patient and family focus.\nDemonstrates progression to recognize situational changes that require unplanned or unanticipated interventions, and responds to situations with confidence, timeliness and flexibility.\nProficient computer skills, use of electronic mail and electronic medical records systems.\nExcellent communication (written and verbal), listening and interpersonal skills.\nDemonstrates human relation skills with the ability to develop rapport and maintain positive, professional relationships with a variety of patients, team members and physicians. Ability to take initiative and work collaboratively with others.\nDemonstrated ability to effectively make critical, independent decisions.\nExcellent organization, prioritization and problem-solving skills.\nDemonstrates time management skills with an ability to multi-task and prioritize in an environment with frequent interruptions.\nDemonstrates coordination, collaboration, delegation and team building skills.\nCertification Addendum:\nTeam members will maintain annual educational requirements for hospital based certifications (e.g. DNV, CARF or others)\n\nPhysical Requirements and Working Conditions:\nMust be able to sit, stand, walk, lift, squat, bend, reach above shoulders, and twist frequently throughout the workday.\nMust be able to:\nlift up to 50 lbs. from floor to waist.\nlift up to 20 lbs. over the head.\ncarry up to 40 lbs. a reasonable distance.\nMust be able to:\npush/pull with 30 lbs. of force.\nperform a sliding transfer of 150 lbs. with a second person present.\nPosition requires use of foot pedals on carts or machines.\nMay be exposed to chemical and hazardous waste as well as blood and body fluids and communicable disease. Therefore, protective clothing and equipment must be worn as necessary.\nMust have functional speech, vision, hearing, and touch with ability to use fine hand manipulation skills for IV insertion and other procedures/functions.\nOperates all equipment necessary to perform the job.\n\nThis job description indicates the general nature and level of work expected of the incumbent. It is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the incumbent. Incumbent may be required to perform other related duties.\nPay Range\n$21.45 - $56.25\nOur Commitment to You:\nAdvocate Health offers a comprehensive suite of Total Rewards: benefits and well-being programs, competitive compensation, generous retirement offerings, programs that invest in your career development and so much more – so you can live fully at and away from work, including:\nCompensation\nBase compensation listed within the listed pay range based on factors such as qualifications, skills, relevant experience, and/or training\nPremium pay such as shift, on call, and more based on a teammate's job\nIncentive pay for select positions\nOpportunity for annual increases based on performance\nBenefits and more\nPaid Time Off programs\nHealth and welfare benefits such as medical, dental, vision, life, and Short- and Long-Term Disability\nFlexible Spending Accounts for eligible health care and dependent care expenses\nFamily benefits such as adoption assistance and paid parental leave\nDefined contribution retirement plans with employer match and other financial wellness programs\nEducational Assistance Program\nAbout Advocate Health \nAdvocate Health is the third-largest nonprofit, integrated health system in the United States, created from the combination of Advocate Aurora Health and Atrium Health. Providing care under the names Advocate Health Care in Illinois; Atrium Health in the Carolinas, Georgia and Alabama; and Aurora Health Care in Wisconsin, Advocate Health is a national leader in clinical innovation, health outcomes, consumer experience and value-based care. Headquartered in Charlotte, North Carolina, Advocate Health services nearly 6 million patients and is engaged in hundreds of clinical trials and research studies, with Wake Forest University School of Medicine serving as the academic core of the enterprise. It is nationally recognized for its expertise in cardiology, neurosciences, oncology, pediatrics and rehabilitation, as well as organ transplants, burn treatments and specialized musculoskeletal programs. Advocate Health employs 155,000 teammates across 69 hospitals and over 1,000 care locations, and offers one of the nation’s largest graduate medical education programs with over 2,000 residents and fellows across more than 200 programs. Committed to providing equitable care for all, Advocate Health provides more than $6 billion in annual community benefits.",
        "job_location": "Aurora St Lukes South Shore - 5900 S Lake Dr"
    }
]