[
    {
        "company": "Huntington Hospital",
        "company_url": "https://huntingtonhospital.wd5.myworkdayjobs.com/HuntingtonHospitalCareers?q=nurse",
        "job_title": "Nursing Unit Secretary FT, Days",
        "job_href": "https://huntingtonhospital.wd5.myworkdayjobs.com/en-US/HuntingtonHospitalCareers/job/Huntington-Hospital---Pasadena/Nursing-Unit-Secretary-FT--Days_R-29483?q=nurse",
        "job_posting_text": "locations\nHuntington Hospital - Pasadena\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-29483\n** Internal Workers – Please log into your Workday account to apply **\nHuntington Hospital Employee Login\nCompensation Range:\nAnticipated compensation range of $23.00 - $25.80 / Hour depending on qualifications and experience.\nDepartment:\n701000 Emergency Services\nExpectations:\nResponsible for performing clerical and non-clinical patient duties on inpatient and outpatient units.\nThis position may require flexibility of hours.\n\nEDUCATION:\nHigh School Diploma or GED. Equivalency or one year of work related experience.\n\nEXPERIENCE/TRAINING:\nPreferred - Two years experience as a unit secretary in applicable patient care area.\nPreferred - Evidence of having participated in Performance Improvement Models i.e. conferences,  meetings, seminars, councils. \nBasic computer skills/experience with computerized documentation systems preferred.\nKnowledge/experience with use of medical terminology.\nMicrosoft Office skills or equivalent.\n\nSKILLS:\nMust be willing and able to work in a face paced, frequently changing environment. \nMust be willing and able to multi-task effectively to accomplish work assignments. \nMust be able and willing to take direction from a variety of staff members – sometimes with conflicting directions and deadlines.\nWorker Type:\nRegular\nFull time\nShift:\nDays",
        "job_location": "Huntington Hospital - Pasadena"
    },
    {
        "company": "Huntington Hospital",
        "company_url": "https://huntingtonhospital.wd5.myworkdayjobs.com/HuntingtonHospitalCareers?q=nurse",
        "job_title": "Nursing Unit Secretary FT, Nights",
        "job_href": "https://huntingtonhospital.wd5.myworkdayjobs.com/en-US/HuntingtonHospitalCareers/job/Huntington-Hospital---Pasadena/Nursing-Unit-Secretary-FT--Nights_R-29482?q=nurse",
        "job_posting_text": "locations\nHuntington Hospital - Pasadena\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR-29482\n** Internal Workers – Please log into your Workday account to apply **\nHuntington Hospital Employee Login\nCompensation Range:\nAnticipated compensation range of $23.00 - $25.80 / Hour depending on qualifications and experience.\nDepartment:\n701000 Emergency Services\nExpectations:\nResponsible for performing clerical and non-clinical patient duties on inpatient and outpatient units.\nThis position may require flexibility of hours.\n\nEDUCATION:\nHigh School Diploma or GED. Equivalency or one year of work related experience.\n\nEXPERIENCE/TRAINING:\nPreferred - Two years experience as a unit secretary in applicable patient care area.\nPreferred - Evidence of having participated in Performance Improvement Models i.e. conferences,  meetings, seminars, councils. \nBasic computer skills/experience with computerized documentation systems preferred.\nKnowledge/experience with use of medical terminology.\nMicrosoft Office skills or equivalent.\n\nSKILLS:\nMust be willing and able to work in a face paced, frequently changing environment. \nMust be willing and able to multi-task effectively to accomplish work assignments. \nMust be able and willing to take direction from a variety of staff members – sometimes with conflicting directions and deadlines.\nWorker Type:\nRegular\nFull time\nShift:\nNights",
        "job_location": "Huntington Hospital - Pasadena"
    },
    {
        "company": "Roswell Park Comprehensive Cancer Center",
        "company_url": "https://roswellpark.wd5.myworkdayjobs.com/ExternalCareers?q=nurse",
        "job_title": "Nurse Anesthetist (Part Time)",
        "job_href": "https://roswellpark.wd5.myworkdayjobs.com/en-US/ExternalCareers/job/Bieler-Clinical-Sciences-Center-BCSC/Nurse-Anesthetist--RP-N-_R-17343?q=nurse",
        "job_posting_text": "locations\nBieler Clinical Sciences Center (BCSC)\ntime type\nPart time\nposted on\nPosted Today\njob requisition id\nR-17343\nTitle: \nNurse Anesthetist (Part Time)\nJob Type:\nRegular\nCompany:\nRoswell Park Comprehensive Cancer Center\nDepartment: \nAnesthesiology\nTime Type: \nPart time\nWeekly Hours: \n20\nFTE:\n0.5\nShift: \nFirst Shift (United States of America)\nSummary: \nPlans and administers anesthesia to patients according to established procedures.\n\nThis is a part time position with flexible shifts and start times.\nQualifications:\nRequired Education and Experience\n\nLicense and Certification Requirement\n1. Current license to practice as a Registered Nurse in the State of New York.\n2. Eligibility for certification by the Council on Certification of Nurse Anesthetists.\n3. Current certification in Advanced Cardiac Life Support (ACLS).\nEducation and Experience\nBachelor’s degree in Nursing and successful completion of an accredited nurse anesthesia program.\n\nNOTE:\nRequired degrees must have been granted by an accredited school, college or university or one recognized by Roswell Park Comprehensive Cancer Center as following acceptable educational practices.\nEqual Employment Opportunity Statement\nRoswell Park Cancer Institute Corporation (RPCIC) and Health Research Inc. (HRI) Roswell Park Division believe that all persons are entitled to equal employment opportunities, and we do not discriminate against our employees, applicants or job seekers because of their race, color, religion, sex, sexual orientation, gender identity or expression, national origin, creed, age, disability, pregnancy-related condition, military or veteran status, marital or familial status, domestic violence victim status, citizenship status, genetic information, individual’s relationship or association with a member of a protected category or any other protected group status as defined by law.\nReasonable Accommodation Request\nRPCIC and HRI are committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the employment process, please email HR-PayAndBenefits@RoswellPark.org and let us know the nature of your request and your contact information.\nOur Core Values\nRPCIC and HRI are committed to providing an environment where patients, families, employees and community are treated with courtesy and respect. We support an inclusive environment that nurtures the talents, skills and abilities of each individual to embody and reflect our core values: Innovation, Integrity, Teamwork, Commitment, Compassion and Respect.\nHistorical Compensation Information Statement \nPursuant to Executive Order 161, no State entity, as defined by the Executive Order, is permitted to ask, or mandate, in any form, that an applicant for employment provide his or her current compensation, or any prior compensation history, until such time as the applicant is extended a conditional offer of employment with compensation. If such information has been requested from you before such time, please contact the Governor’s Office of Employee Relations at (518) 474-6988 or via email at info@goer.ny.gov.",
        "job_location": "Bieler Clinical Sciences Center (BCSC)"
    },
    {
        "company": "Jefferson Health",
        "company_url": "https://jeffersonhealth.wd5.myworkdayjobs.com/ThomasJeffersonExternal?q=nurse",
        "job_title": "Crisis Resource Tech FT Night Jefferson Einstein",
        "job_href": "https://jeffersonhealth.wd5.myworkdayjobs.com/en-US/ThomasJeffersonExternal/job/Philadelphia-PA/Crisis-Resource-Tech-FT-Night-Jefferson-Einstein_REQ-0010749-2?q=nurse",
        "job_posting_text": "locations\nPhiladelphia, PA\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nREQ-0010749\nJob Details\nCRT FT N\nJob Description\nAbout Jefferson \nJoin the mission of Improving Lives as a Crisis Response Tech at Jefferson Health. With more than 42,000 employees, we’re the second largest employer in Philadelphia and the largest health system in the Philadelphia region. Our work to improve lives is never done. \n About Our Unit \nThis unit is located at Jefferson Einstein Hospital in Philadelphia, PA.  \n Awards & Recognition \nJefferson Einstein Hospital is Magnet Recognized. Jefferson is also recognized as the 2nd Best Hospital in the Philadelphia Metro area and the 3rd Best Hospital in Pennsylvania \nJefferson Einstein Hospital is also recognized for its high performance in the following procedures/conditions: Congestive Heart Failure & Kidney Failure \n Schedule Commitment \nFull Time: 8 hour shifts\n64 to 80 biweekly hours\nEvery other weekend\nEvery other holiday\nDay: 7a – 3:30p\nEvening: 3p – 11:30p\nNight: 11p – 7:30a\nPart Time: 8 hour shifts\n32 – 40 biweekly hours\nEvery other weekend\nEvery other holiday\nDay: 7a – 3:30p\nEvening: 3p – 11:30p\nNight: 11p – 7:30a\nPRN:  8 hour shift\nDay: 7a – 3:30p\nEvening: 3:00p – 11:30p\nNight: 11p – 7:30a\n24 hrs Weekend per 6 wk schedule\n1 winter / 1 summer\nSchedules are available 6 weeks in advance. The work schedule commitment for this position requires the following: \nResponsibilities \n Reporting to the Nurse Manager, Mental Health/Behavioral Health Techs will provide direct bedside care to patients: \nAssists the RN in delivering care, observing patient behaviors, and more. \nReports/documents any changes in patients mood or behavior in a timely fashion. \nProvides one-on-one sessions with assigned patients as needed. \nCrisis Response Technicians will maintain a full patient caseload with an assigned primary nurse in an inpatient setting and provide care for all patients effectively and compassionately. \n Qualifications \nTo qualify as a Crisis Response Tech, you must meet the following requirements for consideration: \n High School Diploma or equivalent required \nAt Least 12 college credits, and full college degree preferred \nBS or BA in behavioral health field preferred \nOne-year experience with behavioral health clients preferred \nBLS through AHA required \nMust be trained in PEAT and able to safely schedule and restrain an aggressively acting out patient \nTotal Rewards  \nAs a valued member of the team, you will be eligible to receive our total rewards package which includes:  \n Comprehensive Medical, Dental, & Vision Plans  \nRetirement Plans  \nTuition Reimbursement  \nVoluntary benefits \nHealth Coaching, Commuter Discounts, Day Care Services, etc.  \nWork Shift\nWorkday Day (United States of America)\nWorker Sub Type\nRegular\nPrimary Location Address\n5501 Old York Road, Philadelphia, Pennsylvania, United States of America\nNationally ranked, Jefferson, which is principally located in the greater Philadelphia region, Lehigh Valley and Northeastern Pennsylvania and southern New Jersey, is reimagining health care and higher education to create unparalleled value. Jefferson is more than 65,000 people strong, dedicated to providing the highest-quality, compassionate clinical care for patients; making our communities healthier and stronger; preparing tomorrow's professional leaders for 21st-century careers; and creating new knowledge through basic/programmatic, clinical and applied research. Thomas Jefferson University, home of Sidney Kimmel Medical College, Jefferson College of Nursing, and the Kanbar College of Design, Engineering and Commerce, dates back to 1824 and today comprises 10 colleges and three schools offering 200+ undergraduate and graduate programs to more than 8,300 students. Jefferson Health, nationally ranked as one of the top 15 not-for-profit health care systems in the country and the largest provider in the Philadelphia and Lehigh Valley areas, serves patients through millions of encounters each year at 32 hospitals campuses and more than 700 outpatient and urgent care locations throughout the region. Jefferson Health Plans is a not-for-profit managed health care organization providing a broad range of health coverage options in Pennsylvania and New Jersey for more than 35 years.    \nJefferson is committed to providing equal educa­tional and employment opportunities for all persons without regard to age, race, color, religion, creed, sexual orientation, gender, gender identity, marital status, pregnancy, national origin, ancestry, citizenship, military status, veteran status, handicap or disability or any other protected group or status. \nBenefits\nAt Jefferson, we offer a comprehensive total rewards package designed to support the health and well-being of our colleagues and their families. It includes a wide range of benefits including competitive pay, health and retirement benefits, life and disability insurance, paid time off, educational benefits, financial and mental health resources and much more. Our diverse benefits offerings ensure you have the coverage and access to services you need to thrive both personally and professionally. ",
        "job_location": "Philadelphia, PA"
    },
    {
        "company": "Advocate Aurora Health (AAH)",
        "company_url": "https://aah.wd5.myworkdayjobs.com/External?q=nurse",
        "job_title": "Registered Nurse (RN) - Neuro Medical Stroke",
        "job_href": "https://aah.wd5.myworkdayjobs.com/en-US/External/job/Aurora-St-Lukes-Medical-Center---2900-W-Oklahoma-Ave/Registered-Nurse--RN----Neuro-Medical-Stroke_R155831-1?q=nurse",
        "job_posting_text": "locations\nAurora St Lukes Medical Center - 2900 W Oklahoma Ave\ntime type\nFull time\nposted on\nPosted Today\njob requisition id\nR155831\nDepartment:\nStatus: \nFull time\nBenefits Eligible:\nYes\nHours Per Week:\n36\nSchedule Details/Additional Information:\nFull time and Part time opportunities\nNight shift\n12 hr shifts\nEvery 3rd Weekend requirement 50% of Holiday requirements\nOur Neuro Medical/Stroke unit is seeking a dynamic newly licensed or tenured nurse to join our team of nursing excellence. Join Aurora St. Luke's a 6 times Magnet designated Medical Center!\n\nOnly one position open! \n 10LM is a 22 bed unit caring for stroke patients and patients with seizure disorders. The unit is part of the Comprehensive Stroke Program at Aurora St. Luke's. Nurses also manage video the EEG monitoring program for admitted patients with seizures. Stroke patients admitted to Neuro ICU typically transfer to this unit for care. The partnership between units makes this department a great unit for novice nurses looking to build a foundation to later transfer to critical care (ICU). \nPerks of joining 10LM Neuro Medical \nAcuity based staffing ratios for optimal safety.\n$10,000 Sign-on Bonus!\nUp to $20,000 Loan Support Program! We will pay your monthly student loan payment.\nUp to $7,200 Education Assistance a year – We want you to grow and invests in your professional development by helping pay for coursework associated with career advancement.\nComprehensive and progressive 12 weeks orientation\nNurse Residency Program for Newly Licensed RNs\nNursing Certification initial and renewal fee paid through ANCC’s Success Pays Program\nMentor/Mentee Program available for all nurses\nContinuing Education Credits - Complementary\nRobust Nursing Professional Governance at unit, site, area and enterprise level – nurses have a voice at Aurora Health Care\nGenerous Benefits package including health and dental insurance, paid time off, paid parental leave, adoption assistance and retirement plans.\nOptions for a variety of schedules and shifts that offer flexibility and allow for work-life balance.\nAccess to Aurora Healthcare Wellness Options that support employee/family well-being.\nAn enterprise where nursing excellence is recognized and celebrated through several award programs such as the DAISY Award, DAISY Leadership Award and DAISY Team Award.\n\nWe are the communities we serve. Our nurses are involved in multiple community initiatives and environmentally conscious projects through our Community partners, the Aurora Foundation and our Green Team and Sustainability programs.\nAdvocate Aurora Health provides a leading-edge residency program with your future in mind. The New Graduate Nurse Residency Program is evidence-based and support the professional development, confidence, and overall well-being of the nurse resident as they transition from academia to the practice setting. The ANCC Practice Transition Accreditation Program® (PTAP) sets the global standard for residency or fellowship programs that transition registered nurses. Your success is important to us.\nWeekend Differential $2/hr\nNight Shift Differential $5/hr\n\nThis a great unit for novice nurses interested in building a foundation for critical care - ICU in the neuro service line.\nMajor Responsibilities:\nUses the nursing process to assess the needs of the patient, plan and implement individualized interventions and evaluate the effectiveness of the plan of care. Includes the patient and family in planning and implementing care and develops and maintains a therapeutic relationship throughout the healthcare continuum.\nAnticipates and recognizes significant changes in the patient’s condition, status, and need for care. Provides ongoing assessment of the patient and takes appropriate actions when changes occur. Anticipates and alters the plan of care as needed, mobilizes appropriate resources, and collaborates with other health care team members to coordinate patient centered care.\nImplements strategies to reduce patient risk and increase patient safety. Assesses patient and family readiness to learn and individualizes the approach as necessary. Works collaboratively to develop strategies to meet the learning needs of the patient and family.\nActively coordinates the discharge plan utilizing an interdisciplinary approach. Applies evidence-based practice to deliver patient care. Consistently incorporates nursing and regulatory standards of care into practice.\nProvides ongoing evaluation of patient, team, and unit outcomes and is empowered to take appropriate action when changes are needed. Supports shared governance activities and initiatives to improve processes and patient outcomes.\nDemonstrates effective communication, feedback, and conflict resolution skills. Promotes collaboration among healthcare team members. Assumes a leadership role in the care team and delegates appropriately to unlicensed personnel.\nPromotes a culture of safety through identifying threats to patient safety and intervening to prevent patient harm. Reports patient safety events and near misses in a timely manner. Seeks to identify potential safety issues and assists in the implementation of corrective actions.\nApplies ethical decision making, demonstrates respect and understanding for peers, and other clinical disciplines. Participates as an effective member of the patient care team to formulate an integrated, unbiased, individualized approach to care.\nParticipates in quality/process improvement initiatives to improve the functions of the department and the patient care experience.\nParticipates in professional activities which contribute to personal professional development and the development of others. Seeks opportunities to be taught, coached, and mentored. Attends required meetings/educational programs and completes annual competencies in a timely manner.\nMust be able to demonstrate knowledge and skills necessary to provide care appropriate to the age of the patients served. Must demonstrate knowledge of the principles of growth and development over the life span and possess the ability to assess data reflective of the patient's status and interpret the appropriate information needed to identify each patient's requirements relative to his/her age-specific needs, and to provide the care needed as described in the department's policies and procedures. Age-specific information is developed further in the departmental job standards.\n\nLicensure, Registration, and/or Certification Required:\nRegistered Nurse license issued by the state in which the team member practices, and\nBasic Life Support (BLS) for Healthcare Providers certification issued by the American Heart Association (AHA).\n\nEducation Required:\nCompletion of an accredited or approved program in Nursing.\n\nExperience Required:\nNew Grads WELCOME!\n\nKnowledge, Skills & Abilities Required:\nDemonstrates progression to provide holistic patient care and the ability to view clinical situations from a patient and family focus.\nDemonstrates progression to recognize situational changes that require unplanned or unanticipated interventions, and responds to situations with confidence, timeliness and flexibility.\nProficient computer skills, use of electronic mail and electronic medical records systems.\nExcellent communication (written and verbal), listening and interpersonal skills.\nDemonstrates human relation skills with the ability to develop rapport and maintain positive, professional relationships with a variety of patients, team members and physicians. Ability to take initiative and work collaboratively with others.\nDemonstrated ability to effectively make critical, independent decisions.\nExcellent organization, prioritization and problem-solving skills.\nDemonstrates time management skills with an ability to multi-task and prioritize in an environment with frequent interruptions.\nDemonstrates coordination, collaboration, delegation and team building skills.\nCertification Addendum:\nTeam members will maintain annual educational requirements for hospital based certifications (e.g. DNV, CARF or others)\n\nPhysical Requirements and Working Conditions:\nMust be able to sit, stand, walk, lift, squat, bend, reach above shoulders, and twist frequently throughout the workday.\nMust be able to:\nlift up to 50 lbs. from floor to waist.\nlift up to 20 lbs. over the head.\ncarry up to 40 lbs. a reasonable distance.\nMust be able to:\npush/pull with 30 lbs. of force.\nperform a sliding transfer of 150 lbs. with a second person present.\nPosition requires use of foot pedals on carts or machines.\nMay be exposed to chemical and hazardous waste as well as blood and body fluids and communicable disease. Therefore, protective clothing and equipment must be worn as necessary.\nMust have functional speech, vision, hearing, and touch with ability to use fine hand manipulation skills for IV insertion and other procedures/functions.\nOperates all equipment necessary to perform the job.\n\nThis job description indicates the general nature and level of work expected of the incumbent. It is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the incumbent. Incumbent may be required to perform other related duties.\n#AuroraGMKERN\nPay Range\n$37.50 - $56.25\nOur Commitment to You:\nAdvocate Health offers a comprehensive suite of Total Rewards: benefits and well-being programs, competitive compensation, generous retirement offerings, programs that invest in your career development and so much more – so you can live fully at and away from work, including:\nCompensation\nBase compensation listed within the listed pay range based on factors such as qualifications, skills, relevant experience, and/or training\nPremium pay such as shift, on call, and more based on a teammate's job\nIncentive pay for select positions\nOpportunity for annual increases based on performance\nBenefits and more\nPaid Time Off programs\nHealth and welfare benefits such as medical, dental, vision, life, and Short- and Long-Term Disability\nFlexible Spending Accounts for eligible health care and dependent care expenses\nFamily benefits such as adoption assistance and paid parental leave\nDefined contribution retirement plans with employer match and other financial wellness programs\nEducational Assistance Program\nAbout Advocate Health \nAdvocate Health is the third-largest nonprofit, integrated health system in the United States, created from the combination of Advocate Aurora Health and Atrium Health. Providing care under the names Advocate Health Care in Illinois; Atrium Health in the Carolinas, Georgia and Alabama; and Aurora Health Care in Wisconsin, Advocate Health is a national leader in clinical innovation, health outcomes, consumer experience and value-based care. Headquartered in Charlotte, North Carolina, Advocate Health services nearly 6 million patients and is engaged in hundreds of clinical trials and research studies, with Wake Forest University School of Medicine serving as the academic core of the enterprise. It is nationally recognized for its expertise in cardiology, neurosciences, oncology, pediatrics and rehabilitation, as well as organ transplants, burn treatments and specialized musculoskeletal programs. Advocate Health employs 155,000 teammates across 69 hospitals and over 1,000 care locations, and offers one of the nation’s largest graduate medical education programs with over 2,000 residents and fellows across more than 200 programs. Committed to providing equitable care for all, Advocate Health provides more than $6 billion in annual community benefits.",
        "job_location": "Aurora St Lukes Medical Center - 2900 W Oklahoma Ave"
    }
]